{
  "Praise & Admiration (প্রশংসা ও সম্মান)": {
    "acclaim": {
      "meaning": "To publicly praise someone for an achievement. like a movie receiving acclaim means everyone is talking about how great it is",
      "bengali": "প্রকাশ্যে প্রশংসা করা"
    },
    "accolade": {
      "meaning": "A formal honor or award given in recognition. think of it as a 'stamp of approval' from authorities or experts",
      "bengali": "পুরস্কার বা সম্মান"
    },
    "adulate": {
      "meaning": "To praise someone SO much that it feels fake or over-the-top. like obsessive fans worshipping a celebrity beyond reason",
      "bengali": "অতিরিক্ত তোষামোদ"
    },
    "commend": {
      "meaning": "To formally or officially express approval. a boss commends an employee, a judge commends a witness. It's respectful, not emotional",
      "bengali": "আনুষ্ঠানিকভাবে প্রশংসা"
    },
    "eulogize": {
      "meaning": "To speak glowingly about someone, especially at a funeral or tribute. it's praise that focuses on someone's legacy and life achievements",
      "bengali": "উচ্চ প্রশংসা করা (বিশেষত শ্রদ্ধাঞ্জলিতে)"
    },
    "extol": {
      "meaning": "To praise with real enthusiasm and energy. you extol the benefits of exercise because you genuinely believe in them",
      "bengali": "উৎসাহের সাথে গুণগান করা"
    },
    "exalt": {
      "meaning": "To raise someone to a higher status or position through praise. it literally means 'to lift up,' so think of placing someone on a pedestal",
      "bengali": "উচ্চে তোলা, মহিমান্বিত করা"
    },
    "laud": {
      "meaning": "To praise highly and publicly. similar to extol but slightly more formal, like a newspaper lauding a scientist's breakthrough",
      "bengali": "জনসমক্ষে উচ্চ প্রশংসা করা"
    },
    "lionize": {
      "meaning": "To treat someone like a celebrity or hero. the key idea is that society gives them special attention, like a 'lion' everyone wants to see",
      "bengali": "বিখ্যাত ব্যক্তি হিসেবে সমাদৃত করা"
    },
    "panegyric": {
      "meaning": "A formal speech or piece of writing that is ALL praise, no criticism. like a retirement speech where you only say wonderful things",
      "bengali": "সম্পূর্ণ প্রশংসামূলক বক্তৃতা/রচনা"
    },
    "tout": {
      "meaning": "To aggressively promote or advertise something's value. has a slightly pushy, salesman-like feel to it",
      "bengali": "জোরালোভাবে প্রচার করা"
    },
    "venerate": {
      "meaning": "To respect someone with deep, almost religious reverence. reserved for elders, traditions, or sacred things. Deeper than just 'respect'",
      "bengali": "গভীর শ্রদ্ধা করা"
    },
    "revere": {
      "meaning": "To feel deep admiration and respect. similar to venerate but can be used more broadly, like revering a teacher who changed your life",
      "bengali": "গভীর সম্মান ও শ্রদ্ধা করা"
    }
  },
  "Criticism & Disapproval (সমালোচনা ও অসম্মতি)": {
    "admonish": {
      "meaning": "To firmly warn or scold someone, but with the intent to correct them. a teacher admonishes a student to help them improve",
      "bengali": "সংশোধনের উদ্দেশ্যে সতর্ক করা"
    },
    "berate": {
      "meaning": "To scold someone angrily and at length. imagine a coach yelling at a player for several minutes straight",
      "bengali": "দীর্ঘক্ষণ ধরে রাগের সাথে বকা দেওয়া"
    },
    "castigate": {
      "meaning": "To criticize someone severely and publicly. stronger than scold, it's a formal, harsh punishment through words",
      "bengali": "প্রকাশ্যে কঠোর তিরস্কার করা"
    },
    "censure": {
      "meaning": "An official, formal expression of strong disapproval. like when a government body formally condemns a member's behavior",
      "bengali": "আনুষ্ঠানিকভাবে তীব্র অসম্মতি প্রকাশ"
    },
    "chastise": {
      "meaning": "To punish or criticize severely in order to correct behavior. combines the idea of punishment + teaching a lesson",
      "bengali": "শাস্তিমূলক কঠোর সমালোচনা"
    },
    "condemn": {
      "meaning": "To express complete, total disapproval with no room for forgiveness. the strongest form of public disapproval",
      "bengali": "সম্পূর্ণরূপে নিন্দা জানানো"
    },
    "decry": {
      "meaning": "To publicly speak out against something you believe is wrong or harmful. like activists decrying injustice",
      "bengali": "প্রকাশ্যে কোনো কিছুর বিরুদ্ধে বলা"
    },
    "denigrate": {
      "meaning": "To unfairly criticize someone to damage their reputation. the key word is 'unfairly,' it implies the criticism isn't deserved",
      "bengali": "অন্যায়ভাবে কারো সুনাম নষ্ট করা"
    },
    "denounce": {
      "meaning": "To publicly declare that something is wrong or evil. like a leader denouncing terrorism. It's a public, moral stand",
      "bengali": "প্রকাশ্যে ভুল/অন্যায় ঘোষণা করা"
    },
    "deride": {
      "meaning": "To mock or laugh at someone with contempt. not playful teasing, but cruel ridicule that shows you think they're worthless",
      "bengali": "ঘৃণামিশ্রিত উপহাস করা"
    },
    "disparage": {
      "meaning": "To speak about someone or something in a way that makes them seem unimportant or inferior. subtle belittling, not loud criticism",
      "bengali": "কাউকে ছোট বা গুরুত্বহীন দেখানো"
    },
    "excoriate": {
      "meaning": "To criticize SO harshly it's like stripping skin off. the most intense form of verbal criticism, absolutely brutal",
      "bengali": "অত্যন্ত তীব্র ও নির্মম সমালোচনা করা"
    },
    "lambaste": {
      "meaning": "To criticize harshly and thoroughly. like a reviewer who tears apart every aspect of a bad movie",
      "bengali": "সর্বাঙ্গীনভাবে কঠোর সমালোচনা"
    },
    "rebuke": {
      "meaning": "A sharp, quick expression of disapproval. shorter and more pointed than berate. A single cutting remark, not a long speech",
      "bengali": "তীক্ষ্ণভাবে অসম্মতি জানানো"
    },
    "reproach": {
      "meaning": "To express disappointment in someone's behavior. gentler than rebuke, carries sadness more than anger",
      "bengali": "হতাশা মিশ্রিত অসম্মতি প্রকাশ"
    },
    "reprimand": {
      "meaning": "A formal, official scolding from someone in authority. like an HR department issuing a written reprimand",
      "bengali": "কর্তৃপক্ষের পক্ষ থেকে আনুষ্ঠানিক তিরস্কার"
    },
    "scathing": {
      "meaning": "Severely critical in a way that's witty and devastating. a scathing review doesn't just say 'bad,' it destroys with clever words",
      "bengali": "ধারালো ও ধ্বংসাত্মকভাবে সমালোচনামূলক"
    },
    "upbraid": {
      "meaning": "To scold someone severely for doing something wrong. similar to rebuke but slightly longer and more emotional",
      "bengali": "ভুলের জন্য কঠোরভাবে বকা দেওয়া"
    },
    "vituperate": {
      "meaning": "To attack someone with bitter, abusive language. the harshest verbal abuse, going beyond criticism into personal attacks",
      "bengali": "তিক্ত গালিগালাজ করে আক্রমণ করা"
    },
    "vilify": {
      "meaning": "To deliberately spread negative things about someone to ruin their image. a planned campaign to destroy reputation",
      "bengali": "ইচ্ছাকৃতভাবে কুৎসা রটনা করা"
    },
    "indict": {
      "meaning": "To formally accuse someone of wrongdoing. originally a legal term, now used broadly for any serious accusation",
      "bengali": "আনুষ্ঠানিকভাবে অভিযুক্ত করা"
    },
    "impugn": {
      "meaning": "To challenge or question the truth or honesty of something. you impugn someone's motives when you say 'they have a hidden agenda'",
      "bengali": "সত্যতা বা সততা নিয়ে প্রশ্ন তোলা"
    },
    "inveigh": {
      "meaning": "To speak or write against something with strong hostility. like a columnist who passionately attacks a policy week after week",
      "bengali": "তীব্র শত্রুতার সাথে বিরোধিতা করা"
    },
    "acerbic": {
      "meaning": "Sharp, cutting, and bitter in tone. An acerbic remark stings because it is direct, witty, and often cruelly accurate in its criticism.",
      "bengali": "তীক্ষ্ণ ও তিক্ত"
    },
    "caustic": {
      "meaning": "Harshly sarcastic and biting in a way that can emotionally burn. Caustic criticism corrodes confidence and leaves lasting marks, like acid on skin.",
      "bengali": "কটু ও ক্ষয়কারী"
    },
    "sardonic": {
      "meaning": "Grimly mocking or cynical. A sardonic comment has a dark, contemptuous edge. The speaker seems to find bitter amusement in what they are criticizing.",
      "bengali": "বিদ্রূপাত্মক"
    },
    "vitriolic": {
      "meaning": "Filled with bitter, venomous hatred in speech or writing. Vitriolic language is the most extreme form of verbal attack, dripping with poison and hostility.",
      "bengali": "বিষাক্ত ও তীব্র"
    },
    "deplore": {
      "meaning": "To feel or express deep disapproval and moral outrage about something. When you deplore something, you find it deeply wrong and regrettable.",
      "bengali": "তীব্র নিন্দা করা"
    },
    "disapprove": {
      "meaning": "To think negatively of something or consider it wrong. It signals a personal or moral judgment that something falls below acceptable standards.",
      "bengali": "অসম্মতি প্রকাশ"
    },
    "odious": {
      "meaning": "Extremely hateful and disgusting. Something odious provokes strong moral revulsion. It is not merely disliked but deeply repugnant.",
      "bengali": "ঘৃণ্য"
    },
    "pillory": {
      "meaning": "To publicly attack, criticize, or humiliate someone. Originally referred to the wooden frame used for public punishment, now used for any form of public shaming.",
      "bengali": "প্রকাশ্যে অপমান করা"
    },
    "pejorative": {
      "meaning": "A word or expression that conveys disapproval or contempt. When something is pejorative, it carries a built-in negative judgment about its subject.",
      "bengali": "নিন্দাসূচক"
    },
    "mock": {
      "meaning": "To ridicule or make fun of someone with contempt. Mocking goes beyond teasing because it aims to belittle and show scorn.",
      "bengali": "বিদ্রূপ করা"
    },
    "lamentable": {
      "meaning": "So bad that it deserves regret and criticism. Something lamentable is sadly deplorable, making people shake their heads in disappointment.",
      "bengali": "শোচনীয়"
    },
    "egregious": {
      "meaning": "Shockingly bad in a way that cannot be ignored. An egregious error is so conspicuous and terrible that it stands out as an extreme example of wrongdoing.",
      "bengali": "চরমভাবে খারাপ"
    },
    "indefensible": {
      "meaning": "Impossible to justify or defend on moral or logical grounds. An indefensible position has no valid argument supporting it.",
      "bengali": "অসমর্থনীয়"
    },
    "discredit": {
      "meaning": "To damage someone's reputation or prove something false. When you discredit a theory, you show it has no valid basis. When you discredit a person, you undermine trust in them.",
      "bengali": "অসম্মান করা"
    },
    "slander": {
      "meaning": "A false spoken statement intended to damage someone's reputation. Unlike criticism, slander is specifically untrue and meant to harm.",
      "bengali": "মিথ্যা অপবাদ"
    },
    "malign": {
      "meaning": "To speak about someone in a harmful, damaging way. Also used as an adjective meaning evil or harmful in influence.",
      "bengali": "কুৎসা রটানো"
    },
    "invidious": {
      "meaning": "Unfairly discriminating and likely to cause resentment. Invidious comparisons single out people for unfair negative treatment.",
      "bengali": "বিদ্বেষমূলক"
    }
  },
  "Deception & Dishonesty (প্রতারণা ও অসততা)": {
    "beguile": {
      "meaning": "To charm or enchant someone in a way that deceives them. the deception is wrapped in attractiveness, like a con artist with a beautiful smile",
      "bengali": "মোহিত করে প্রতারণা করা"
    },
    "charlatan": {
      "meaning": "A person who falsely claims to have special knowledge or skills. like a fake doctor or a self-proclaimed guru who knows nothing",
      "bengali": "ভণ্ড বিশেষজ্ঞ, জ্ঞানের ভান করে এমন ব্যক্তি"
    },
    "chicanery": {
      "meaning": "The use of clever tricks and deception to achieve something. legal loopholes, fine print manipulation, bureaucratic tricks",
      "bengali": "চালাকি ও ছলচাতুরীর মাধ্যমে কিছু অর্জন"
    },
    "cozen": {
      "meaning": "To trick or cheat someone out of something. usually involves persuading someone to give up money or possessions through deception",
      "bengali": "ঠকিয়ে কিছু হাতিয়ে নেওয়া"
    },
    "duplicity": {
      "meaning": "Saying one thing but secretly doing the opposite. double-dealing, like pretending to be a friend while working against someone behind their back",
      "bengali": "দ্বিমুখী আচরণ, এক কথা বলে অন্য কাজ করা"
    },
    "dissemble": {
      "meaning": "To hide your true feelings, motives, or beliefs behind a false appearance. you smile while you're angry inside",
      "bengali": "ভেতরের প্রকৃত অনুভূতি লুকিয়ে মিথ্যা বাইরের রূপ দেখানো"
    },
    "disingenuous": {
      "meaning": "Pretending to be honest or innocent when you're not. someone who asks a question they already know the answer to, just to manipulate",
      "bengali": "সৎ বা নির্দোষ ভান করা যখন আসলে তা নয়"
    },
    "equivocate": {
      "meaning": "To deliberately use vague or unclear language to avoid committing to a position. politicians equivocate when they don't want to say yes or no",
      "bengali": "ইচ্ছাকৃতভাবে অস্পষ্ট ভাষায় সরাসরি উত্তর এড়ানো"
    },
    "feign": {
      "meaning": "To pretend to feel or experience something. feigning illness to skip work, feigning surprise when you already knew",
      "bengali": "ভান করা (অসুস্থতা, আবেগ ইত্যাদির)"
    },
    "guile": {
      "meaning": "Sly, clever cunning used to deceive. not brute force deception, but subtle, intelligent trickery",
      "bengali": "সূক্ষ্ম ও বুদ্ধিমান ধূর্ততা"
    },
    "mendacious": {
      "meaning": "Habitually lying. not just one lie, but a person whose entire character is built on untruthfulness",
      "bengali": "অভ্যাসগতভাবে মিথ্যাবাদী"
    },
    "perfidious": {
      "meaning": "Deliberately betraying trust. the worst kind of dishonesty because it breaks a bond of faith, like a perfidious ally who switches sides",
      "bengali": "ইচ্ছাকৃতভাবে বিশ্বাসঘাতক"
    },
    "prevaricate": {
      "meaning": "To avoid giving a direct answer by speaking in a misleading way. not lying outright, but dancing around the truth",
      "bengali": "সত্যের চারপাশে ঘুরে সরাসরি উত্তর এড়ানো"
    },
    "specious": {
      "meaning": "Something that looks correct or logical on the surface but is actually wrong. a specious argument sounds convincing until you think carefully",
      "bengali": "বাইরে সঠিক মনে হয় কিন্তু আসলে ভুল"
    },
    "surreptitious": {
      "meaning": "Done in secret because it would be disapproved of if discovered. sneaking, stealthy, like reading someone's diary when they're not looking",
      "bengali": "লুকিয়ে গোপনে করা (ধরা পড়লে সমস্যা হবে বলে)"
    },
    "subterfuge": {
      "meaning": "A trick or strategy used to escape or achieve something by hiding the truth. like faking an emergency to leave a boring meeting",
      "bengali": "সত্য লুকিয়ে কিছু অর্জনের কৌশল বা চাল"
    },
    "spurious": {
      "meaning": "Not genuine, not what it claims to be. a spurious document is a forgery, a spurious claim has no real basis in truth",
      "bengali": "নকল, যা দাবি করে তা নয়, ভিত্তিহীন"
    },
    "duplicitous": {
      "meaning": "Deliberately deceitful, saying one thing while meaning another. A duplicitous person maintains two faces, presenting different truths to different people.",
      "bengali": "দ্বিমুখী"
    },
    "underhanded": {
      "meaning": "Done secretly and dishonestly, behind people's backs. Underhanded tactics are sneaky and unfair.",
      "bengali": "গোপন ও অসৎ"
    },
    "deceptive": {
      "meaning": "Giving a misleading impression, whether intentionally or not. Something deceptive makes you believe something that is not true.",
      "bengali": "প্রতারণামূলক"
    },
    "corrupt": {
      "meaning": "Morally decayed and dishonest, especially when using power for personal gain. Corruption signals systemic moral failure, not just individual dishonesty.",
      "bengali": "দুর্নীতিগ্রস্ত"
    },
    "illicit": {
      "meaning": "Forbidden by law, rules, or custom. Illicit activity is conducted in violation of established standards and regulations.",
      "bengali": "অবৈধ"
    },
    "betray": {
      "meaning": "To be disloyal to someone who trusts you, or to accidentally reveal something hidden. Betrayal involves breaking faith or unintentionally exposing secrets.",
      "bengali": "বিশ্বাসঘাতকতা করা"
    },
    "perfidy": {
      "meaning": "Deliberate treachery and betrayal of trust. Perfidy is the most severe form of betrayal, involving calculated deception of those who trusted you.",
      "bengali": "বিশ্বাসঘাতকতা"
    },
    "belie": {
      "meaning": "To give a false impression of something, or to contradict what appears to be true. The surface appearance belies the deeper reality underneath.",
      "bengali": "মিথ্যা ধারণা দেওয়া"
    },
    "veneer": {
      "meaning": "A thin, superficial layer that hides what is really underneath. A veneer of politeness might cover deep hostility. It signals that appearances deceive.",
      "bengali": "বাহ্যিক আবরণ"
    },
    "casuistic": {
      "meaning": "Using clever but misleading reasoning to justify questionable actions. Casuistic arguments sound logical but are morally dishonest.",
      "bengali": "কুতর্কপূর্ণ"
    },
    "glib": {
      "meaning": "Speaking smoothly and fluently but without sincerity or depth. Glib answers sound polished but lack real substance or honesty.",
      "bengali": "চটকদার কিন্তু অগভীর"
    }
  },
  "Honesty & Truth (সততা ও সত্য)": {
    "candid": {
      "meaning": "Saying what you truly think without filtering or sugarcoating. a candid friend tells you the hard truth even when it's uncomfortable",
      "bengali": "সরাসরি সত্য বলা, মোড়ক ছাড়া"
    },
    "forthright": {
      "meaning": "Going straight to the point without hesitation. a forthright person addresses problems directly instead of beating around the bush",
      "bengali": "দ্বিধা ছাড়া সরাসরি মূল কথায় যাওয়া"
    },
    "frank": {
      "meaning": "Open and honest in expressing opinions. similar to candid but more casual, like a frank conversation between friends",
      "bengali": "খোলামেলা ও সৎভাবে মতামত প্রকাশ"
    },
    "guileless": {
      "meaning": "Completely without cunning or deception. a guileless person is genuinely innocent, they don't even know HOW to manipulate",
      "bengali": "সম্পূর্ণ নিষ্কপট, কোনো ধূর্ততা নেই"
    },
    "ingenuous": {
      "meaning": "Innocent and trusting, sometimes to the point of being naive. a child-like openness that hasn't been corrupted by experience",
      "bengali": "সরল ও বিশ্বাসপ্রবণ, কখনো অতি সরল"
    },
    "integrity": {
      "meaning": "The quality of being honest and having strong moral principles that you don't compromise even when no one is watching",
      "bengali": "নৈতিক সততা যা কেউ না দেখলেও বজায় থাকে"
    },
    "probity": {
      "meaning": "Complete, proven honesty and integrity. stronger than integrity, it implies a track record of being ethical, especially in public life",
      "bengali": "প্রমাণিত ও সম্পূর্ণ নৈতিক সততা"
    },
    "scrupulous": {
      "meaning": "Being extremely careful to do what is right and ethical in every detail. a scrupulous accountant checks every number three times",
      "bengali": "প্রতিটি বিষয়ে অত্যন্ত সতর্ক ও নীতিনিষ্ঠ"
    },
    "sincere": {
      "meaning": "Genuinely meaning what you say or feel. no hidden agenda, no performance, your words match your true feelings",
      "bengali": "আন্তরিক. কথা ও অনুভূতি একই"
    },
    "transparent": {
      "meaning": "Operating in a way where nothing is hidden. a transparent government shares information openly so citizens can see what's happening",
      "bengali": "কিছুই লুকানো নেই এমনভাবে কাজ করা"
    },
    "veracious": {
      "meaning": "Habitually speaking the truth. the opposite of mendacious. A veracious person is known for always being truthful",
      "bengali": "অভ্যাসগতভাবে সত্যবাদী"
    },
    "veracity": {
      "meaning": "The quality of being true or accurate. we question the veracity of a claim when we doubt whether it's really true",
      "bengali": "সত্যতা বা নির্ভুলতার গুণ"
    },
    "vindicate": {
      "meaning": "To prove that someone who was blamed or doubted was actually right all along. 'I told you so' but in a dignified way",
      "bengali": "প্রমাণ করা যে দোষারোপিত ব্যক্তি আসলে সঠিক ছিল"
    },
    "candor": {
      "meaning": "Complete honesty and openness in speech. Someone with candor tells you the truth directly, without sugarcoating or hiding anything.",
      "bengali": "স্পষ্টবাদিতা"
    },
    "bona fide": {
      "meaning": "Genuine and authentic, verified as real. When something is bona fide, there is no doubt about its legitimacy.",
      "bengali": "প্রকৃত ও খাঁটি"
    },
    "credible": {
      "meaning": "Believable and trustworthy. A credible source or claim has enough evidence and reliability to be taken seriously.",
      "bengali": "বিশ্বাসযোগ্য"
    },
    "manifest": {
      "meaning": "So clear and obvious that it cannot be denied or overlooked. When something is manifest, everyone can see it plainly.",
      "bengali": "সুস্পষ্ট"
    },
    "overt": {
      "meaning": "Done openly and without any attempt to hide. Overt actions are visible and undisguised, the opposite of covert.",
      "bengali": "প্রকাশ্য"
    },
    "verisimilitude": {
      "meaning": "The appearance of being true or real, even in fiction. A story with verisimilitude feels believable because its details ring true.",
      "bengali": "সত্যের আভাস"
    },
    "valid": {
      "meaning": "Logically sound and well-founded. A valid argument follows correct reasoning. A valid claim has legitimate basis.",
      "bengali": "যুক্তিসঙ্গত"
    },
    "validate": {
      "meaning": "To confirm or prove something is true, correct, or legitimate. Validation provides formal or empirical evidence of correctness.",
      "bengali": "বৈধতা দেওয়া"
    },
    "affirm": {
      "meaning": "To state confidently and positively that something is true. Affirming shows conviction and certainty in your declaration.",
      "bengali": "দৃঢ়ভাবে বলা"
    },
    "upright": {
      "meaning": "Honest, moral, and principled. An upright person consistently does what is right, even when it is difficult.",
      "bengali": "সৎ ও নীতিপরায়ণ"
    },
    "ethical": {
      "meaning": "Conforming to accepted moral principles and standards of right conduct. Ethical behavior reflects thoughtful moral reasoning.",
      "bengali": "নৈতিক"
    },
    "disinterested": {
      "meaning": "Impartial and unbiased, not influenced by personal interest. A disinterested judge makes fair decisions because they have no stake in the outcome.",
      "bengali": "নিরপেক্ষ"
    },
    "impartial": {
      "meaning": "Treating all sides fairly and equally without favoritism. An impartial observer has no personal bias affecting their judgment.",
      "bengali": "নিরপেক্ষ"
    },
    "evenhanded": {
      "meaning": "Treating everyone with equal fairness. An evenhanded approach gives balanced consideration to all sides of an issue.",
      "bengali": "সুষম ও ন্যায়সঙ্গত"
    },
    "objective": {
      "meaning": "Based on facts rather than personal feelings or opinions. Objective analysis removes personal bias to focus on evidence.",
      "bengali": "বস্তুনিষ্ঠ"
    },
    "equitable": {
      "meaning": "Fair and just in how things are distributed or decided. Equitable treatment ensures everyone gets what they deserve based on need and circumstance.",
      "bengali": "ন্যায়সঙ্গত"
    }
  },
  "Increase & Strengthen (বৃদ্ধি ও শক্তিশালীকরণ)": {
    "accentuate": {
      "meaning": "To make something more noticeable or prominent. like wearing red lipstick to accentuate your lips, or data that accentuates a trend",
      "bengali": "কোনো কিছুকে আরও লক্ষণীয় ও প্রকট করা"
    },
    "accent": {
      "meaning": "To emphasize or highlight a particular point or feature. drawing special attention to one aspect among many",
      "bengali": "বিশেষ জোর দেওয়া বা গুরুত্ব আরোপ করা"
    },
    "aggrandize": {
      "meaning": "To increase someone's power, status, or wealth, often in an exaggerated way. a leader who aggrandizes themselves is grabbing more power than deserved",
      "bengali": "ক্ষমতা/মর্যাদা বাড়ানো, প্রায়ই অতিরঞ্জিতভাবে"
    },
    "amplify": {
      "meaning": "To make something bigger, louder, or more intense. like amplifying sound through a speaker, or amplifying a message through media",
      "bengali": "কিছুকে বড়, জোরালো বা তীব্রতর করা"
    },
    "augment": {
      "meaning": "To add to something to make it greater. you augment your income with a side job, augment a team by hiring more people",
      "bengali": "যোগ করে বৃদ্ধি করা"
    },
    "bolster": {
      "meaning": "To support or strengthen something that is weak or struggling. like bolstering a sagging economy with new policies, or bolstering someone's confidence",
      "bengali": "দুর্বল কিছুকে সমর্থন দিয়ে শক্তিশালী করা"
    },
    "burgeon": {
      "meaning": "To grow or expand rapidly. like a business that suddenly takes off, or a city's population burgeoning in just a few years",
      "bengali": "হঠাৎ দ্রুতগতিতে বৃদ্ধি পাওয়া বা বিকশিত হওয়া"
    },
    "buttress": {
      "meaning": "To strengthen with supporting evidence or structure. originally a wall support in architecture, now means reinforcing an argument or position",
      "bengali": "ভিত্তি বা প্রমাণ দিয়ে শক্তিশালী করা"
    },
    "consolidate": {
      "meaning": "To bring separate things together into one stronger whole. like consolidating power by merging departments, or consolidating debts into one loan",
      "bengali": "আলাদা জিনিস একত্র করে শক্তিশালী করা"
    },
    "corroborate": {
      "meaning": "To confirm or support a statement with additional evidence. a witness corroborates a story by telling the same version independently",
      "bengali": "অতিরিক্ত প্রমাণ দিয়ে কোনো বক্তব্য সমর্থন করা"
    },
    "enhance": {
      "meaning": "To improve the quality, value, or extent of something. making something that's already good even better",
      "bengali": "ইতিমধ্যে ভালো কিছুকে আরও উন্নত করা"
    },
    "escalate": {
      "meaning": "To increase rapidly in intensity or seriousness. a small argument escalates into a full fight, costs escalate out of control",
      "bengali": "দ্রুত তীব্রতা বা গুরুত্বে বৃদ্ধি পাওয়া"
    },
    "exacerbate": {
      "meaning": "To make a bad situation even worse. NOT to cause a problem, but to worsen one that already exists. Rain exacerbates flooding",
      "bengali": "ইতিমধ্যে খারাপ পরিস্থিতি আরও খারাপ করা"
    },
    "fortify": {
      "meaning": "To strengthen against attack or challenge. fortify a castle wall, fortify your immune system, fortify an argument with evidence",
      "bengali": "আক্রমণ বা চ্যালেঞ্জের বিরুদ্ধে শক্তিশালী করা"
    },
    "galvanize": {
      "meaning": "To shock or excite someone into taking action. a tragic event galvanizes a community to demand change. It's about sparking movement",
      "bengali": "ঝাঁকুনি দিয়ে কাউকে কাজে উদ্বুদ্ধ করা"
    },
    "heighten": {
      "meaning": "To make a feeling or effect more intense. heightened security means extra alertness, heightened tension means everyone feels the pressure more",
      "bengali": "অনুভূতি বা প্রভাবকে আরও তীব্র করা"
    },
    "proliferate": {
      "meaning": "To increase rapidly in number, spreading everywhere. like how smartphones proliferated in the 2010s, going from rare to everywhere",
      "bengali": "দ্রুত সংখ্যায় বৃদ্ধি পেয়ে সর্বত্র ছড়িয়ে পড়া"
    },
    "reinforce": {
      "meaning": "To make something stronger by adding extra support. reinforcing a wall with steel, or reinforcing a habit by repeating it daily",
      "bengali": "অতিরিক্ত সমর্থন যোগ করে আরও শক্তিশালী করা"
    },
    "substantiate": {
      "meaning": "To provide solid evidence that proves something is true. you substantiate a claim by showing data, documents, or proof",
      "bengali": "শক্ত প্রমাণ দিয়ে কিছু সত্য বলে প্রমাণ করা"
    },
    "aggravate": {
      "meaning": "To make an already bad situation even worse. Aggravating adds fuel to an existing problem, intensifying its severity.",
      "bengali": "আরও খারাপ করা"
    },
    "compound": {
      "meaning": "To combine elements together, and more commonly on the GRE, to make a problem worse by adding to it layer by layer.",
      "bengali": "যৌগিক করা / বাড়ানো"
    },
    "intensify": {
      "meaning": "To make something stronger, more extreme, or more severe. Intensifying raises the degree of whatever is already happening.",
      "bengali": "তীব্র করা"
    },
    "inflame": {
      "meaning": "To deliberately make anger, conflict, or a situation much worse. Inflammatory words are designed to provoke strong, often violent reactions.",
      "bengali": "উত্তেজিত করা"
    },
    "invigorate": {
      "meaning": "To fill with energy and renewed strength. Something invigorating makes you feel alive and revitalized.",
      "bengali": "উদ্দীপিত করা"
    },
    "energize": {
      "meaning": "To give energy and enthusiasm to someone or something. Energizing brings fresh vitality to a tired situation.",
      "bengali": "শক্তি দেওয়া"
    },
    "spur": {
      "meaning": "To stimulate or encourage action. A spur is something that pushes you forward, motivating progress or change.",
      "bengali": "উৎসাহিত করা"
    },
    "foster": {
      "meaning": "To encourage and support the growth or development of something over time. Fostering implies patient, nurturing cultivation.",
      "bengali": "লালন করা"
    },
    "engender": {
      "meaning": "To cause something to come into existence. Engendering creates new feelings, situations, or ideas where none existed before.",
      "bengali": "সৃষ্টি করা"
    },
    "generate": {
      "meaning": "To produce or create something. Generating brings something new into being, whether ideas, energy, or outcomes.",
      "bengali": "উৎপন্ন করা"
    },
    "copious": {
      "meaning": "Very large in quantity, abundant. Copious notes, copious evidence. there is simply a lot of it.",
      "bengali": "প্রচুর"
    },
    "profuse": {
      "meaning": "Produced or given in extremely large amounts, almost overflowing. Profuse sweating, profuse apologies. the abundance is notable.",
      "bengali": "অতিপ্রচুর"
    }
  },
  "Decrease & Weaken (হ্রাস ও দুর্বলকরণ)": {
    "abate": {
      "meaning": "To gradually become less intense. a storm abates, anger abates, pain abates. It doesn't stop suddenly; it slowly fades away",
      "bengali": "ধীরে ধীরে তীব্রতা কমে আসা"
    },
    "attenuate": {
      "meaning": "To make something thinner, weaker, or less forceful. like a signal that gets weaker over distance, or an argument weakened by poor evidence",
      "bengali": "পাতলা, দুর্বল বা কম শক্তিশালী করা"
    },
    "curtail": {
      "meaning": "To cut short or reduce something. curtailing spending means cutting your budget, curtailing freedom means limiting rights",
      "bengali": "কমিয়ে দেওয়া বা সংক্ষিপ্ত করা"
    },
    "debilitate": {
      "meaning": "To make someone so weak they can barely function. a debilitating disease doesn't just make you sick, it takes away your ability to do normal things",
      "bengali": "এতটাই দুর্বল করা যে স্বাভাবিক কাজ করা কঠিন হয়ে যায়"
    },
    "deplete": {
      "meaning": "To use up a resource until very little is left. depleting savings, depleting natural resources. The emphasis is on using something UP",
      "bengali": "সম্পদ ব্যবহার করতে করতে প্রায় শেষ করে ফেলা"
    },
    "diminish": {
      "meaning": "To make or become smaller, fewer, or less. a general word for reduction. His influence diminished over time, returns diminished",
      "bengali": "ছোট, কম বা হ্রাস পাওয়া/করা"
    },
    "dwindle": {
      "meaning": "To gradually shrink to almost nothing. stronger than diminish, it implies nearly disappearing. Savings dwindled to just $50",
      "bengali": "ধীরে ধীরে কমতে কমতে প্রায় শূন্যে আসা"
    },
    "ebb": {
      "meaning": "To gradually flow away or decline. like the tide going out. Enthusiasm ebbs, power ebbs. There's a natural, slow quality to it",
      "bengali": "ধীরে ধীরে সরে যাওয়া বা হ্রাস পাওয়া (জোয়ার ভাটার মতো)"
    },
    "enervate": {
      "meaning": "To drain someone of energy and vitality. TRICKY: it does NOT mean to energize! It means the opposite. The heat enervated everyone",
      "bengali": "শক্তি ও প্রাণশক্তি শুষে নেওয়া (সতর্কতা: energize নয়!)"
    },
    "erode": {
      "meaning": "To gradually wear away or destroy over time. like water eroding rock. Trust erodes, support erodes. It's slow, steady destruction",
      "bengali": "সময়ের সাথে ধীরে ধীরে ক্ষয় করা (পানিতে পাথর ক্ষয়ের মতো)"
    },
    "mitigate": {
      "meaning": "To make something bad less severe or painful. you can't eliminate the problem, but you reduce its impact. Mitigate risk, mitigate damage",
      "bengali": "খারাপ কিছুর তীব্রতা বা প্রভাব কমানো (দূর করা নয়)"
    },
    "mollify": {
      "meaning": "To calm someone down when they're angry or upset. offering an apology to mollify a furious customer. It's about soothing emotions",
      "bengali": "রাগান্বিত বা বিচলিত কাউকে শান্ত ও প্রশমিত করা"
    },
    "palliate": {
      "meaning": "To make a disease or problem less painful WITHOUT actually curing it. treating symptoms, not the root cause. A temporary relief",
      "bengali": "সমস্যার মূল সমাধান না করে উপসর্গ কমানো"
    },
    "subside": {
      "meaning": "To become less intense and gradually settle down. floodwaters subside, excitement subsides, swelling subsides. Returning to normal",
      "bengali": "তীব্রতা কমে স্বাভাবিক অবস্থায় ফিরে আসা"
    },
    "temper": {
      "meaning": "To moderate or tone something down. tempering enthusiasm with reality, tempering justice with mercy. Bringing balance",
      "bengali": "সংযত করা, ভারসাম্য আনা"
    },
    "undermine": {
      "meaning": "To secretly or gradually weaken something from within. like termites undermining a house's foundation. You don't attack directly; you erode the base",
      "bengali": "ভেতর থেকে গোপনে বা ধীরে ধীরে দুর্বল করা"
    },
    "wane": {
      "meaning": "To decrease gradually in power, importance, or visibility. like the moon waning from full to crescent. Influence wanes, popularity wanes",
      "bengali": "ধীরে ধীরে ক্ষমতা/গুরুত্ব কমা (চাঁদের ক্ষয়ের মতো)"
    },
    "allay": {
      "meaning": "To reduce or calm someone's fears, worries, or suspicions. Allaying brings emotional relief by addressing the source of anxiety.",
      "bengali": "প্রশমিত করা"
    },
    "alleviate": {
      "meaning": "To make suffering or a problem less severe, though not completely eliminate it. Alleviating provides partial relief, not a full cure.",
      "bengali": "লাঘব করা"
    },
    "ameliorate": {
      "meaning": "To make a bad situation better or improve conditions. Ameliorating takes something negative and moves it in a positive direction.",
      "bengali": "উন্নতি করা"
    },
    "assuage": {
      "meaning": "To soothe, ease, or relieve feelings of pain, guilt, or distress. Assuaging brings comfort to emotional or physical suffering.",
      "bengali": "প্রশমিত করা"
    },
    "appease": {
      "meaning": "To calm someone's anger or satisfy their demands, often by making concessions. Appeasement implies giving in to avoid conflict.",
      "bengali": "তুষ্ট করা"
    },
    "pacify": {
      "meaning": "To bring peace to a situation or calm someone who is agitated. Pacifying restores tranquility after disturbance.",
      "bengali": "শান্ত করা"
    },
    "placate": {
      "meaning": "To stop someone from being angry by making efforts to please them. Placating is specifically about reducing someone's anger.",
      "bengali": "তুষ্ট করা"
    },
    "quell": {
      "meaning": "To forcefully suppress or put an end to something, like a rebellion or fear. Quelling uses strength or authority to stop something.",
      "bengali": "দমন করা"
    },
    "decline": {
      "meaning": "To gradually decrease or become weaker. Also means to politely refuse. On the GRE, often signals a downward trend.",
      "bengali": "হ্রাস পাওয়া"
    },
    "downplay": {
      "meaning": "To deliberately make something seem less important or serious than it really is. Downplaying is a strategic understatement.",
      "bengali": "গুরুত্ব কমানো"
    },
    "minimize": {
      "meaning": "To reduce something to the smallest possible amount, or to make it seem less important. Minimizing can be practical or deceptive.",
      "bengali": "ন্যূনতম করা"
    },
    "dearth": {
      "meaning": "A serious shortage or lack of something. A dearth of evidence means there is critically insufficient proof available.",
      "bengali": "অভাব"
    },
    "paucity": {
      "meaning": "An insufficient amount of something. Paucity signals that what is available falls short of what is needed.",
      "bengali": "স্বল্পতা"
    }
  },
  "Eliminate & Remove (নির্মূল ও অপসারণ)": {
    "abolish": {
      "meaning": "To completely and officially end a system, practice, or institution. abolishing slavery, abolishing a law. Total, permanent elimination",
      "bengali": "কোনো ব্যবস্থা/প্রথা সম্পূর্ণ ও আনুষ্ঠানিকভাবে বিলুপ্ত করা"
    },
    "abrogate": {
      "meaning": "To formally repeal or cancel a law, agreement, or right. a legal/official act of undoing something that was formally established",
      "bengali": "আনুষ্ঠানিকভাবে আইন বা চুক্তি বাতিল করা"
    },
    "annul": {
      "meaning": "To declare something legally invalid, as if it never existed. annulling a marriage means legally it never happened",
      "bengali": "আইনত অবৈধ ঘোষণা করা, যেন কখনো হয়নি"
    },
    "efface": {
      "meaning": "To erase or make something disappear. time effaces memories, weather effaces inscriptions. A gradual wiping away",
      "bengali": "মুছে ফেলা বা অদৃশ্য করা"
    },
    "eradicate": {
      "meaning": "To completely destroy something down to its roots so it can never come back. eradicating a disease means it's gone permanently worldwide",
      "bengali": "মূল থেকে সম্পূর্ণ ধ্বংস করা যাতে আর কখনো ফিরে না আসে"
    },
    "expunge": {
      "meaning": "To erase or remove something completely from a record. expunging a criminal record means officially deleting it as if it never happened",
      "bengali": "রেকর্ড থেকে সম্পূর্ণ মুছে ফেলা"
    },
    "extirpate": {
      "meaning": "To root out and destroy completely. like pulling a weed out by its roots. Stronger than eradicate, implies physical removal",
      "bengali": "শিকড়সহ উপড়ে ফেলে সম্পূর্ণ ধ্বংস করা"
    },
    "nullify": {
      "meaning": "To make something legally void or ineffective. the court nullified the contract, meaning it no longer has any legal power",
      "bengali": "আইনত অকার্যকর বা শূন্য করা"
    },
    "obviate": {
      "meaning": "To remove the need for something by preventing the problem in the first place. a good plan obviates the need for emergency responses",
      "bengali": "সমস্যা প্রতিরোধ করে কোনো কিছুর প্রয়োজন দূর করা"
    },
    "purge": {
      "meaning": "To forcefully remove unwanted people or elements. purging dissenters from a party, purging old files from a system. Often implies ruthlessness",
      "bengali": "অবাঞ্ছিত ব্যক্তি বা উপাদান জোরপূর্বক দূর করা"
    },
    "rescind": {
      "meaning": "To officially take back or cancel a decision, law, or order. rescinding an offer means withdrawing it after it was already made",
      "bengali": "ইতিমধ্যে দেওয়া সিদ্ধান্ত/আদেশ আনুষ্ঠানিকভাবে প্রত্যাহার করা"
    },
    "revoke": {
      "meaning": "To officially cancel a right, license, or privilege. revoking a driver's license, revoking access. Taking away something that was granted",
      "bengali": "প্রদত্ত অধিকার বা সুযোগ আনুষ্ঠানিকভাবে বাতিল করা"
    },
    "supersede": {
      "meaning": "To replace something older or less effective with something new. email superseded fax machines, not by destroying them but by being better",
      "bengali": "পুরানো বা কম কার্যকর কিছুর স্থান নতুন কিছু দিয়ে প্রতিস্থাপন"
    },
    "debunk": {
      "meaning": "To expose something as false or exaggerated, destroying a myth or widely held but incorrect belief. Debunking strips away the illusion.",
      "bengali": "মিথ্যা প্রমাণ করা"
    },
    "invalidate": {
      "meaning": "To prove that something is wrong, making it legally or logically worthless. Invalidating removes the foundation of an argument or claim.",
      "bengali": "অবৈধ করা"
    },
    "supplant": {
      "meaning": "To take the place of something, often by force or scheming. The new replaces the old, usually permanently.",
      "bengali": "স্থানচ্যুত করা"
    },
    "displace": {
      "meaning": "To force something or someone out of their usual position. Displacement is involuntary removal from where one belongs.",
      "bengali": "স্থানচ্যুত করা"
    },
    "renounce": {
      "meaning": "To formally and publicly give up a claim, right, or belief. Renouncing is a deliberate, often dramatic act of abandonment.",
      "bengali": "পরিত্যাগ করা"
    },
    "disavow": {
      "meaning": "To formally deny responsibility for or connection to something. Disavowing is a public declaration that you have nothing to do with something.",
      "bengali": "অস্বীকার করা"
    },
    "relegated": {
      "meaning": "Assigned to a lower, less important position. Being relegated means being pushed down in status or significance.",
      "bengali": "নিম্ন পদে স্থানান্তরিত"
    }
  },
  "Agreement & Harmony (সম্মতি ও সামঞ্জস্য)": {
    "acquiesce": {
      "meaning": "To accept something reluctantly without protest. you don't agree, but you give in silently. Passive acceptance, not enthusiastic agreement",
      "bengali": "অনিচ্ছায় নীরবে মেনে নেওয়া"
    },
    "accord": {
      "meaning": "A formal agreement or harmony between parties. when both sides reach an accord, they've found common ground",
      "bengali": "আনুষ্ঠানিক সম্মতি বা সামঞ্জস্য"
    },
    "amenable": {
      "meaning": "Willing to listen, open to suggestions. an amenable person doesn't resist; they're happy to go with a good idea",
      "bengali": "পরামর্শ শুনতে ও মানতে রাজি"
    },
    "assent": {
      "meaning": "To formally express agreement or approval. nodding assent to a proposal. More official than just saying 'okay'",
      "bengali": "আনুষ্ঠানিকভাবে সম্মতি জানানো"
    },
    "compatible": {
      "meaning": "Able to exist or work together without conflict. compatible personalities get along, compatible software runs together smoothly",
      "bengali": "একসাথে সমস্যা ছাড়া চলতে পারে এমন"
    },
    "concede": {
      "meaning": "To admit something is true after resisting, or to give up something reluctantly. 'I concede that you were right' or conceding territory",
      "bengali": "প্রতিরোধের পর স্বীকার করা, বা অনিচ্ছায় ছেড়ে দেওয়া"
    },
    "concur": {
      "meaning": "To agree with someone's opinion or decision. when all experts concur, they've independently reached the same conclusion",
      "bengali": "একমত হওয়া (স্বাধীনভাবে একই সিদ্ধান্তে পৌঁছানো)"
    },
    "consensus": {
      "meaning": "A general agreement reached by a group as a whole. not just majority vote, but widespread agreement where almost everyone is on board",
      "bengali": "দলগত সাধারণ সম্মতি যেখানে প্রায় সবাই একমত"
    },
    "consonant": {
      "meaning": "In agreement or harmony with something. her actions were consonant with her values, meaning they matched perfectly",
      "bengali": "কোনো কিছুর সাথে সামঞ্জস্যপূর্ণ ও সঙ্গতিপূর্ণ"
    },
    "defer": {
      "meaning": "To yield respectfully to someone else's judgment or wishes. deferring to an expert means trusting their knowledge over your own",
      "bengali": "সম্মানের সাথে অন্যের মতামত/ইচ্ছার কাছে ছেড়ে দেওয়া"
    },
    "reconcile": {
      "meaning": "To restore a relationship or make conflicting ideas fit together. reconciling with a friend after a fight, or reconciling two different viewpoints",
      "bengali": "সম্পর্ক পুনঃস্থাপন করা বা বিরোধী ধারণা মেলানো"
    },
    "yielding": {
      "meaning": "Giving in easily to pressure or demands. can be positive (flexible, accommodating) or negative (weak, pushover)",
      "bengali": "চাপ বা দাবির কাছে সহজে নতি স্বীকার করা"
    },
    "agreeable": {
      "meaning": "Pleasant and willing to cooperate. An agreeable person goes along with others and creates a comfortable social atmosphere.",
      "bengali": "সম্মত ও মিশুক"
    },
    "congruent": {
      "meaning": "In agreement or matching. When things are congruent, they align perfectly with each other, showing consistency and harmony.",
      "bengali": "সামঞ্জস্যপূর্ণ"
    },
    "cooperative": {
      "meaning": "Willing to work together with others toward a shared goal. A cooperative attitude puts collaboration above individual interest.",
      "bengali": "সহযোগিতামূলক"
    },
    "harmonious": {
      "meaning": "Forming a pleasing, balanced whole without conflict. Harmonious relationships or elements work together smoothly and beautifully.",
      "bengali": "সুসংহত"
    },
    "unanimous": {
      "meaning": "Fully and completely in agreement, with every single person sharing the same opinion. There is no dissent whatsoever.",
      "bengali": "সর্বসম্মত"
    },
    "unified": {
      "meaning": "Joined together as one cohesive whole. A unified group has overcome divisions and acts with shared purpose.",
      "bengali": "ঐক্যবদ্ধ"
    },
    "consistent": {
      "meaning": "Staying the same over time, not changing or contradicting itself. Consistency signals reliability and dependability.",
      "bengali": "সামঞ্জস্যপূর্ণ"
    },
    "conciliatory": {
      "meaning": "Intended to calm conflict and restore peace. A conciliatory gesture shows willingness to compromise and move past disagreement.",
      "bengali": "মিলনকামী"
    },
    "compliance": {
      "meaning": "The act of following rules, orders, or standards. Compliance means obeying external requirements, sometimes willingly, sometimes reluctantly.",
      "bengali": "মান্যতা"
    },
    "accept": {
      "meaning": "To receive or agree to something offered. It signals willingness or passive agreement, sometimes without enthusiasm.",
      "bengali": "গ্রহণ করা"
    }
  },
  "Disagreement & Opposition (মতবিরোধ ও বিরোধিতা)": {
    "adversarial": {
      "meaning": "Involving two opposing sides in conflict. an adversarial legal system has prosecution vs. defense. It's built around opposition",
      "bengali": "দুই বিরোধী পক্ষের দ্বন্দ্বমূলক"
    },
    "antagonize": {
      "meaning": "To deliberately provoke hostility in someone. you antagonize someone by pushing their buttons on purpose",
      "bengali": "ইচ্ছাকৃতভাবে কাউকে ক্ষুব্ধ বা শত্রুভাবাপন্ন করা"
    },
    "antithetical": {
      "meaning": "Directly opposite to something. democracy is antithetical to dictatorship. They fundamentally cannot coexist",
      "bengali": "সরাসরি বিপরীত, মৌলিকভাবে সহাবস্থান অসম্ভব"
    },
    "contentious": {
      "meaning": "Causing or likely to cause disagreement and argument. a contentious topic like politics divides people into heated camps",
      "bengali": "যে বিষয় তীব্র মতবিরোধ ও তর্কের সৃষ্টি করে"
    },
    "contrarian": {
      "meaning": "Someone who deliberately opposes the popular view. not because they're right, but because they enjoy going against the crowd",
      "bengali": "যে ইচ্ছাকৃতভাবে জনপ্রিয় মতের বিরোধিতা করে"
    },
    "contravene": {
      "meaning": "To violate a rule or go against an established principle. contravening the law means breaking it, contravening norms means defying them",
      "bengali": "নিয়ম ভঙ্গ করা বা প্রতিষ্ঠিত নীতির বিরুদ্ধে যাওয়া"
    },
    "discord": {
      "meaning": "Lack of agreement or harmony between people or things. discord in a team means everyone is fighting and nothing works together",
      "bengali": "অসামঞ্জস্য, মতবিরোধ. সবাই ভিন্নমত, কিছুই মেলে না"
    },
    "dispute": {
      "meaning": "A disagreement or argument, especially a formal or public one. territorial disputes, labor disputes. More serious than a casual argument",
      "bengali": "বিশেষত আনুষ্ঠানিক বা গুরুতর মতবিরোধ ও তর্ক"
    },
    "dissent": {
      "meaning": "To publicly disagree with an official position or majority view. dissenting judges write opinions explaining why they disagree with the ruling",
      "bengali": "আনুষ্ঠানিক অবস্থান বা সংখ্যাগরিষ্ঠের সাথে প্রকাশ্যে দ্বিমত"
    },
    "factious": {
      "meaning": "Relating to internal divisions and conflict within a group. a factious political party has rival factions fighting each other from within",
      "bengali": "দলের মধ্যে অভ্যন্তরীণ বিভাজন ও দ্বন্দ্ব সৃষ্টিকারী"
    },
    "irreconcilable": {
      "meaning": "So different that they can never be brought into agreement. irreconcilable differences in a marriage means there's no possible compromise",
      "bengali": "এতটাই ভিন্ন যে কোনো আপস বা সমাধান সম্ভব নয়"
    },
    "litigious": {
      "meaning": "Too eager to take legal action. a litigious person sues over everything, even minor issues. Lawsuit-happy",
      "bengali": "অতিরিক্ত মামলাপ্রবণ, তুচ্ছ বিষয়েও মামলা করে"
    },
    "polemic": {
      "meaning": "A strong, aggressive verbal or written attack against someone's opinion. not a calm debate but a fierce, one-sided argument designed to destroy the other view",
      "bengali": "কারো মতামতের বিরুদ্ধে তীব্র ও আক্রমণাত্মক তর্ক/রচনা"
    },
    "recalcitrant": {
      "meaning": "Stubbornly refusing to obey rules or follow instructions. a recalcitrant child refuses to eat, clean, or listen no matter what you say",
      "bengali": "একগুঁয়েভাবে নিয়ম বা নির্দেশ মানতে অস্বীকার"
    },
    "refute": {
      "meaning": "To prove that a statement or theory is wrong using evidence and logic. not just disagreeing, but actually disproving with facts",
      "bengali": "প্রমাণ ও যুক্তি দিয়ে কোনো বক্তব্য ভুল প্রমাণ করা"
    },
    "repudiate": {
      "meaning": "To reject something strongly and publicly, refusing to accept it. repudiating a treaty means officially declaring you won't honor it",
      "bengali": "জোরালো ও প্রকাশ্যভাবে প্রত্যাখ্যান, মানতে অস্বীকার"
    },
    "refractory": {
      "meaning": "Stubbornly resistant to authority, control, or treatment. a refractory patient won't follow doctor's orders, refractory material resists heat",
      "bengali": "একগুঁয়েভাবে কর্তৃত্ব বা চিকিৎসা প্রতিরোধী"
    }
  },
  "Clarity & Understanding (স্পষ্টতা ও বোধগম্যতা)": {
    "accessible": {
      "meaning": "Easy for anyone to understand or approach. an accessible book explains complex ideas in simple language that non-experts can grasp",
      "bengali": "যে কারো পক্ষে বোঝা সহজ, জটিল ধারণা সরলভাবে ব্যাখ্যা"
    },
    "articulate": {
      "meaning": "Able to express ideas clearly and effectively in words. an articulate speaker makes complicated topics feel simple and understandable",
      "bengali": "ধারণা স্পষ্ট ও কার্যকরভাবে শব্দে প্রকাশ করতে সক্ষম"
    },
    "cogent": {
      "meaning": "An argument that is so clear, logical, and convincing that it's hard to disagree. a cogent case leaves no room for doubt",
      "bengali": "যুক্তি যা এতটাই স্পষ্ট ও বিশ্বাসযোগ্য যে দ্বিমত করা কঠিন"
    },
    "coherent": {
      "meaning": "Ideas that are logically connected and make sense together. a coherent essay flows from one point to the next without confusing jumps",
      "bengali": "ধারণাগুলো যৌক্তিকভাবে সংযুক্ত ও একসাথে অর্থবহ"
    },
    "elucidate": {
      "meaning": "To explain something in a way that makes it crystal clear. taking a confusing concept and breaking it down so everyone understands",
      "bengali": "জটিল বিষয় ভেঙে এতটা পরিষ্কার করা যে সবাই বুঝতে পারে"
    },
    "explicit": {
      "meaning": "Stated so clearly and in such detail that there's no room for confusion or misinterpretation. explicit instructions leave nothing to guess",
      "bengali": "এতটা স্পষ্টভাবে বলা যে ভুল বোঝার কোনো সুযোগ নেই"
    },
    "illuminate": {
      "meaning": "To shed light on a subject, making it easier to understand. a great teacher illuminates a topic by connecting it to real-life examples",
      "bengali": "কোনো বিষয়ে আলো ফেলা, বোঝা সহজ করা"
    },
    "lucid": {
      "meaning": "Expressed in a way that is easy to understand, clear like glass. lucid writing flows naturally and doesn't require re-reading",
      "bengali": "কাচের মতো স্বচ্ছ, পড়ে সহজেই বোঝা যায়"
    },
    "pellucid": {
      "meaning": "Absolutely clear in meaning or style. even stronger than lucid. Pellucid prose is so transparent that the meaning shines through effortlessly",
      "bengali": "অর্থ বা শৈলীতে সম্পূর্ণ স্বচ্ছ (lucid-এর চেয়েও স্পষ্ট)"
    },
    "perspicacious": {
      "meaning": "Having a sharp, penetrating understanding. a perspicacious observer notices things others miss, seeing through surface appearances to deeper truth",
      "bengali": "তীক্ষ্ণ ও ভেদনকারী বোধশক্তি, অন্যরা যা মিস করে তা ধরতে পারে"
    },
    "salient": {
      "meaning": "The most important or noticeable point. in an essay, the salient argument is the one that stands out and matters most",
      "bengali": "সবচেয়ে গুরুত্বপূর্ণ ও লক্ষণীয় বিষয়, যা সবার আগে চোখে পড়ে"
    },
    "trenchant": {
      "meaning": "Expressed in a sharp, effective, and decisive way. a trenchant critique cuts right to the heart of the problem without wasting words",
      "bengali": "তীক্ষ্ণ ও কার্যকরভাবে প্রকাশিত, সোজা মূল সমস্যায় যায়"
    },
    "clarify": {
      "meaning": "To make something clearer and easier to understand by removing confusion. Clarifying takes the murky and makes it transparent.",
      "bengali": "স্পষ্ট করা"
    },
    "intelligible": {
      "meaning": "Clear enough to be understood. When speech or writing is intelligible, it communicates its meaning effectively.",
      "bengali": "বোধগম্য"
    },
    "perspicuous": {
      "meaning": "Expressed with crystal-clear precision. Perspicuous writing leaves no room for misunderstanding because every idea is transparently stated.",
      "bengali": "সুস্পষ্ট"
    },
    "limpid": {
      "meaning": "Perfectly clear and transparent, like clean water. Limpid prose or limpid eyes have a beautiful, effortless clarity.",
      "bengali": "স্বচ্ছ"
    },
    "incisive": {
      "meaning": "Impressively sharp, direct, and perceptive. Incisive analysis cuts straight to the heart of an issue without wasting time.",
      "bengali": "তীক্ষ্ণ ও বিশ্লেষণাত্মক"
    },
    "perceptive": {
      "meaning": "Having the ability to notice and understand things that others miss. A perceptive person catches subtle details and underlying patterns.",
      "bengali": "অন্তর্দৃষ্টিসম্পন্ন"
    },
    "discernment": {
      "meaning": "The ability to judge well and distinguish what is true, valuable, or right. Discernment is refined judgment born of experience.",
      "bengali": "বিচক্ষণতা"
    },
    "nuance": {
      "meaning": "A subtle but important difference in meaning, expression, or detail. Nuanced thinking captures complexities that simple answers miss.",
      "bengali": "সূক্ষ্ম পার্থক্য"
    },
    "explicate": {
      "meaning": "To explain something in thorough, detailed analysis. Explicating unfolds a complex idea piece by piece until it is fully understood.",
      "bengali": "বিশদ ব্যাখ্যা করা"
    },
    "demonstrate": {
      "meaning": "To clearly show or prove something by presenting evidence or examples. Demonstrating makes invisible things visible.",
      "bengali": "প্রদর্শন করা"
    },
    "depict": {
      "meaning": "To portray or represent something in words, pictures, or other media. Depicting creates a picture of reality for the audience.",
      "bengali": "চিত্রিত করা"
    },
    "describe": {
      "meaning": "To give a detailed account of something in words. Describing paints a neutral, factual picture of its subject.",
      "bengali": "বর্ণনা করা"
    },
    "characterize": {
      "meaning": "To describe the essential, defining qualities of something. Characterizing identifies what makes something distinctively itself.",
      "bengali": "বৈশিষ্ট্যায়িত করা"
    },
    "exemplify": {
      "meaning": "To serve as a perfect example of something. When something exemplifies a quality, it represents that quality in its purest form.",
      "bengali": "উদাহরণ হওয়া"
    }
  },
  "Confusion & Complexity (বিভ্রান্তি ও জটিলতা)": {
    "abstract": {
      "meaning": "Dealing with ideas rather than real, physical things. abstract concepts like justice or freedom can't be touched or seen, only thought about",
      "bengali": "বাস্তব নয়, ধারণাগত. ন্যায়বিচারের মতো চিন্তায় থাকে, ছোঁয়া যায় না"
    },
    "abstruse": {
      "meaning": "So complex that only experts can understand it. an abstruse mathematical proof or philosophical argument that goes over most people's heads",
      "bengali": "এত জটিল যে শুধু বিশেষজ্ঞরাই বুঝতে পারে"
    },
    "ambiguous": {
      "meaning": "Having more than one possible meaning, making it unclear. 'I saw her duck' is ambiguous: did she own a duck or did she dodge?",
      "bengali": "একাধিক অর্থ হতে পারে এমন, তাই অস্পষ্ট"
    },
    "anomalous": {
      "meaning": "Something that doesn't fit the expected pattern. an anomalous result in an experiment is surprising because it's different from what you predicted",
      "bengali": "প্রত্যাশিত ধরন থেকে ভিন্ন, বেমানান ফলাফল"
    },
    "byzantine": {
      "meaning": "So complicated with so many rules and procedures that it's nearly impossible to navigate. byzantine bureaucracy with endless forms and approvals",
      "bengali": "এত নিয়ম ও প্রক্রিয়া যে প্রায় অসম্ভব. আমলাতান্ত্রিক জটিলতা"
    },
    "convoluted": {
      "meaning": "Extremely complicated with many twists and turns. a convoluted plot has so many twists you lose track, a convoluted argument is hard to follow",
      "bengali": "অনেক মোড় ও পেঁচ সহ অত্যন্ত জটিল, অনুসরণ করা কঠিন"
    },
    "cryptic": {
      "meaning": "Having a hidden meaning that's deliberately hard to figure out. a cryptic message or clue that requires you to decode or think hard to understand",
      "bengali": "ইচ্ছাকৃতভাবে লুকানো অর্থ যা বুঝতে চিন্তা করতে হয়"
    },
    "enigmatic": {
      "meaning": "Mysterious and impossible to fully understand. an enigmatic smile (like Mona Lisa) or an enigmatic person who nobody can figure out",
      "bengali": "রহস্যময় ও সম্পূর্ণ বোঝা অসম্ভব (মোনালিসার হাসির মতো)"
    },
    "esoteric": {
      "meaning": "Understood by only a small group of people with specialized knowledge. quantum physics is esoteric to most people but clear to physicists",
      "bengali": "বিশেষ জ্ঞানসম্পন্ন অল্প কিছু লোকই বোঝে"
    },
    "inscrutable": {
      "meaning": "Impossible to read or understand, especially someone's expression or motives. an inscrutable face reveals nothing about what the person is thinking",
      "bengali": "পড়া বা বোঝা অসম্ভব, মুখ দেখে কিছুই বোঝা যায় না"
    },
    "labyrinthine": {
      "meaning": "Like a maze. extremely complex and confusing with many interconnected parts. Labyrinthine regulations that no one can navigate without a lawyer",
      "bengali": "গোলকধাঁধার মতো জটিল, আইনজীবী ছাড়া বোঝা কঠিন"
    },
    "nebulous": {
      "meaning": "Vague, cloudy, and lacking clear form. a nebulous plan has no concrete details, like trying to grab fog with your hands",
      "bengali": "অস্পষ্ট ও ঝাপসা, কোনো স্পষ্ট রূপ নেই. কুয়াশা ধরার মতো"
    },
    "obfuscate": {
      "meaning": "To deliberately make something confusing or unclear. politicians obfuscate when they use complicated language to hide simple (bad) truths",
      "bengali": "ইচ্ছাকৃতভাবে বিভ্রান্তিকর করা, সত্য লুকাতে জটিল ভাষা ব্যবহার"
    },
    "opaque": {
      "meaning": "Impossible to see through or understand. opaque glass blocks light, opaque writing blocks understanding. The opposite of transparent",
      "bengali": "যার ভেতর দিয়ে দেখা বা বোঝা যায় না. transparent-এর বিপরীত"
    },
    "paradox": {
      "meaning": "A statement that seems to contradict itself but reveals a deeper truth. 'less is more' is a paradox: it sounds wrong but makes sense",
      "bengali": "আপাত-বিরোধী বক্তব্য যা গভীর সত্য প্রকাশ করে"
    },
    "recondite": {
      "meaning": "Dealing with a subject that very few people know about. even more obscure than esoteric, almost forgotten knowledge from ancient texts",
      "bengali": "এত দুর্লভ বিষয় যে অতি অল্প মানুষই জানে"
    },
    "bemused": {
      "meaning": "Confused and puzzled, NOT amused. This is a common GRE trap. A bemused person is bewildered and cannot quite make sense of what is happening.",
      "bengali": "বিভ্রান্ত"
    },
    "chaotic": {
      "meaning": "Completely disorderly and lacking any structure or organization. A chaotic situation has no control, no plan, and no predictability.",
      "bengali": "বিশৃঙ্খল"
    },
    "complicate": {
      "meaning": "To make something more difficult or confusing than it was. Complicating adds layers of difficulty to an already challenging situation.",
      "bengali": "জটিল করা"
    },
    "incoherent": {
      "meaning": "Lacking logical connection, impossible to follow. Incoherent speech or writing jumps around without making sense.",
      "bengali": "অসংলগ্ন"
    },
    "muddle": {
      "meaning": "To create confusion by mixing things up or thinking unclearly. A muddled explanation leaves the listener more confused than before.",
      "bengali": "গোলমাল করা"
    },
    "murky": {
      "meaning": "Dark, unclear, and suspiciously hard to understand. Murky waters hide what is underneath. Murky motives raise doubts about true intentions.",
      "bengali": "অস্পষ্ট"
    },
    "enigma": {
      "meaning": "Something or someone that is mysterious and impossible to fully understand. An enigma puzzles everyone who encounters it.",
      "bengali": "রহস্য"
    },
    "equivocal": {
      "meaning": "Deliberately unclear or ambiguous, open to more than one interpretation. Equivocal language avoids committing to a definite meaning.",
      "bengali": "দ্ব্যর্থক"
    },
    "illusory": {
      "meaning": "Based on illusion, not real. Something illusory seems real but is actually false. The progress was illusory. nothing had truly changed.",
      "bengali": "মায়াময়"
    },
    "haphazard": {
      "meaning": "Lacking any planning or order, happening completely by chance. A haphazard approach produces unpredictable, usually poor results.",
      "bengali": "এলোমেলো"
    },
    "non sequitur": {
      "meaning": "A conclusion or statement that does not logically follow from what came before. It signals a disconnect in reasoning.",
      "bengali": "অযৌক্তিক উপসংহার"
    },
    "dither": {
      "meaning": "To hesitate and waste time going back and forth without making a decision. Dithering is unproductive, anxious indecision.",
      "bengali": "দ্বিধায় থাকা"
    },
    "obscure": {
      "meaning": "Not clearly understood, little known, or hard to find. Something obscure requires special effort to discover or comprehend.",
      "bengali": "অস্পষ্ট ও দুর্বোধ্য"
    }
  },
  "Moderation & Restraint (সংযম ও আত্মনিয়ন্ত্রণ)": {
    "abstemious": {
      "meaning": "Deliberately choosing to eat, drink, and consume very little. not because you're poor, but because you practice self-control as a lifestyle choice",
      "bengali": "ইচ্ছাকৃতভাবে কম খাওয়া-দাওয়া. দারিদ্র্য নয়, আত্মসংযম"
    },
    "ascetic": {
      "meaning": "Living with extreme self-discipline, giving up all comforts and pleasures. like a monk who owns nothing and meditates all day",
      "bengali": "সমস্ত আরাম-আয়েশ ত্যাগ করে কঠোর সংযমে জীবনযাপন"
    },
    "austere": {
      "meaning": "Severe, strict, and without any luxury or decoration. an austere room has bare walls and no comforts, an austere person shows no warmth",
      "bengali": "কঠোর, সরল, কোনো বিলাসিতা বা সাজসজ্জা নেই"
    },
    "circumspect": {
      "meaning": "Extremely careful to consider all possible consequences before acting. a circumspect decision-maker thinks through every angle before committing",
      "bengali": "কাজ করার আগে সব সম্ভাব্য ফলাফল বিবেচনা করে সতর্কতার সাথে চলা"
    },
    "discreet": {
      "meaning": "Careful about what you say and do to avoid causing offense or attracting attention. a discreet friend keeps your secrets and handles sensitive matters quietly",
      "bengali": "গোপনীয়তা রক্ষা করে সতর্কভাবে চলা, মনোযোগ আকর্ষণ এড়ানো"
    },
    "frugal": {
      "meaning": "Spending money very carefully and only on necessities. a frugal person isn't cheap but values getting maximum benefit from minimum spending",
      "bengali": "অত্যন্ত সতর্কভাবে অর্থ ব্যয়, শুধু প্রয়োজনীয় জিনিসে খরচ"
    },
    "judicious": {
      "meaning": "Showing good sense and wisdom in making decisions. a judicious use of resources means smart, well-thought-out allocation",
      "bengali": "সিদ্ধান্ত নেওয়ায় সুবিবেচনা ও প্রজ্ঞা দেখানো"
    },
    "measured": {
      "meaning": "Carefully thought out and controlled, not impulsive. a measured response is calm and deliberate, not a knee-jerk reaction",
      "bengali": "সুচিন্তিত ও নিয়ন্ত্রিত, তাড়াহুড়োর প্রতিক্রিয়া নয়"
    },
    "parsimonious": {
      "meaning": "So extremely unwilling to spend money that it becomes a negative trait. goes beyond frugal into stingy territory. Too tight with money",
      "bengali": "এত বেশি মিতব্যয়ী যে তা নেতিবাচক হয়ে যায়. কৃপণ"
    },
    "prudent": {
      "meaning": "Acting with careful thought for the future, avoiding unnecessary risks. a prudent investor diversifies instead of betting everything on one stock",
      "bengali": "ভবিষ্যতের কথা ভেবে সতর্কভাবে কাজ করা, অপ্রয়োজনীয় ঝুঁকি এড়ানো"
    },
    "spartan": {
      "meaning": "Showing strict self-discipline and avoiding luxury, like the ancient Spartans. a spartan lifestyle means bare minimum, no frills, no complaints",
      "bengali": "প্রাচীন স্পার্টানদের মতো কঠোর শৃঙ্খলা, ন্যূনতম সুযোগ-সুবিধায় জীবন"
    },
    "stoic": {
      "meaning": "Enduring pain and hardship without showing emotion or complaining. a stoic person faces tragedy calmly, not because they don't feel, but they don't show it",
      "bengali": "কষ্ট সহ্য করে আবেগ প্রকাশ না করা. অনুভূতিহীন নয়, প্রকাশহীন"
    },
    "temperate": {
      "meaning": "Showing moderation and self-restraint in behavior. a temperate person avoids extremes in everything: eating, drinking, opinions",
      "bengali": "সবকিছুতে চরম এড়িয়ে সংযত আচরণ"
    }
  },
  "Excess & Extravagance (অতিরিক্ত ও অপচয়)": {
    "ebullient": {
      "meaning": "Overflowing with enthusiastic excitement and energy. an ebullient person walks into a room and their joy is contagious, almost too much",
      "bengali": "উৎসাহ ও শক্তিতে উথলে পড়া, সংক্রামক আনন্দ"
    },
    "effusive": {
      "meaning": "Expressing feelings in an unrestrained, over-the-top way. effusive praise feels like too much, like someone gushing endlessly about how great you are",
      "bengali": "আবেগ প্রকাশে সীমাহীন, অতিরিক্ত গুণগান যা বেশি মনে হয়"
    },
    "exorbitant": {
      "meaning": "A price or amount that is unreasonably and outrageously high. exorbitant rent means it's so expensive it feels like robbery",
      "bengali": "অযৌক্তিকভাবে বেশি দাম যা ডাকাতির মতো মনে হয়"
    },
    "extravagant": {
      "meaning": "Spending much more than necessary or reasonable. an extravagant wedding with ice sculptures and imported flowers when a simple one would do",
      "bengali": "প্রয়োজনের চেয়ে অনেক বেশি খরচ করা"
    },
    "flagrant": {
      "meaning": "So obviously bad that it's impossible to ignore. a flagrant violation of rules is done openly and shamelessly, not even trying to hide it",
      "bengali": "এতটাই প্রকাশ্যে খারাপ যে উপেক্ষা করা অসম্ভব, লজ্জাহীন লঙ্ঘন"
    },
    "glut": {
      "meaning": "An excessive supply that exceeds demand. a glut of oil means there's so much that prices drop because no one needs more",
      "bengali": "চাহিদার চেয়ে অতিরিক্ত সরবরাহ যা দাম কমিয়ে দেয়"
    },
    "gratuitous": {
      "meaning": "Done without good reason or justification. gratuitous violence in a movie means it's there for shock value, not because the story needs it",
      "bengali": "কোনো যুক্তি বা প্রয়োজন ছাড়াই করা (যেমন গল্পে অপ্রয়োজনীয় সহিংসতা)"
    },
    "inordinate": {
      "meaning": "Unreasonably excessive, far beyond normal limits. spending an inordinate amount of time means way more time than the task deserves",
      "bengali": "স্বাভাবিক সীমার অনেক বাইরে, অযৌক্তিকভাবে বেশি"
    },
    "lavish": {
      "meaning": "Given or produced in generous, luxurious abundance. a lavish banquet with endless food, or lavishing attention on someone",
      "bengali": "উদারহস্তে বিলাসবহুল প্রাচুর্যে দেওয়া"
    },
    "opulent": {
      "meaning": "Displaying great wealth in a showy, luxurious way. an opulent mansion with gold fixtures, marble floors, and crystal chandeliers",
      "bengali": "জাঁকজমকপূর্ণভাবে প্রচুর সম্পদ প্রদর্শন"
    },
    "ostentatious": {
      "meaning": "Deliberately showing off wealth or knowledge to impress others. wearing a massive diamond ring to a casual dinner just to be noticed",
      "bengali": "ইচ্ছাকৃতভাবে সম্পদ দেখিয়ে অন্যদের প্রভাবিত করার চেষ্টা"
    },
    "profligate": {
      "meaning": "Recklessly wasteful with money, spending without any care for the future. a profligate heir who blows through the family fortune in a year",
      "bengali": "বেপরোয়াভাবে অপচয়ী, ভবিষ্যতের কথা না ভেবে খরচ"
    },
    "prodigal": {
      "meaning": "Spending money or resources freely and recklessly. like the Prodigal Son story, someone who wastes everything and then has nothing left",
      "bengali": "মুক্তহস্তে ও বেপরোয়াভাবে খরচ করে সব শেষ করা"
    },
    "superfluous": {
      "meaning": "More than what is needed or useful. superfluous details in an essay are extras that don't add value and should be cut",
      "bengali": "প্রয়োজনের চেয়ে বেশি, অতিরিক্ত যা মূল্য যোগ করে না"
    },
    "surfeit": {
      "meaning": "An excessive amount that leads to disgust or sickness. a surfeit of chocolate means you ate so much that now even looking at it makes you sick",
      "bengali": "এত অতিরিক্ত যে বিরক্তি বা অসুস্থতা আসে"
    }
  },
  "Change & Transformation (পরিবর্তন ও রূপান্তর)": {
    "adapt": {
      "meaning": "To adjust yourself to fit new conditions. like how animals adapt to survive in new environments, or how you adapt to a new job",
      "bengali": "নতুন পরিস্থিতিতে নিজেকে মানিয়ে নেওয়া"
    },
    "catalyze": {
      "meaning": "To trigger or speed up a process of change. one event can catalyze a revolution, like how a spark catalyzes a fire",
      "bengali": "পরিবর্তন শুরু বা ত্বরান্বিত করা (স্ফুলিঙ্গের মতো)"
    },
    "deviate": {
      "meaning": "To move away from what's normal or expected. deviating from a plan means going off-script, taking a different path than planned",
      "bengali": "স্বাভাবিক বা প্রত্যাশিত পথ থেকে সরে যাওয়া"
    },
    "diverge": {
      "meaning": "To move apart in different directions. two roads diverge, or two opinions diverge when they start the same but end up far apart",
      "bengali": "ভিন্ন দিকে আলাদা হয়ে যাওয়া"
    },
    "evolve": {
      "meaning": "To develop slowly and naturally over time. ideas evolve, technology evolves. It's gradual, organic change, not sudden",
      "bengali": "সময়ের সাথে ধীরে ও স্বাভাবিকভাবে বিকশিত হওয়া"
    },
    "fluctuate": {
      "meaning": "To rise and fall irregularly. stock prices fluctuate daily, temperatures fluctuate. The key is the up-and-down, unpredictable pattern",
      "bengali": "অনিয়মিতভাবে ওঠানামা করা (দাম, তাপমাত্রা ইত্যাদি)"
    },
    "vacillate": {
      "meaning": "To keep going back and forth between two choices, unable to decide. vacillating between two jobs for weeks without committing to either",
      "bengali": "দুটি বিকল্পের মধ্যে দোদুল্যমান, সিদ্ধান্ত নিতে না পারা"
    },
    "volatile": {
      "meaning": "Likely to change suddenly and unpredictably, often dangerously. a volatile situation could explode at any moment, volatile markets crash without warning",
      "bengali": "হঠাৎ ও অপ্রত্যাশিতভাবে পরিবর্তনশীল, প্রায়ই বিপজ্জনক"
    },
    "capricious": {
      "meaning": "Changing mood or behavior suddenly for no apparent reason. a capricious boss loves your work Monday but hates it Tuesday for no reason",
      "bengali": "কোনো কারণ ছাড়াই হঠাৎ মেজাজ বা আচরণ বদলায়"
    },
    "erratic": {
      "meaning": "Unpredictable and inconsistent in pattern. erratic behavior makes people nervous because you never know what to expect next",
      "bengali": "অনিয়মিত ও অসামঞ্জস্যপূর্ণ, কী হবে বলা যায় না"
    },
    "fickle": {
      "meaning": "Changing loyalty or affection frequently and easily. a fickle friend supports you today but abandons you tomorrow for someone cooler",
      "bengali": "ঘনঘন ও সহজে আনুগত্য বা স্নেহ বদলায়"
    },
    "mercurial": {
      "meaning": "Having rapid, unpredictable mood changes. named after Mercury, the fast-moving planet. A mercurial artist can be joyful one minute and furious the next",
      "bengali": "দ্রুত ও অপ্রত্যাশিতভাবে মেজাজ বদলায় (বুধ গ্রহের মতো দ্রুত)"
    },
    "mutable": {
      "meaning": "Subject to change, able to be altered. human opinions are mutable, but laws of physics are not. Simply: it CAN change",
      "bengali": "পরিবর্তনযোগ্য, বদলাতে পারে"
    },
    "protean": {
      "meaning": "Able to change form or character frequently and easily. named after the Greek god Proteus who could shape-shift. An actor with protean range",
      "bengali": "সহজেই বিভিন্ন রূপ ধারণ করতে পারে (গ্রিক দেবতা প্রোটিয়াসের মতো)"
    },
    "whimsical": {
      "meaning": "Playfully unusual, guided by imagination rather than reason. a whimsical garden with upside-down flowerpots, or a whimsical decision made for fun",
      "bengali": "কৌতুকপূর্ণ ও অস্বাভাবিক, যুক্তি নয় কল্পনা দ্বারা পরিচালিত"
    },
    "metamorphose": {
      "meaning": "To completely transform into something entirely different. a caterpillar metamorphoses into a butterfly. Total, dramatic change",
      "bengali": "সম্পূর্ণ ভিন্ন কিছুতে রূপান্তর (শুঁয়োপোকা থেকে প্রজাপতির মতো)"
    },
    "transmute": {
      "meaning": "To change the nature or substance of something into something different. alchemists tried to transmute lead into gold",
      "bengali": "কোনো কিছুর প্রকৃতি বা উপাদান সম্পূর্ণ পরিবর্তন করা"
    },
    "pivot": {
      "meaning": "To change direction or strategy. a company pivots when it realizes its original plan isn't working and tries a completely new approach",
      "bengali": "দিক বা কৌশল পরিবর্তন করা (মূল পরিকল্পনা কাজ না করলে)"
    },
    "flux": {
      "meaning": "A state of constant, ongoing change where nothing is settled. When something is in flux, it has not yet reached its final form.",
      "bengali": "ক্রমাগত পরিবর্তন"
    },
    "vicissitude": {
      "meaning": "Unexpected changes in circumstances or fortune, the ups and downs of life. Vicissitudes are the unpredictable twists that shape our journey.",
      "bengali": "ভাগ্যের উত্থান-পতন"
    },
    "changeable": {
      "meaning": "Likely to change frequently and unpredictably. Something changeable lacks stability and consistency.",
      "bengali": "পরিবর্তনশীল"
    },
    "precipitate": {
      "meaning": "To cause something to happen suddenly and often prematurely. Also means acting too hastily without thinking through consequences.",
      "bengali": "হঠাৎ ঘটানো"
    },
    "adopt": {
      "meaning": "To choose to take up, accept, or start using something new. Adopting a policy means actively choosing to embrace it.",
      "bengali": "গ্রহণ করা"
    },
    "embrace": {
      "meaning": "To accept something willingly and enthusiastically. Embracing change means welcoming it rather than resisting it.",
      "bengali": "আলিঙ্গন করা / গ্রহণ করা"
    },
    "progressive": {
      "meaning": "Favoring reform, innovation, and forward-looking change. Progressive thinking pushes for improvement and new approaches.",
      "bengali": "প্রগতিশীল"
    },
    "reactionary": {
      "meaning": "Strongly opposed to political or social change, wanting to return to how things were before. Reactionary thinking resists all progress.",
      "bengali": "প্রতিক্রিয়াশীল"
    },
    "regressive": {
      "meaning": "Moving backward, reversing progress. Regressive policies undo advances and return to less developed conditions.",
      "bengali": "পশ্চাদমুখী"
    },
    "revisionist": {
      "meaning": "Reinterpreting established, accepted views or history. Revisionist scholars challenge what was previously taken as settled truth.",
      "bengali": "সংশোধনবাদী"
    },
    "devolution": {
      "meaning": "The transfer of power from a central authority to local or regional bodies. Devolution decentralizes control.",
      "bengali": "ক্ষমতা হস্তান্তর"
    }
  },
  "Stability & Permanence (স্থিতিশীলতা ও স্থায়িত্ব)": {
    "enduring": {
      "meaning": "Lasting over a long period of time without weakening. an enduring friendship survives decades, distance, and hardships",
      "bengali": "দীর্ঘ সময় ধরে দুর্বল না হয়ে টিকে থাকা"
    },
    "entrenched": {
      "meaning": "So firmly established that it's extremely difficult to change. entrenched beliefs, entrenched corruption. Like roots dug deep into the ground",
      "bengali": "এত গভীরভাবে প্রতিষ্ঠিত যে পরিবর্তন অত্যন্ত কঠিন"
    },
    "immutable": {
      "meaning": "Absolutely cannot be changed. the laws of physics are immutable, unlike human laws which can be amended",
      "bengali": "একেবারেই পরিবর্তন করা সম্ভব নয়"
    },
    "indelible": {
      "meaning": "Making a mark that cannot be erased or removed. an indelible impression means you'll never forget it, like permanent ink",
      "bengali": "যে চিহ্ন মুছে ফেলা যায় না. স্থায়ী কালির মতো"
    },
    "inert": {
      "meaning": "Lacking the ability or tendency to move or act. an inert gas doesn't react with anything, an inert person just sits there doing nothing",
      "bengali": "নড়াচড়া বা কাজ করার ক্ষমতা বা প্রবণতা নেই"
    },
    "ingrained": {
      "meaning": "A habit or belief so deeply embedded that it's part of who you are. ingrained prejudices are almost impossible to unlearn",
      "bengali": "এত গভীরভাবে প্রোথিত অভ্যাস/বিশ্বাস যে তা ব্যক্তিত্বের অংশ"
    },
    "intransigent": {
      "meaning": "Absolutely refusing to change your position or compromise. an intransigent negotiator won't budge even an inch from their demands",
      "bengali": "আপস বা অবস্থান পরিবর্তনে সম্পূর্ণ অস্বীকৃতি"
    },
    "obdurate": {
      "meaning": "Stubbornly refusing to change opinion or behavior despite pressure. an obdurate refusal means nothing will make them give in, almost pig-headed",
      "bengali": "চাপ সত্ত্বেও মত বা আচরণ বদলাতে একগুঁয়ে অস্বীকার"
    },
    "ossify": {
      "meaning": "To become rigid and resistant to change. like soft cartilage turning to hard bone. An organization that ossifies becomes stuck in old ways",
      "bengali": "নমনীয় থেকে কঠিন হয়ে যাওয়া, পুরনো পদ্ধতিতে আটকে যাওয়া"
    },
    "perennial": {
      "meaning": "Lasting forever or recurring year after year. a perennial problem keeps coming back like weeds, a perennial favorite never goes out of style",
      "bengali": "চিরস্থায়ী, বা বছরের পর বছর ফিরে আসে"
    },
    "resolute": {
      "meaning": "Admirably determined and unwavering in purpose. a resolute leader doesn't waver when things get tough, they stay focused on the goal",
      "bengali": "প্রশংসনীয়ভাবে দৃঢ়সংকল্প, কঠিন সময়েও লক্ষ্যে অটল"
    },
    "steadfast": {
      "meaning": "Firmly loyal and unwavering in support. a steadfast ally stands by you no matter what, through good times and bad",
      "bengali": "দৃঢ়ভাবে অনুগত ও অটল সমর্থন, সুসময়ে-দুঃসময়ে পাশে থাকে"
    },
    "tenacious": {
      "meaning": "Holding onto something very firmly, refusing to let go. a tenacious person keeps trying even after 99 failures. They simply won't quit",
      "bengali": "অত্যন্ত দৃঢ়ভাবে ধরে রাখা, ৯৯ বার ব্যর্থ হলেও ছাড়ে না"
    },
    "adamant": {
      "meaning": "Refusing to be persuaded or to change your mind. 'I'm adamant about this' means nothing you say will change my position",
      "bengali": "কোনোভাবেই মত পরিবর্তনে রাজি নয়, পাথরের মতো অটল"
    },
    "dogged": {
      "meaning": "Showing persistent, determined effort despite difficulty. dogged pursuit means chasing something relentlessly, never giving up the chase",
      "bengali": "বাধা সত্ত্বেও নাছোড়বান্দার মতো লেগে থাকা"
    },
    "stalwart": {
      "meaning": "A loyal, reliable, and strong supporter. a stalwart member of a team is someone who's always there, always dependable, never wavers",
      "bengali": "অনুগত, নির্ভরযোগ্য ও শক্তিশালী সমর্থক, সবসময় পাশে থাকে"
    },
    "durable": {
      "meaning": "Strong enough to last a long time without breaking down. Something durable withstands wear, pressure, and the passage of time.",
      "bengali": "টেকসই"
    },
    "perpetual": {
      "meaning": "Continuing forever without stopping. Something perpetual has no end in sight and keeps going indefinitely.",
      "bengali": "চিরস্থায়ী"
    },
    "resilient": {
      "meaning": "Able to recover quickly from difficulties or setbacks. A resilient person bounces back from adversity stronger than before.",
      "bengali": "স্থিতিস্থাপক"
    },
    "robust": {
      "meaning": "Strong, healthy, and able to withstand challenges. A robust system works well even under difficult conditions.",
      "bengali": "মজবুত ও শক্তিশালী"
    },
    "ossified": {
      "meaning": "Become rigid and unable to change, like bone that has hardened. An ossified institution has lost all flexibility and refuses to adapt.",
      "bengali": "কঠিন ও অপরিবর্তনীয়"
    },
    "preserve": {
      "meaning": "To keep something safe from harm, change, or destruction. Preserving maintains things in their current, valued state.",
      "bengali": "সংরক্ষণ করা"
    },
    "uphold": {
      "meaning": "To support, maintain, or defend a principle, law, or decision. Upholding means standing firm behind something you believe in.",
      "bengali": "বজায় রাখা"
    },
    "maintain": {
      "meaning": "To keep something in its existing state or continue asserting something. Maintaining requires ongoing effort to prevent decline.",
      "bengali": "বজায় রাখা"
    }
  },
  "Knowledge & Learning (জ্ঞান ও শিক্ষা)": {
    "astute": {
      "meaning": "Having the ability to quickly and accurately understand a situation. an astute businessperson spots opportunities that others completely miss",
      "bengali": "দ্রুত ও নির্ভুলভাবে পরিস্থিতি বুঝতে পারে, সুযোগ ধরতে পারে"
    },
    "acumen": {
      "meaning": "The ability to make good judgments and quick decisions. business acumen means you instinctively know which deals will succeed",
      "bengali": "ভালো সিদ্ধান্ত নেওয়ার সহজাত ক্ষমতা, ব্যবসায়িক বুদ্ধি"
    },
    "cognizant": {
      "meaning": "Being fully aware and informed about something. 'I'm cognizant of the risks' means I know exactly what dangers exist",
      "bengali": "কোনো বিষয়ে সম্পূর্ণ সচেতন ও অবগত"
    },
    "discerning": {
      "meaning": "Having excellent taste and judgment, able to distinguish quality. a discerning critic can tell good wine from great wine, good writing from brilliant",
      "bengali": "গুণমান পার্থক্য করার চমৎকার রুচি ও বিচারক্ষমতা"
    },
    "didactic": {
      "meaning": "Intended to teach or instruct, sometimes in a way that feels preachy. a didactic novel has a clear moral lesson it wants you to learn",
      "bengali": "শিক্ষামূলক, কখনো অতিরিক্ত উপদেশমূলক. স্পষ্ট নৈতিক শিক্ষা দিতে চায়"
    },
    "erudite": {
      "meaning": "Having extremely deep, wide-ranging knowledge gained through extensive reading and study. an erudite professor who can discuss any topic in depth",
      "bengali": "বিস্তৃত পড়াশোনা থেকে অর্জিত গভীর ও ব্যাপক জ্ঞান"
    },
    "empirical": {
      "meaning": "Based on real-world observation and experiment rather than just theory. empirical evidence comes from testing, not guessing",
      "bengali": "শুধু তত্ত্ব নয়, বাস্তব পর্যবেক্ষণ ও পরীক্ষার উপর ভিত্তি করে"
    },
    "pedantic": {
      "meaning": "Excessively concerned with minor details and rules, especially in academic matters. a pedantic teacher marks you wrong for a tiny formatting error",
      "bengali": "তুচ্ছ বিষয়ে অতিরিক্ত খুঁতখুঁতে, সামান্য ভুলেও নম্বর কাটে"
    },
    "polymath": {
      "meaning": "A person who has deep knowledge in many different subjects. Leonardo da Vinci was a polymath: painter, scientist, inventor, musician",
      "bengali": "বহু বিষয়ে গভীর জ্ঞান রাখে এমন ব্যক্তি (যেমন দা ভিঞ্চি)"
    },
    "prescient": {
      "meaning": "Having the ability to foresee what will happen in the future. a prescient prediction that turns out exactly right years later",
      "bengali": "ভবিষ্যতে কী হবে তা আগে থেকে বুঝতে পারা, দূরদর্শী"
    },
    "sagacious": {
      "meaning": "Having or showing sharp, practical wisdom. a sagacious elder gives advice that seems simple but proves profoundly right",
      "bengali": "তীক্ষ্ণ ও ব্যবহারিক প্রজ্ঞা, সরল কিন্তু গভীর সঠিক পরামর্শ দেয়"
    },
    "savvy": {
      "meaning": "Having practical knowledge and shrewd awareness of how things really work. street-smart, not just book-smart. A tech-savvy person",
      "bengali": "বাস্তব জ্ঞান ও চতুর সচেতনতা. বই-পড়া নয়, জীবনের অভিজ্ঞতা"
    },
    "erudition": {
      "meaning": "Impressive, deep knowledge gained through extensive study and reading. Erudition signals a person of great scholarly depth and breadth.",
      "bengali": "পাণ্ডিত্য"
    },
    "arcane": {
      "meaning": "Known or understood by only a few people. Arcane knowledge is specialized, mysterious, or hidden from the general public.",
      "bengali": "গূঢ়"
    },
    "canonical": {
      "meaning": "Officially accepted as standard or authoritative within a field. The canonical works of literature are the ones everyone in the field must know.",
      "bengali": "প্রামাণিক"
    },
    "paradigm": {
      "meaning": "A standard model or typical example that defines how something should be understood. A paradigm shift changes the fundamental framework of thinking.",
      "bengali": "আদর্শ মডেল"
    },
    "paradigmatic": {
      "meaning": "Serving as a model or ideal example. Something paradigmatic represents the perfect instance of a concept.",
      "bengali": "আদর্শস্থানীয়"
    },
    "shrewd": {
      "meaning": "Having sharp, practical intelligence and good judgment, especially in real-world situations. A shrewd person sees through deception quickly.",
      "bengali": "চতুর"
    },
    "ingenuity": {
      "meaning": "Clever, creative ability to solve problems in original ways. Ingenuity is the spark of inventive thinking that finds solutions others miss.",
      "bengali": "সৃজনশীলতা"
    },
    "prescience": {
      "meaning": "The extraordinary ability to know or predict what will happen before it occurs. Prescience implies almost supernatural foresight.",
      "bengali": "পূর্বজ্ঞান"
    },
    "hindsight": {
      "meaning": "Understanding of a situation only after it has happened. Hindsight is retrospective clarity. you see what you should have done after it is too late.",
      "bengali": "পশ্চাৎদৃষ্টি"
    },
    "heuristic": {
      "meaning": "A practical rule-of-thumb method for learning or solving problems. Heuristic approaches sacrifice perfect accuracy for practical, workable solutions.",
      "bengali": "আবিষ্কারমূলক পদ্ধতি"
    }
  },
  "Ignorance & Naivety (অজ্ঞতা ও সারল্য)": {
    "credulous": {
      "meaning": "Too ready to believe things without evidence. a credulous person falls for every scam email because they trust everything at face value",
      "bengali": "প্রমাণ ছাড়াই সবকিছু বিশ্বাস করতে প্রস্তুত"
    },
    "gullible": {
      "meaning": "Easily tricked or deceived because of excessive trust. similar to credulous but more about being fooled by specific people's lies",
      "bengali": "অতিরিক্ত বিশ্বাসের কারণে সহজে ঠকে যায়"
    },
    "naive": {
      "meaning": "Lacking experience and worldly wisdom, seeing things too simply. a naive person doesn't understand that people can have hidden motives",
      "bengali": "অনভিজ্ঞ, মানুষের লুকানো উদ্দেশ্য বুঝতে পারে না"
    },
    "obtuse": {
      "meaning": "Slow to understand obvious things. not incapable, just annoyingly unable to pick up on what everyone else clearly sees",
      "bengali": "সবাই যা স্পষ্ট দেখতে পায় তা বুঝতে বিরক্তিকরভাবে ধীর"
    },
    "oblivious": {
      "meaning": "Completely unaware of what's happening around you. walking into a room full of angry people and being oblivious to the tension",
      "bengali": "চারপাশে কী হচ্ছে সে সম্পর্কে সম্পূর্ণ অসচেতন"
    },
    "provincial": {
      "meaning": "Having a narrow, limited worldview shaped by small-town experience. a provincial attitude rejects anything unfamiliar or foreign",
      "bengali": "ছোট জায়গার অভিজ্ঞতায় সীমিত সংকীর্ণ দৃষ্টিভঙ্গি"
    },
    "parochial": {
      "meaning": "Concerned only with local or narrow matters, unable to see the bigger picture. parochial thinking ignores global issues to focus on small, local concerns",
      "bengali": "শুধু স্থানীয় বা ক্ষুদ্র বিষয়ে আগ্রহী, বৃহত্তর চিত্র দেখতে অক্ষম"
    },
    "myopic": {
      "meaning": "Lacking long-term vision, only seeing what's right in front of you. a myopic policy solves today's problem but creates bigger ones tomorrow",
      "bengali": "দূরদৃষ্টিহীন, আজকের সমস্যা সমাধান করে আগামীকালের বড় সমস্যা তৈরি করে"
    },
    "insular": {
      "meaning": "Isolated from other cultures and ideas, unwilling to engage with the outside world. insular communities resist new ideas and outsiders",
      "bengali": "অন্য সংস্কৃতি ও ধারণা থেকে বিচ্ছিন্ন, বাইরের জগতে আগ্রহী নয়"
    },
    "superficial": {
      "meaning": "Only dealing with the surface, not going deeper. a superficial analysis misses the real causes because it only looks at obvious symptoms",
      "bengali": "শুধু উপরিভাগে থাকা, গভীরে না যাওয়া. আসল কারণ মিস করে"
    }
  },
  "Speech & Communication (বাক্য ও যোগাযোগ)": {
    "articulate": {
      "meaning": "Able to express complex ideas clearly so anyone can understand. the opposite of mumbling or rambling. Every word serves a purpose",
      "bengali": "জটিল ধারণা স্পষ্টভাবে বোঝাতে সক্ষম, প্রতিটি শব্দ উদ্দেশ্যপূর্ণ"
    },
    "bombastic": {
      "meaning": "Using big, impressive-sounding words that are actually empty. a bombastic speech sounds grand but says nothing meaningful underneath",
      "bengali": "বড় বড় শব্দ ব্যবহার যা শুনতে চমকপ্রদ কিন্তু আসলে ফাঁকা"
    },
    "circumlocution": {
      "meaning": "Using many unnecessary words to say something simple. instead of 'he died,' saying 'he ceased to exist in the physical realm'",
      "bengali": "সরল কথা বলতে অনেক অপ্রয়োজনীয় শব্দ ব্যবহার, ঘুরিয়ে বলা"
    },
    "colloquial": {
      "meaning": "Informal, everyday language that people actually use in conversation. 'gonna' and 'wanna' are colloquial, not used in formal writing",
      "bengali": "দৈনন্দিন কথোপকথনে ব্যবহৃত অনানুষ্ঠানিক ভাষা"
    },
    "concise": {
      "meaning": "Saying exactly what needs to be said with no wasted words. a concise email gets to the point immediately without unnecessary details",
      "bengali": "অপ্রয়োজনীয় শব্দ ছাড়া ঠিক যতটুকু দরকার ততটুকুই বলা"
    },
    "digress": {
      "meaning": "To wander away from the main topic during a speech or writing. 'But I digress' means 'I realize I've gone off-topic, let me get back'",
      "bengali": "মূল বিষয় থেকে সরে অন্য দিকে চলে যাওয়া"
    },
    "eloquent": {
      "meaning": "Speaking in a way that is beautiful, persuasive, and moves people emotionally. an eloquent speech makes people cry, cheer, or take action",
      "bengali": "সুন্দর ও আবেগময়ভাবে বলা যা মানুষকে নাড়া দেয় ও অনুপ্রাণিত করে"
    },
    "garrulous": {
      "meaning": "Talking far too much, especially about unimportant things. a garrulous neighbor who traps you for 40 minutes talking about nothing",
      "bengali": "অতিরিক্ত কথা বলা, বিশেষত তুচ্ছ বিষয়ে. ৪০ মিনিট আটকে রাখে"
    },
    "laconic": {
      "meaning": "Using very few words, sometimes to the point of seeming rude. when asked 'will you surrender?', a Spartan replied 'If.' That's laconic",
      "bengali": "এত কম শব্দে কথা বলা যে রুক্ষ মনে হতে পারে"
    },
    "loquacious": {
      "meaning": "Very talkative, but unlike garrulous, it's not necessarily negative. a loquacious person enjoys conversation and keeps it flowing",
      "bengali": "খুব কথাবলা. garrulous-এর মতো নেতিবাচক নয়, কথা উপভোগ করে"
    },
    "pithy": {
      "meaning": "Expressing a meaningful idea in very few, carefully chosen words. 'Actions speak louder than words' is a pithy saying",
      "bengali": "অল্প কিন্তু সুচিন্তিত শব্দে গভীর অর্থ প্রকাশ"
    },
    "rhetoric": {
      "meaning": "The art of using language persuasively. rhetoric can be positive (inspiring speech) or negative (empty words designed to manipulate)",
      "bengali": "ভাষা দিয়ে প্ররোচিত করার শিল্প. অনুপ্রেরণা বা ম্যানিপুলেশন উভয়ই হতে পারে"
    },
    "succinct": {
      "meaning": "Briefly and clearly expressed. similar to concise but emphasizes clarity too. A succinct summary captures the essence in a few sentences",
      "bengali": "সংক্ষেপে ও স্পষ্টভাবে প্রকাশিত, কয়েকটি বাক্যে সারমর্ম ধরা"
    },
    "terse": {
      "meaning": "Using very few words in a way that seems rude or unfriendly. a terse reply like 'Fine.' tells you the person doesn't want to talk",
      "bengali": "এত কম শব্দে উত্তর যে রূঢ় বা অবান্ধব মনে হয়"
    },
    "verbose": {
      "meaning": "Using far more words than necessary. a verbose writer turns a one-page idea into ten pages. The opposite of concise",
      "bengali": "প্রয়োজনের চেয়ে অনেক বেশি শব্দ ব্যবহার. concise-এর বিপরীত"
    },
    "vociferous": {
      "meaning": "Expressing opinions loudly and forcefully. vociferous protests are impossible to ignore because they're SO loud and passionate",
      "bengali": "উচ্চকণ্ঠে ও জোরালোভাবে মতামত প্রকাশ, উপেক্ষা করা অসম্ভব"
    },
    "taciturn": {
      "meaning": "Habitually quiet, rarely speaking. a taciturn person isn't shy; they simply prefer silence and choose not to talk much",
      "bengali": "অভ্যাসগতভাবে চুপচাপ, কথা বলা পছন্দ করে না. লাজুক নয়"
    },
    "reticent": {
      "meaning": "Unwilling to reveal your thoughts or feelings. a reticent witness in court gives minimal answers and volunteers nothing extra",
      "bengali": "নিজের চিন্তা বা অনুভূতি প্রকাশ করতে অনিচ্ছুক"
    }
  },
  "Emotion: Happiness & Joy (আনন্দ ও সুখ)": {
    "buoyant": {
      "meaning": "Having a cheerful, optimistic attitude that lifts spirits. like floating on water, a buoyant mood keeps you above the negativity",
      "bengali": "প্রফুল্ল ও আশাবাদী মনোভাব যা সবাইকে ভাসিয়ে রাখে"
    },
    "ebullient": {
      "meaning": "Bubbling over with enthusiasm and energy. so excited that you literally can't contain yourself, like a pot boiling over",
      "bengali": "উৎসাহে উথলে পড়া, নিজেকে সামলাতে পারে না"
    },
    "elated": {
      "meaning": "Ecstatically happy, as if floating on air. that feeling when you get amazing news and you feel like you could fly",
      "bengali": "এতটাই খুশি যে মনে হয় উড়ছে, চমৎকার খবরে আনন্দ"
    },
    "euphoria": {
      "meaning": "An intense feeling of happiness and well-being that is almost too good to be real. often temporary and sometimes unrealistic",
      "bengali": "অবাস্তব মনে হওয়ার মতো তীব্র সুখানুভূতি. প্রায়ই সাময়িক"
    },
    "exuberant": {
      "meaning": "Full of joyful, unrestrained energy. an exuberant celebration where people are dancing, shouting, and full of life",
      "bengali": "আনন্দময় ও অসংযত শক্তিতে পূর্ণ, প্রাণোচ্ছল উদযাপন"
    },
    "genial": {
      "meaning": "Warm, friendly, and easy to talk to. a genial host makes everyone feel welcome and comfortable in their home",
      "bengali": "উষ্ণ ও বন্ধুত্বপূর্ণ, সবাইকে স্বাচ্ছন্দ্য বোধ করায়"
    },
    "jovial": {
      "meaning": "Full of happiness and good humor in a hearty, social way. a jovial uncle who tells jokes and laughs loudly at family gatherings",
      "bengali": "হৃদ্য ও সামাজিকভাবে আনন্দময়, পারিবারিক আড্ডায় রসিক"
    },
    "jubilant": {
      "meaning": "Feeling or expressing great joy, especially after a victory or achievement. the jubilant team after winning the championship",
      "bengali": "বিজয় বা সাফল্যের পর মহা আনন্দ প্রকাশ"
    },
    "sanguine": {
      "meaning": "Optimistic and confident about the future even when things look bad. a sanguine person sees the glass as half full during a drought",
      "bengali": "খারাপ সময়েও ভবিষ্যৎ সম্পর্কে আশাবাদী ও আত্মবিশ্বাসী"
    }
  },
  "Emotion: Sadness & Suffering (দুঃখ ও কষ্ট)": {
    "bereft": {
      "meaning": "Deeply deprived of something precious. a bereft parent has lost a child, a bereft nation has lost its leader. Profound, painful loss",
      "bengali": "কিছু মূল্যবান হারিয়ে গভীরভাবে বঞ্চিত ও শূন্য"
    },
    "desolate": {
      "meaning": "Empty, bleak, and utterly without joy. a desolate landscape has no life, a desolate person feels completely alone and hopeless",
      "bengali": "সম্পূর্ণ শূন্য ও আনন্দহীন, একাকী ও আশাহীন"
    },
    "despondent": {
      "meaning": "Having lost all hope and motivation. deeper than sad, it's the feeling of 'what's the point?' when nothing seems worth trying anymore",
      "bengali": "সব আশা ও অনুপ্রেরণা হারিয়ে ফেলা. 'কী লাভ?' অনুভূতি"
    },
    "disconsolate": {
      "meaning": "So unhappy that nothing can comfort you. friends try to cheer you up but nothing works because the grief is too deep",
      "bengali": "এতটাই দুঃখী যে কোনো সান্ত্বনাই কাজ করে না"
    },
    "doleful": {
      "meaning": "Expressing sorrow in a way that's visible and touching. a doleful expression, doleful music, eyes filled with quiet sadness",
      "bengali": "দৃশ্যমান ও হৃদয়স্পর্শী শোক প্রকাশ, চোখে শান্ত বিষাদ"
    },
    "forlorn": {
      "meaning": "Pitifully sad, lonely, and abandoned. a forlorn puppy left at a shelter, or a forlorn hope that has almost no chance of success",
      "bengali": "করুণভাবে দুঃখী, একাকী ও পরিত্যক্ত"
    },
    "lament": {
      "meaning": "To express deep grief or sorrow about something. lamenting a death, lamenting the loss of a tradition. Vocal, emotional mourning",
      "bengali": "গভীর শোক প্রকাশ করা, কোনো কিছু হারানোর জন্য আক্ষেপ"
    },
    "languish": {
      "meaning": "To slowly waste away from neglect, suffering, or unfulfilled desire. prisoners languish in cells, talents languish unused",
      "bengali": "অবহেলা বা কষ্টে ধীরে ধীরে ক্ষয়ে যাওয়া, প্রতিভা অব্যবহৃত থাকা"
    },
    "melancholy": {
      "meaning": "A deep, thoughtful sadness that lingers. not sharp grief but a quiet, persistent sorrow that colors everything gray",
      "bengali": "গভীর ও চিন্তাশীল বিষাদ যা দীর্ঘস্থায়ী, সবকিছু ধূসর করে দেয়"
    },
    "morose": {
      "meaning": "Sullenly gloomy and bad-tempered. a morose person doesn't just feel sad, they're also irritable and unpleasant to be around",
      "bengali": "বিষণ্ণ ও খিটখিটে. শুধু দুঃখী নয়, রূঢ় ও অপ্রীতিকরও"
    },
    "plaintive": {
      "meaning": "Sounding sad and mournful. a plaintive cry or melody that makes your heart ache just listening to it",
      "bengali": "শোকার্ত ও করুণ সুর যা শুনলে বুকে ব্যথা হয়"
    },
    "somber": {
      "meaning": "Dark, gloomy, and serious in mood. a somber funeral, a somber expression. The mood feels heavy and gray",
      "bengali": "অন্ধকার, বিষণ্ণ ও গুরুগম্ভীর পরিবেশ. ভারী ও ধূসর মেজাজ"
    },
    "wistful": {
      "meaning": "Feeling a gentle sadness about something you want but can't have. looking at old photos with wistful longing for the past",
      "bengali": "যা চান কিন্তু পাওয়া সম্ভব নয় তার জন্য মৃদু বিষাদ"
    }
  },
  "Emotion: Anger & Hostility (রাগ ও শত্রুতা)": {
    "acrimonious": {
      "meaning": "Full of anger and bitterness, especially in speech or debate. an acrimonious divorce where both sides say terrible things about each other",
      "bengali": "তিক্ত ও রাগপূর্ণ বিতর্ক বা সম্পর্ক (তিক্ত বিবাহবিচ্ছেদের মতো)"
    },
    "belligerent": {
      "meaning": "Hostile and aggressive, ready to fight. a belligerent drunk at a bar looking for trouble, or a belligerent nation threatening war",
      "bengali": "শত্রুভাবাপন্ন ও আক্রমণাত্মক, মারামারি করতে প্রস্তুত"
    },
    "bellicose": {
      "meaning": "Eager to fight or start conflicts. a bellicose leader who prefers war over diplomacy. The attitude BEFORE a fight starts",
      "bengali": "যুদ্ধ বা দ্বন্দ্ব শুরু করতে আগ্রহী. লড়াই শুরুর আগের মনোভাব"
    },
    "cantankerous": {
      "meaning": "Bad-tempered, argumentative, and difficult to deal with. a cantankerous old man who complains about everything and picks fights over nothing",
      "bengali": "বদমেজাজি ও ঝগড়াটে, সবকিছু নিয়ে অভিযোগ করে"
    },
    "irascible": {
      "meaning": "Having a very short temper, getting angry at the smallest things. an irascible teacher who explodes if a student whispers",
      "bengali": "অত্যন্ত খিটখিটে, ক্ষুদ্রতম বিষয়ে রেগে যায়"
    },
    "petulant": {
      "meaning": "Childishly sulky and bad-tempered over not getting what you want. a petulant reaction is like a grown-up throwing a tantrum",
      "bengali": "চাহিদা পূরণ না হলে বাচ্চাসুলভ রাগ দেখানো"
    },
    "pugnacious": {
      "meaning": "Always eager to argue or fight. a pugnacious debater who loves confrontation and never backs down from a challenge",
      "bengali": "সবসময় তর্ক বা লড়াইয়ে আগ্রহী, চ্যালেঞ্জ থেকে পিছু হটে না"
    },
    "rancor": {
      "meaning": "Deep-seated bitterness and resentment that lasts a long time. holding rancor for years after being betrayed by a friend",
      "bengali": "দীর্ঘস্থায়ী গভীর তিক্ততা ও ক্ষোভ, বিশ্বাসঘাতকতার পর"
    },
    "truculent": {
      "meaning": "Defiantly aggressive and eager to fight. more intense than belligerent, with a cruel edge. Looking for violence, not just conflict",
      "bengali": "বিদ্রোহীভাবে আক্রমণাত্মক ও নিষ্ঠুর, সহিংসতা খুঁজে বেড়ায়"
    },
    "vindictive": {
      "meaning": "Having a strong desire to get revenge for a perceived wrong. a vindictive ex who goes out of their way to make your life miserable",
      "bengali": "প্রতিশোধপরায়ণ, কষ্ট দিতে বিশেষভাবে চেষ্টা করে"
    }
  },
  "Emotion: Fear & Anxiety (ভয় ও উদ্বেগ)": {
    "apprehensive": {
      "meaning": "Anxious that something bad might happen. feeling apprehensive before an exam, not terrified but worried and uneasy about the outcome",
      "bengali": "কিছু খারাপ হতে পারে ভেবে উদ্বিগ্ন. আতঙ্কিত নয়, তবে অস্বস্তি"
    },
    "consternation": {
      "meaning": "Shocked anxiety caused by something unexpected. the consternation on everyone's faces when the CEO suddenly resigned mid-meeting",
      "bengali": "অপ্রত্যাশিত ঘটনায় আঘাতজনিত উদ্বেগ ও বিস্ময়"
    },
    "diffident": {
      "meaning": "Lacking confidence in yourself, modest to the point of being too shy to speak up. a diffident student who knows the answer but won't raise their hand",
      "bengali": "আত্মবিশ্বাসের অভাব, উত্তর জানা সত্ত্বেও হাত তোলে না"
    },
    "trepidation": {
      "meaning": "A feeling of fear or nervousness about something you're about to do. stepping on stage with trepidation, heart pounding, palms sweaty",
      "bengali": "কিছু করতে যাওয়ার আগে ভয় ও নার্ভাসনেস. হৃদকম্পন, ঘাম"
    },
    "timorous": {
      "meaning": "Showing nervousness and a lack of courage. a timorous person avoids any situation that might involve risk or confrontation",
      "bengali": "ভীতু ও সাহসের অভাব, ঝুঁকি বা দ্বন্দ্ব এড়িয়ে চলে"
    },
    "skittish": {
      "meaning": "Easily startled or frightened, nervous and unpredictable. like a skittish horse that jumps at every loud noise",
      "bengali": "সহজে চমকে যায় বা ভয় পায়, ঘোড়ার মতো যে শব্দে লাফিয়ে ওঠে"
    }
  },
  "Indifference & Apathy (উদাসীনতা ও নির্লিপ্ততা)": {
    "aloof": {
      "meaning": "Keeping a cool emotional distance from others. not unfriendly but clearly not interested in getting close or involved",
      "bengali": "অন্যদের থেকে শীতল আবেগময় দূরত্ব বজায় রাখা"
    },
    "apathetic": {
      "meaning": "Showing absolutely no interest, enthusiasm, or concern. an apathetic voter doesn't care who wins because nothing matters to them",
      "bengali": "কোনো আগ্রহ, উৎসাহ বা উদ্বেগ নেই. কিছুই গুরুত্বপূর্ণ মনে হয় না"
    },
    "complacent": {
      "meaning": "Smugly satisfied with the current situation and seeing no need to improve. a complacent company stops innovating because they think they're already the best",
      "bengali": "আত্মতুষ্ট, উন্নতির প্রয়োজন দেখে না কারণ মনে করে ইতিমধ্যে সেরা"
    },
    "detached": {
      "meaning": "Emotionally uninvolved, observing without personal connection. a detached scientist analyzes data without letting feelings affect conclusions",
      "bengali": "আবেগহীনভাবে পর্যবেক্ষণ, ব্যক্তিগত সম্পৃক্ততা ছাড়া"
    },
    "dispassionate": {
      "meaning": "Not influenced by strong emotion, able to think rationally. a dispassionate judge makes fair decisions based on facts, not feelings",
      "bengali": "তীব্র আবেগ দ্বারা প্রভাবিত নয়, তথ্যের ভিত্তিতে যুক্তিসঙ্গত সিদ্ধান্ত"
    },
    "impassive": {
      "meaning": "Showing no emotion at all on your face or in your manner. an impassive poker player reveals nothing, no matter what cards they hold",
      "bengali": "মুখে বা আচরণে কোনো আবেগই প্রকাশ করে না"
    },
    "indifferent": {
      "meaning": "Having no preference or concern either way. indifferent to the outcome means you genuinely don't care what happens",
      "bengali": "কোনো পছন্দ বা উদ্বেগ নেই, ফলাফল যাই হোক কিছু আসে যায় না"
    },
    "insouciant": {
      "meaning": "Showing a casual lack of concern in a carefree way. an insouciant shrug when told about a deadline, as if stress doesn't exist",
      "bengali": "উদ্বেগহীনভাবে নির্বিকার, যেন মানসিক চাপ বলে কিছু নেই"
    },
    "nonchalant": {
      "meaning": "Acting calm and casual as if nothing matters. coolly unconcerned when everyone else is panicking, hands in pockets, no worries",
      "bengali": "সবাই আতঙ্কিত হলেও শান্ত ও নির্বিকার, যেন কিছুই হয়নি"
    },
    "phlegmatic": {
      "meaning": "Having a calm, unexcitable temperament. a phlegmatic person doesn't get ruffled by anything; they're steady and unemotional by nature",
      "bengali": "স্বভাবতই শান্ত ও অবিচলিত, কিছুতেই উত্তেজিত হয় না"
    },
    "stolid": {
      "meaning": "Calm and showing almost no emotion or animation. a stolid farmer who takes crop failure with the same expression as a bumper harvest",
      "bengali": "প্রায় কোনো আবেগ দেখায় না. ফসল নষ্ট বা ভালো, একই মুখ"
    }
  },
  "Arrogance & Pride (অহংকার ও গর্ব)": {
    "arrogant": {
      "meaning": "Having an exaggerated sense of your own importance and abilities. an arrogant person believes they're always right and others are beneath them",
      "bengali": "নিজের গুরুত্ব ও ক্ষমতা সম্পর্কে অতিরঞ্জিত ধারণা, অন্যকে ছোট মনে করা"
    },
    "condescending": {
      "meaning": "Talking to others as if they're inferior or less intelligent. a condescending tone makes you feel like a child being lectured",
      "bengali": "অন্যদের সাথে এমনভাবে কথা বলা যেন তারা নিকৃষ্ট বা কম বুদ্ধিমান"
    },
    "contemptuous": {
      "meaning": "Showing deep disrespect and disgust toward someone you consider worthless. a contemptuous look that says 'you're not even worth my time'",
      "bengali": "গভীর অসম্মান ও ঘৃণা দেখানো, 'তুমি আমার সময়ের যোগ্য নও'"
    },
    "disdain": {
      "meaning": "Feeling that someone or something is beneath your dignity. looking at fast food with disdain, as if it's too lowly for you to eat",
      "bengali": "কাউকে বা কিছুকে নিজের মর্যাদার নিচে মনে করা"
    },
    "haughty": {
      "meaning": "Acting superior and looking down on others. a haughty waiter at a fancy restaurant who makes you feel like you don't belong",
      "bengali": "নিজেকে শ্রেষ্ঠ দেখিয়ে অন্যদের হীন দৃষ্টিতে দেখা"
    },
    "hubris": {
      "meaning": "Dangerous excessive pride that leads to downfall. in Greek tragedy, hubris is when a hero thinks they're above the gods and gets destroyed",
      "bengali": "বিপজ্জনক অতিরিক্ত অহংকার যা পতন ডেকে আনে"
    },
    "imperious": {
      "meaning": "Giving orders and expecting instant obedience, as if you're an emperor. an imperious boss who demands without asking and never says 'please'",
      "bengali": "সম্রাটের মতো আদেশ দেয় ও তাৎক্ষণিক আনুগত্য আশা করে"
    },
    "pompous": {
      "meaning": "Showing an inflated sense of self-importance through grand behavior. a pompous person gives long speeches about their achievements at dinner parties",
      "bengali": "আড়ম্বরপূর্ণ আচরণে স্ফীত আত্মগুরুত্ব দেখানো"
    },
    "supercilious": {
      "meaning": "Behaving as if you're superior to everyone else with an air of cool disdain. raising an eyebrow and smirking at someone's suggestion",
      "bengali": "শীতল অবজ্ঞায় সবার উপরে নিজেকে মনে করা. ভ্রু তুলে হাসা"
    },
    "pretentious": {
      "meaning": "Trying to appear more important, talented, or cultured than you really are. Pretentious behavior is a false display of sophistication.",
      "bengali": "ভান করা"
    },
    "flamboyant": {
      "meaning": "Deliberately showy and attention-seeking in appearance or behavior. A flamboyant person wants to be noticed and does not care about subtlety.",
      "bengali": "জাঁকজমকপূর্ণ"
    },
    "sententious": {
      "meaning": "Moralizing in a pompous, preachy way, as if you are wiser than everyone else. Sententious advice comes across as self-righteous.",
      "bengali": "উপদেশপ্রবণ"
    },
    "audacity": {
      "meaning": "Bold daring that may border on recklessness or disrespect. Audacity can be admirable courage or shocking presumptuousness, depending on context.",
      "bengali": "দুঃসাহস"
    },
    "temerity": {
      "meaning": "Reckless boldness that shows a lack of proper respect or awareness of danger. Having the temerity to do something means being foolishly daring.",
      "bengali": "বেপরোয়া সাহস"
    }
  },
  "Humility & Modesty (বিনয় ও নম্রতা)": {
    "demure": {
      "meaning": "Quiet, modest, and reserved in behavior. a demure smile is subtle, not showy. Often used for women who are politely restrained",
      "bengali": "শান্ত, বিনয়ী ও সংযত. মৃদু হাসি, দেখানোপনা নয়"
    },
    "deferential": {
      "meaning": "Showing polite respect to someone you consider your superior. a deferential student addresses their professor with careful formality",
      "bengali": "যাকে উচ্চতর মনে করে তার প্রতি বিনীত সম্মান প্রদর্শন"
    },
    "humble": {
      "meaning": "Having a low opinion of your own importance. a truly humble person downplays their achievements and credits others",
      "bengali": "নিজের গুরুত্ব সম্পর্কে নিম্ন ধারণা, কৃতিত্ব অন্যদের দেয়"
    },
    "meek": {
      "meaning": "Quiet, gentle, and too willing to let others have their way. meek people don't fight back even when they should",
      "bengali": "শান্ত ও নম্র, প্রতিবাদ করা উচিত হলেও করে না"
    },
    "obsequious": {
      "meaning": "Excessively eager to please or obey. so much flattery and servility that it's clearly fake and uncomfortable to watch",
      "bengali": "অতিরিক্ত তোষামোদ ও সেবা যা স্পষ্টতই ভান এবং দেখতে অস্বস্তিকর"
    },
    "sycophant": {
      "meaning": "A person who flatters powerful people to gain advantage. the office sycophant who laughs at the boss's terrible jokes and agrees with everything",
      "bengali": "ক্ষমতাবানদের তোষামোদ করে সুবিধা পাওয়ার চেষ্টা করে"
    },
    "servile": {
      "meaning": "Excessively willing to serve or please, like a slave. servile obedience means doing whatever you're told without question, losing all dignity",
      "bengali": "দাসের মতো অতিরিক্ত সেবা করতে রাজি, সমস্ত আত্মসম্মান হারিয়ে"
    },
    "subservient": {
      "meaning": "Prepared to obey others unquestioningly, treating yourself as less important. in a subservient role, you always put others' wishes above your own",
      "bengali": "প্রশ্নহীনভাবে অন্যদের আদেশ মানতে প্রস্তুত, নিজেকে কম গুরুত্বপূর্ণ মনে করে"
    },
    "unassuming": {
      "meaning": "Not pretentious or arrogant, modestly blending in. an unassuming millionaire who drives a Honda and wears simple clothes",
      "bengali": "ভানহীন ও বিনয়ী. কোটিপতি হয়েও সাধারণ গাড়ি চালায় ও সাধারণ পোশাক পরে"
    },
    "effacement": {
      "meaning": "The act of making yourself less noticeable or important. Self-effacement means deliberately stepping back and minimizing your own presence.",
      "bengali": "আত্ম-অবলোপন"
    },
    "understated": {
      "meaning": "Expressed in a restrained, subtle way that deliberately avoids emphasis. Understated elegance is more powerful because of its quiet confidence.",
      "bengali": "সংযত"
    },
    "restrained": {
      "meaning": "Controlled and not extreme, showing deliberate moderation. Restrained behavior holds back from excess and maintains composure.",
      "bengali": "সংযত"
    },
    "reserved": {
      "meaning": "Keeping your feelings and thoughts to yourself, not showing emotions openly. A reserved person is controlled and private.",
      "bengali": "সংরক্ষিত"
    },
    "resigned": {
      "meaning": "Accepting something unpleasant without fighting against it. A resigned person has given up resisting and passively accepts their fate.",
      "bengali": "নিয়তিবাদী"
    },
    "sober": {
      "meaning": "Serious, thoughtful, and not influenced by emotions. A sober assessment is clear-headed, factual, and free from excitement.",
      "bengali": "গম্ভীর ও সংযত"
    },
    "solemn": {
      "meaning": "Very serious and formal, without any lightness or humor. A solemn ceremony carries weight and dignity.",
      "bengali": "গম্ভীর"
    }
  },
  "Generosity & Kindness (উদারতা ও সদয়তা)": {
    "altruistic": {
      "meaning": "Selflessly caring about others' well-being, even at personal cost. an altruistic person donates a kidney to a stranger expecting nothing in return",
      "bengali": "নিজের ক্ষতি হলেও অন্যের মঙ্গল চিন্তা করা, কোনো প্রতিদান আশা না করে"
    },
    "benevolent": {
      "meaning": "Kind-hearted and wanting to do good. a benevolent leader genuinely cares about their people's welfare, not just their own power",
      "bengali": "সদয় ও মঙ্গলকামী, প্রকৃতই জনগণের কল্যাণে আগ্রহী"
    },
    "charitable": {
      "meaning": "Generous in giving help or money to those in need. also means being kind and forgiving in your judgments about others",
      "bengali": "অভাবীদের সাহায্যে উদার, অন্যদের সম্পর্কে দয়ালু বিচার"
    },
    "clement": {
      "meaning": "Merciful and lenient, especially when you have the power to punish. a clement judge gives a lighter sentence because they show compassion",
      "bengali": "শাস্তি দেওয়ার ক্ষমতা থাকা সত্ত্বেও করুণাময় ও সহানুভূতিশীল"
    },
    "magnanimous": {
      "meaning": "Generous in forgiving someone who wronged you, especially when you have the upper hand. a magnanimous winner who praises the loser instead of gloating",
      "bengali": "যে ক্ষতি করেছে তাকে উদারভাবে ক্ষমা করা, বিজয়ী হয়েও বড়ত্ব দেখানো"
    },
    "munificent": {
      "meaning": "Extremely generous with money or gifts. a munificent donation that is surprisingly large, far more than expected or required",
      "bengali": "অত্যন্ত উদারহস্তে অর্থ বা উপহার দেওয়া, প্রত্যাশার চেয়ে অনেক বেশি"
    },
    "philanthropic": {
      "meaning": "Devoted to promoting the welfare of others through generous donations of money, time, or resources. building hospitals, funding education",
      "bengali": "হাসপাতাল নির্মাণ, শিক্ষায় অর্থায়নের মাধ্যমে জনকল্যাণে নিবেদিত"
    }
  },
  "Hostility & Harm (শত্রুতা ও ক্ষতি)": {
    "deleterious": {
      "meaning": "Causing harm or damage, especially in a subtle or gradual way. deleterious effects of pollution slowly damage health over years",
      "bengali": "সূক্ষ্ম বা ধীরে ধীরে ক্ষতি করে. দূষণের প্রভাব বছরের পর বছর ধরে"
    },
    "detrimental": {
      "meaning": "Causing damage or harm to something. smoking is detrimental to health. It actively makes things worse",
      "bengali": "ক্ষতিকর. সক্রিয়ভাবে পরিস্থিতি খারাপ করে"
    },
    "inimical": {
      "meaning": "Hostile and harmful, working against something's success. policies inimical to growth actively prevent economic progress",
      "bengali": "শত্রুভাবাপন্ন ও ক্ষতিকর, সাফল্যের বিরুদ্ধে কাজ করে"
    },
    "malevolent": {
      "meaning": "Wishing evil or harm upon others. a malevolent villain who doesn't just want to win but wants to see others suffer",
      "bengali": "অন্যের ক্ষতি বা দুর্ভোগ কামনা করে. শুধু জিততে নয়, কষ্ট দেখতে চায়"
    },
    "malicious": {
      "meaning": "Intending to do harm on purpose. malicious gossip is deliberately spread to hurt someone's reputation",
      "bengali": "ইচ্ছাকৃতভাবে ক্ষতি করার উদ্দেশ্যে. গুজব ইচ্ছাকৃতভাবে ছড়ানো"
    },
    "nefarious": {
      "meaning": "Extremely wicked and criminal. nefarious activities like human trafficking, money laundering, or terrorist plots",
      "bengali": "অত্যন্ত দুষ্ট ও অপরাধমূলক. মানব পাচার, সন্ত্রাসী ষড়যন্ত্র"
    },
    "noxious": {
      "meaning": "Harmful, poisonous, or very unpleasant. noxious fumes from a factory, or noxious ideas that corrupt society",
      "bengali": "ক্ষতিকর, বিষাক্ত, বা অত্যন্ত অপ্রীতিকর. কারখানার বিষাক্ত ধোঁয়া"
    },
    "pernicious": {
      "meaning": "Having a harmful effect that is gradual and not immediately obvious. pernicious lies slowly destroy trust without anyone noticing at first",
      "bengali": "ক্ষতিকর প্রভাব যা ধীরে ধীরে কাজ করে এবং প্রথমে বোঝা যায় না"
    },
    "virulent": {
      "meaning": "Extremely severe, hostile, or harmful. a virulent disease spreads fast and kills, virulent criticism is the most toxic, hateful kind",
      "bengali": "অত্যন্ত তীব্র ও ক্ষতিকর. দ্রুত ছড়ায় এবং ধ্বংসাত্মক"
    }
  },
  "New & Original (নতুন ও মৌলিক)": {
    "avant-garde": {
      "meaning": "Radically new and experimental ideas in art, culture, or politics. avant-garde art challenges every traditional rule on purpose",
      "bengali": "শিল্প/সংস্কৃতিতে আমূল নতুন ও পরীক্ষামূলক. প্রতিটি ঐতিহ্য ভাঙে"
    },
    "groundbreaking": {
      "meaning": "So innovative that it opens up entirely new possibilities. a groundbreaking discovery that changes how we understand the world",
      "bengali": "এত উদ্ভাবনী যে সম্পূর্ণ নতুন সম্ভাবনা খুলে দেয়"
    },
    "ingenious": {
      "meaning": "Cleverly inventive and original. an ingenious solution to a problem that seemed impossible, using a creative approach no one thought of",
      "bengali": "চতুরভাবে উদ্ভাবনী. অসম্ভব সমস্যার সৃজনশীল সমাধান"
    },
    "innovative": {
      "meaning": "Introducing new methods, ideas, or products. an innovative company doesn't just copy others; they create entirely new approaches",
      "bengali": "নতুন পদ্ধতি বা ধারণা প্রবর্তন করে, অন্যদের নকল নয়"
    },
    "nascent": {
      "meaning": "Just beginning to develop, still in the earliest stages. a nascent technology is brand new and hasn't matured yet, full of potential but unproven",
      "bengali": "সবেমাত্র বিকশিত হতে শুরু করেছে. সম্ভাবনাময় কিন্তু অপ্রমাণিত"
    },
    "novel": {
      "meaning": "New and original in a way that hasn't been done before. a novel approach means a fresh idea, not a rehash of old methods",
      "bengali": "আগে কখনো হয়নি এমন নতুন ও মৌলিক পদ্ধতি"
    },
    "unprecedented": {
      "meaning": "Never having happened or existed before in history. unprecedented rainfall means nothing like this has ever been recorded",
      "bengali": "ইতিহাসে এর আগে কখনো ঘটেনি. অভূতপূর্ব"
    },
    "seminal": {
      "meaning": "A work or event so influential that it shapes everything that comes after. Darwin's seminal work on evolution changed all of biology forever",
      "bengali": "এত প্রভাবশালী কাজ যে পরবর্তী সবকিছু তার দ্বারা রূপায়িত হয়"
    },
    "inventive": {
      "meaning": "Having the ability to create new, original things or ideas. An inventive mind sees possibilities that others overlook.",
      "bengali": "উদ্ভাবনী"
    },
    "maverick": {
      "meaning": "An independent thinker who refuses to follow conventional rules or opinions. A maverick boldly goes their own way.",
      "bengali": "স্বতন্ত্র চিন্তাবিদ"
    },
    "precocious": {
      "meaning": "Developing abilities or maturity much earlier than expected. A precocious child shows talent or understanding far beyond their years.",
      "bengali": "অকালপক্ব"
    },
    "embryonic": {
      "meaning": "In the earliest stage of development, not yet fully formed. An embryonic idea has potential but needs much more work.",
      "bengali": "ভ্রূণ অবস্থায়"
    },
    "emerging": {
      "meaning": "Gradually becoming visible, known, or established. An emerging trend is just starting to appear and gain recognition.",
      "bengali": "উদীয়মান"
    },
    "inchoate": {
      "meaning": "Not yet fully formed or developed, still in early stages. An inchoate plan is rough, incomplete, and needs shaping.",
      "bengali": "অপূর্ণ ও অবিকশিত"
    }
  },
  "Old & Traditional (পুরানো ও ঐতিহ্যবাহী)": {
    "anachronistic": {
      "meaning": "Belonging to a different time period. using a typewriter in 2024 is anachronistic, like wearing a top hat to a gym",
      "bengali": "ভুল সময়ের জিনিস. ২০২৪-এ টাইপরাইটার ব্যবহার করা"
    },
    "antiquated": {
      "meaning": "So old-fashioned that it's no longer useful or relevant. antiquated laws that made sense in 1900 but are absurd today",
      "bengali": "এত পুরানো যে আর কার্যকর বা প্রাসঙ্গিক নয়"
    },
    "archaic": {
      "meaning": "Belonging to a much earlier period, very old. archaic language like 'thou' and 'hath' that nobody uses anymore",
      "bengali": "অনেক আগের সময়ের. 'thou' এর মতো ভাষা যা আর কেউ ব্যবহার করে না"
    },
    "conventional": {
      "meaning": "Following what's traditionally done, sticking to established norms. a conventional approach plays it safe by doing what everyone else does",
      "bengali": "ঐতিহ্যগতভাবে যা করা হয় তাই অনুসরণ করা, নিরাপদ পথ"
    },
    "defunct": {
      "meaning": "No longer existing or functioning. a defunct company has shut down completely, a defunct law is no longer in effect",
      "bengali": "আর অস্তিত্ব নেই বা কাজ করে না. সম্পূর্ণ বন্ধ হয়ে গেছে"
    },
    "obsolete": {
      "meaning": "No longer used because something better has replaced it. floppy disks are obsolete now that we have USB drives and cloud storage",
      "bengali": "আর ব্যবহৃত হয় না কারণ ভালো কিছু তার স্থান নিয়েছে"
    },
    "orthodox": {
      "meaning": "Strictly following traditional beliefs and practices. orthodox methods are the 'by the book' approaches that have been used for generations",
      "bengali": "কঠোরভাবে প্রথাগত বিশ্বাস ও রীতি অনুসরণ. বইয়ের নিয়ম মেনে চলা"
    },
    "retrograde": {
      "meaning": "Moving backward, returning to a worse state. a retrograde step means going backwards instead of forward, undoing progress",
      "bengali": "পেছনের দিকে যাওয়া, অগ্রগতি বাতিল করে খারাপ অবস্থায় ফেরা"
    },
    "vestige": {
      "meaning": "A small remaining trace of something that has mostly disappeared. vestiges of the Roman Empire are the ruins and roads still visible today",
      "bengali": "প্রায় বিলুপ্ত কিছুর অবশিষ্ট চিহ্ন. রোমান সাম্রাজ্যের ধ্বংসাবশেষ"
    }
  },
  "Power & Authority (ক্ষমতা ও কর্তৃত্ব)": {
    "authoritarian": {
      "meaning": "Demanding strict obedience and limiting personal freedom. an authoritarian government controls what people can say, do, and think",
      "bengali": "কঠোর আনুগত্য দাবি করে ও ব্যক্তি স্বাধীনতা সীমিত করে"
    },
    "autocratic": {
      "meaning": "Ruling with absolute, unchecked power. one person makes all decisions without consulting anyone else or facing any accountability",
      "bengali": "কারো সাথে পরামর্শ না করে একচ্ছত্র ক্ষমতায় শাসন"
    },
    "coerce": {
      "meaning": "To force someone to do something using threats or pressure. not physical violence necessarily, but making someone feel they have no choice",
      "bengali": "হুমকি বা চাপ দিয়ে কাউকে কিছু করতে বাধ্য করা"
    },
    "hegemony": {
      "meaning": "Dominance or leadership of one group over others. cultural hegemony means one culture's values dominate and everyone else follows them",
      "bengali": "এক গোষ্ঠীর অন্যদের উপর আধিপত্য. সবাই তাদের মূল্যবোধ অনুসরণ করে"
    },
    "mandate": {
      "meaning": "An official order or the authority to carry out a policy. winning an election gives a leader a mandate from the people to implement their promises",
      "bengali": "আনুষ্ঠানিক আদেশ বা নীতি বাস্তবায়নের কর্তৃত্ব"
    },
    "subjugate": {
      "meaning": "To bring a people or nation under complete control using force. colonizers subjugated indigenous populations, stripping them of all autonomy",
      "bengali": "বলপ্রয়োগে কোনো জাতি বা জনগোষ্ঠীকে সম্পূর্ণ নিয়ন্ত্রণে আনা"
    },
    "tyrannical": {
      "meaning": "Exercising power in a cruel, unjust way. a tyrannical ruler who punishes citizens for the smallest acts of disobedience",
      "bengali": "নিষ্ঠুর ও অন্যায়ভাবে ক্ষমতা প্রয়োগ. সামান্য অবাধ্যতায় শাস্তি দেয়"
    },
    "usurp": {
      "meaning": "To seize power or a position illegally and by force. a general who usurps the presidency through a military coup",
      "bengali": "অবৈধভাবে ও বলপ্রয়োগে ক্ষমতা বা পদ দখল করা"
    }
  },
  "Forgiveness & Blame (ক্ষমা ও দোষারোপ)": {
    "absolve": {
      "meaning": "To officially declare someone free from guilt or blame. new evidence absolved the suspect, proving they were innocent all along",
      "bengali": "আনুষ্ঠানিকভাবে দোষমুক্ত ঘোষণা করা. নতুন প্রমাণে নির্দোষ প্রমাণ"
    },
    "acquit": {
      "meaning": "To find someone not guilty in a court of law. the jury acquitted the defendant after finding insufficient evidence",
      "bengali": "আদালতে নির্দোষ রায় দেওয়া. অপর্যাপ্ত প্রমাণে মুক্তি"
    },
    "culpable": {
      "meaning": "Deserving blame for doing something wrong. if you knew about the danger and did nothing, you are culpable for the harm that followed",
      "bengali": "ভুল করার জন্য দোষী. বিপদ জানা সত্ত্বেও কিছু না করলে দায়ী"
    },
    "exonerate": {
      "meaning": "To completely clear someone of blame or suspicion. DNA evidence exonerated the man who spent 20 years in prison for a crime he didn't commit",
      "bengali": "সম্পূর্ণ দোষমুক্ত করা. ২০ বছর কারাভোগের পর নিরপরাধ প্রমাণ"
    },
    "implicate": {
      "meaning": "To show that someone is involved in a crime or wrongdoing. the emails implicated the CEO in the fraud scheme",
      "bengali": "অপরাধ বা অন্যায়ে কারো সম্পৃক্ততা দেখানো"
    },
    "incriminate": {
      "meaning": "To provide evidence that makes someone appear guilty. incriminating evidence like fingerprints at the crime scene",
      "bengali": "কাউকে দোষী দেখায় এমন প্রমাণ সরবরাহ করা"
    },
    "remorse": {
      "meaning": "Deep, painful regret for something wrong you've done. genuine remorse means you truly wish you could undo what you did",
      "bengali": "নিজের করা ভুলের জন্য গভীর ও যন্ত্রণাদায়ক অনুশোচনা"
    },
    "repentant": {
      "meaning": "Feeling or showing sincere regret for wrongdoing and wanting to change. a repentant criminal who genuinely wants to make amends and start fresh",
      "bengali": "ভুলের জন্য আন্তরিক অনুতাপ ও পরিবর্তনের ইচ্ছা"
    }
  },
  "Social & Community (সামাজিক ও সম্প্রদায়)": {
    "affable": {
      "meaning": "Friendly, warm, and easy to talk to. an affable person puts everyone at ease immediately with their welcoming manner",
      "bengali": "বন্ধুত্বপূর্ণ ও সহজে কথা বলা যায়. সবাইকে স্বস্তি দেয়"
    },
    "amiable": {
      "meaning": "Good-natured and likeable. an amiable person is pleasant company, not because they're trying but because they genuinely are nice",
      "bengali": "সদয় ও পছন্দনীয়. চেষ্টা করে না, স্বভাবতই ভালো মানুষ"
    },
    "amicable": {
      "meaning": "Describing a relationship or agreement that is friendly and without hostility. an amicable divorce where both sides part on good terms",
      "bengali": "শত্রুতাহীন বন্ধুত্বপূর্ণ সম্পর্ক. ভালো শর্তে আলাদা হওয়া"
    },
    "camaraderie": {
      "meaning": "A feeling of close friendship and trust among a group who spend time together. the camaraderie of a sports team who've trained together for years",
      "bengali": "একসাথে সময় কাটানো দলের মধ্যে ঘনিষ্ঠ বন্ধুত্ব ও বিশ্বাস"
    },
    "congenial": {
      "meaning": "Pleasant and suited to your personality. a congenial atmosphere is one where you feel comfortable and at home",
      "bengali": "সুখকর ও আপনার ব্যক্তিত্বের সাথে মানানসই. ঘরের মতো আরাম"
    },
    "convivial": {
      "meaning": "Friendly, lively, and enjoyable. a convivial dinner party with great food, flowing conversation, and lots of laughter",
      "bengali": "প্রাণবন্ত ও আনন্দময় আড্ডা. ভালো খাবার, কথোপকথন ও হাসি"
    },
    "cosmopolitan": {
      "meaning": "Familiar with and comfortable in many different cultures and countries. a cosmopolitan city has people from everywhere living together",
      "bengali": "বিভিন্ন সংস্কৃতি ও দেশের সাথে পরিচিত ও স্বাচ্ছন্দ্য"
    },
    "gregarious": {
      "meaning": "Enjoying and seeking the company of others. a gregarious person loves being in groups, parties, and social gatherings",
      "bengali": "অন্যদের সঙ্গ উপভোগ করে ও খোঁজে. পার্টি ও সামাজিক জমায়েত পছন্দ"
    },
    "egalitarian": {
      "meaning": "Believing that all people should have equal rights and opportunities. an egalitarian workplace pays men and women equally for the same work",
      "bengali": "সব মানুষের সমান অধিকার ও সুযোগে বিশ্বাসী"
    },
    "rapport": {
      "meaning": "A close, harmonious relationship where people understand each other. building rapport with a client means creating trust and mutual understanding",
      "bengali": "ঘনিষ্ঠ ও সুসম্পর্ক যেখানে পারস্পরিক বোঝাপড়া আছে"
    },
    "eccentric": {
      "meaning": "Unconventional and slightly strange, but in a harmless, individual way. An eccentric person marches to their own drummer.",
      "bengali": "খামখেয়ালি"
    },
    "idiosyncratic": {
      "meaning": "Peculiar to a specific individual, not shared by others. Idiosyncratic habits are unique personal quirks.",
      "bengali": "ব্যক্তিগত বৈশিষ্ট্যপূর্ণ"
    },
    "pervasive": {
      "meaning": "Spread throughout and present everywhere. Something pervasive has thoroughly penetrated every corner of a system or society.",
      "bengali": "সর্বব্যাপী"
    },
    "ubiquitous": {
      "meaning": "Found or present absolutely everywhere, seeming to exist in all places at the same time.",
      "bengali": "সর্বত্র বিদ্যমান"
    },
    "endemic": {
      "meaning": "Native to and found regularly in a particular region or group. An endemic problem is deeply embedded in a specific context.",
      "bengali": "স্থানীয় ও বিশেষ অঞ্চলের"
    },
    "conducive": {
      "meaning": "Creating conditions that help make something happen. A conducive environment supports and encourages a particular outcome.",
      "bengali": "সহায়ক"
    },
    "enable": {
      "meaning": "To make something possible by removing barriers or providing the means. Enabling gives someone the tools or permission to act.",
      "bengali": "সক্ষম করা"
    },
    "facilitate": {
      "meaning": "To make a process easier and smoother. Facilitating removes friction and helps things flow more efficiently.",
      "bengali": "সহজতর করা"
    },
    "edifice": {
      "meaning": "A large, imposing building, or metaphorically, a complex system or institution. The edifice of democracy refers to its grand, intricate structure.",
      "bengali": "সুবিশাল ভবন / কাঠামো"
    },
    "moribund": {
      "meaning": "Near death or in terminal decline. A moribund industry or tradition is fading away and almost gone.",
      "bengali": "মৃতপ্রায়"
    },
    "pristine": {
      "meaning": "In its original, pure, untouched condition. Something pristine has not been spoiled or corrupted by use or time.",
      "bengali": "আদি ও অকলুষিত"
    }
  },
  "Isolation & Exclusion (বিচ্ছিন্নতা ও বহিষ্কার)": {
    "cloistered": {
      "meaning": "Sheltered from the outside world, living in seclusion. a cloistered life in a monastery, or a cloistered academic who never leaves their ivory tower",
      "bengali": "বাইরের জগৎ থেকে আশ্রিত ও নির্জন. মঠে বা হাতির দাঁতের টাওয়ারে"
    },
    "estrange": {
      "meaning": "To cause someone who was close to become distant and hostile. years of fighting estranged the brothers until they stopped speaking entirely",
      "bengali": "ঘনিষ্ঠ কাউকে দূরে ঠেলে দেওয়া. ভাইয়েরা কথা বলা বন্ধ করে দিল"
    },
    "marginalize": {
      "meaning": "To push a group to the edges of society, making them feel unimportant and powerless. marginalized communities lack a voice in decisions that affect them",
      "bengali": "কোনো গোষ্ঠীকে সমাজের প্রান্তে ঠেলে দেওয়া, ক্ষমতাহীন করা"
    },
    "ostracize": {
      "meaning": "To deliberately exclude someone from a group, making them an outcast. being ostracized at school means no one talks to you or includes you",
      "bengali": "ইচ্ছাকৃতভাবে দল থেকে বাদ দেওয়া. কেউ কথা বলে না বা অন্তর্ভুক্ত করে না"
    },
    "reclusive": {
      "meaning": "Living alone and avoiding contact with other people. a reclusive author who hasn't given an interview in 30 years",
      "bengali": "একা থাকে ও অন্যদের সাথে যোগাযোগ এড়ায়. ৩০ বছরে সাক্ষাৎকার দেয়নি"
    },
    "sequester": {
      "meaning": "To isolate or set apart from everything else. sequestering a jury means keeping them away from all outside influence during a trial",
      "bengali": "সবকিছু থেকে আলাদা করা. বিচারের সময় জুরিকে বাইরের প্রভাব থেকে দূরে রাখা"
    }
  },
  "Time & Duration (সময় ও সময়কাল)": {
    "ephemeral": {
      "meaning": "Lasting for an extremely short time. a rainbow is ephemeral, beautiful for a moment then gone. Social media fame is often ephemeral",
      "bengali": "অত্যন্ত ক্ষণস্থায়ী. রংধনুর মতো সুন্দর কিন্তু মুহূর্তেই শেষ"
    },
    "evanescent": {
      "meaning": "Quickly fading from sight, memory, or existence. even more fleeting than ephemeral, like morning dew that vanishes at first light",
      "bengali": "দ্রুত দৃষ্টি বা স্মৃতি থেকে মুছে যায়. সকালের শিশিরের মতো"
    },
    "fleeting": {
      "meaning": "Passing very quickly, lasting only a brief moment. a fleeting glance, a fleeting feeling of joy, a fleeting opportunity you must grab NOW",
      "bengali": "দ্রুত চলে যায়, শুধু সংক্ষিপ্ত মুহূর্ত. এখনই ধরতে হবে"
    },
    "incessant": {
      "meaning": "Continuing without any pause or break. incessant rain for three days straight, or incessant complaining that never stops",
      "bengali": "কোনো বিরতি ছাড়াই অবিরাম চলতে থাকে"
    },
    "interminable": {
      "meaning": "Seeming to last forever, endlessly boring or tedious. an interminable meeting that goes on for 4 hours about nothing important",
      "bengali": "শেষ হচ্ছে না মনে হয়, অসীম বিরক্তিকর. ৪ ঘণ্টার অপ্রয়োজনীয় মিটিং"
    },
    "perennial": {
      "meaning": "Lasting forever or constantly recurring. a perennial problem keeps coming back season after season, never fully solved",
      "bengali": "চিরস্থায়ী বা বারবার ফিরে আসে. কখনো পুরোপুরি সমাধান হয় না"
    },
    "protracted": {
      "meaning": "Lasting much longer than expected or necessary. protracted negotiations that drag on for months when they should have taken days",
      "bengali": "প্রত্যাশার চেয়ে অনেক বেশি সময় ধরে চলে. দিনের কাজ মাসে"
    },
    "sporadic": {
      "meaning": "Happening at irregular, unpredictable intervals. sporadic gunfire means shots ring out randomly, not in a steady pattern",
      "bengali": "অনিয়মিত ও অনির্দেশ্য বিরতিতে ঘটে. কখন হবে বলা যায় না"
    },
    "transient": {
      "meaning": "Lasting only for a short time, then moving on. transient workers move from city to city, transient feelings fade quickly",
      "bengali": "অল্প সময়ের জন্য থাকে তারপর চলে যায়"
    },
    "chronic": {
      "meaning": "Persisting for a long time, seemingly permanent. a chronic illness lasts years, chronic poverty seems impossible to escape",
      "bengali": "দীর্ঘ সময় ধরে স্থায়ী, যেন কখনো শেষ হবে না"
    }
  },
  "Morality & Ethics (নৈতিকতা ও নীতিশাস্ত্র)": {
    "principled": {
      "meaning": "Acting according to strong moral beliefs, even when it's costly. a principled journalist refuses to reveal sources even if threatened with jail",
      "bengali": "দৃঢ় নৈতিক বিশ্বাস অনুযায়ী কাজ করা, ক্ষতি হলেও. জেলের ভয়েও সোর্স প্রকাশ করে না"
    },
    "sanctimonious": {
      "meaning": "Pretending to be morally superior while actually being a hypocrite. a sanctimonious politician who preaches family values while cheating on their spouse",
      "bengali": "নৈতিকভাবে শ্রেষ্ঠ ভান করে কিন্তু আসলে ভণ্ড"
    },
    "unconscionable": {
      "meaning": "Shockingly unfair or morally wrong. unconscionable treatment of workers who are paid nothing and forced to work 16-hour days",
      "bengali": "চমকানোর মতো অন্যায়. শ্রমিকদের বিনা পারিশ্রমিকে ১৬ ঘণ্টা কাজ করানো"
    },
    "unscrupulous": {
      "meaning": "Having no moral principles, willing to do anything to succeed. an unscrupulous business owner who lies, cheats, and exploits workers",
      "bengali": "কোনো নৈতিক নীতি নেই, সাফল্যের জন্য যেকোনো কিছু করতে রাজি"
    },
    "virtuous": {
      "meaning": "Having high moral standards and living by them consistently. a virtuous person does the right thing not for reward but because it's right",
      "bengali": "উচ্চ নৈতিক মান বজায় রাখে. পুরস্কারের জন্য নয়, সঠিক বলেই করে"
    }
  },
  "Doubt & Skepticism (সন্দেহ ও সংশয়)": {
    "ambivalent": {
      "meaning": "Having mixed, contradictory feelings about something. ambivalent about a job offer means part of you wants it and part doesn't, pulled both ways",
      "bengali": "কোনো বিষয়ে পরস্পরবিরোধী অনুভূতি. আংশিক চায়, আংশিক চায় না"
    },
    "cynical": {
      "meaning": "Believing that people are motivated purely by self-interest. a cynical person thinks every kind act has a hidden selfish motive behind it",
      "bengali": "বিশ্বাস করে মানুষ শুধু স্বার্থে কাজ করে. প্রতিটি সদয় কাজের পিছনে স্বার্থ খোঁজে"
    },
    "dubious": {
      "meaning": "Feeling doubtful or uncertain about something. a dubious claim is one you're not sure whether to believe, something seems off",
      "bengali": "কোনো বিষয়ে সন্দিহান. বিশ্বাস করবে কি না নিশ্চিত নয়, কিছু একটা ঠিক নেই"
    },
    "incredulous": {
      "meaning": "Unable or unwilling to believe something. an incredulous expression says 'you can't be serious!' when hearing something unbelievable",
      "bengali": "বিশ্বাস করতে অক্ষম বা অনিচ্ছুক. 'তুমি সিরিয়াস নও!' ভাব"
    },
    "skeptical": {
      "meaning": "Not easily convinced, needing evidence before believing. a healthy quality: a skeptical thinker questions claims rather than blindly accepting",
      "bengali": "সহজে বিশ্বাস করে না, প্রমাণ চায়. অন্ধভাবে মানার বদলে প্রশ্ন করে"
    },
    "tentative": {
      "meaning": "Not certain or fixed, done without confidence. a tentative plan might change, a tentative step is taken cautiously as if testing the ground",
      "bengali": "নিশ্চিত নয়, পরিবর্তন হতে পারে. সতর্কভাবে পা ফেলা যেন মাটি পরীক্ষা করছে"
    },
    "wary": {
      "meaning": "Cautious and watchful for potential danger or problems. wary of strangers means keeping your guard up until you know their intentions",
      "bengali": "সম্ভাব্য বিপদ সম্পর্কে সতর্ক ও সজাগ. উদ্দেশ্য না জানা পর্যন্ত সাবধান"
    },
    "implausible": {
      "meaning": "Not believable, seeming unlikely to be true. An implausible explanation strains credibility because it does not fit the evidence.",
      "bengali": "অবিশ্বাস্য"
    },
    "far-fetched": {
      "meaning": "So unlikely or improbable that it is hard to take seriously. A far-fetched theory requires too many unlikely assumptions.",
      "bengali": "অসম্ভাব্য"
    },
    "speculative": {
      "meaning": "Based on guesswork rather than solid evidence. Speculative reasoning reaches conclusions without sufficient proof to support them.",
      "bengali": "অনুমানমূলক"
    },
    "tenuous": {
      "meaning": "Very weak, thin, or poorly supported. A tenuous connection barely holds together and could break at any moment.",
      "bengali": "দুর্বল ও ক্ষীণ"
    },
    "flimsy": {
      "meaning": "Weak and lacking substance, easily destroyed. A flimsy argument collapses under the slightest scrutiny because it has no real support.",
      "bengali": "দুর্বল"
    },
    "untenable": {
      "meaning": "Impossible to defend or maintain. An untenable position is so weak that no argument can save it.",
      "bengali": "অসমর্থনীয়"
    },
    "plausible": {
      "meaning": "Seeming reasonable and believable enough to be accepted, though not necessarily proven true.",
      "bengali": "যুক্তিসঙ্গত"
    }
  },
  "Work & Effort (কাজ ও প্রচেষ্টা)": {
    "assiduous": {
      "meaning": "Working with persistent, careful attention to detail. an assiduous researcher who checks every fact three times before publishing",
      "bengali": "ক্রমাগত যত্নসহকারে বিশদে মনোযোগ দিয়ে কাজ করা"
    },
    "diligent": {
      "meaning": "Working hard with steady effort and care. a diligent student doesn't just study hard but studies consistently and thoroughly",
      "bengali": "ধারাবাহিক প্রচেষ্টা ও যত্নের সাথে পরিশ্রম. শুধু কঠিন নয়, সুসংগত"
    },
    "fastidious": {
      "meaning": "Extremely attentive to detail and accuracy, often to an excessive degree. a fastidious editor who spots a misplaced comma on page 400",
      "bengali": "অত্যধিক বিশদে মনোযোগী. ৪০০ পাতায় একটি ভুল কমা ধরে ফেলে"
    },
    "indefatigable": {
      "meaning": "Never getting tired, working tirelessly without rest. an indefatigable campaigner who knocks on doors for 14 hours a day, every day",
      "bengali": "কখনো ক্লান্ত হয় না, বিশ্রাম ছাড়া অক্লান্তভাবে কাজ করে"
    },
    "meticulous": {
      "meaning": "Showing extreme care about every tiny detail. a meticulous craftsman who spends hours perfecting a single joint in a piece of furniture",
      "bengali": "প্রতিটি ক্ষুদ্র বিষয়ে অত্যন্ত যত্নবান. একটি জোড় নিখুঁত করতে ঘণ্টা ব্যয়"
    },
    "painstaking": {
      "meaning": "Done with extreme care and great effort. painstaking research that took 5 years of careful, detailed investigation to complete",
      "bengali": "অত্যন্ত যত্ন ও বিপুল পরিশ্রমে করা. ৫ বছরের সতর্ক গবেষণা"
    },
    "zealous": {
      "meaning": "Having intense enthusiasm and passion for something. a zealous advocate fights for their cause with burning dedication",
      "bengali": "তীব্র উৎসাহ ও আবেগের সাথে কিছুর জন্য লড়া"
    }
  },
  "Laziness & Inaction (অলসতা ও নিষ্ক্রিয়তা)": {
    "dormant": {
      "meaning": "Temporarily inactive but capable of becoming active again. a dormant volcano hasn't erupted in years but could erupt any time",
      "bengali": "সাময়িকভাবে নিষ্ক্রিয় কিন্তু যেকোনো সময় সক্রিয় হতে পারে"
    },
    "indolent": {
      "meaning": "Wanting to avoid any form of activity or effort. an indolent person doesn't just rest; they actively resist doing anything productive",
      "bengali": "যেকোনো কার্যকলাপ এড়াতে চায়. শুধু বিশ্রাম নয়, উৎপাদনশীল কিছু করতে প্রতিরোধ"
    },
    "languid": {
      "meaning": "Lacking physical or mental energy, moving slowly. a languid afternoon where the heat makes everyone too tired to move",
      "bengali": "শারীরিক বা মানসিক শক্তির অভাব, ধীরে চলা. গরমে ক্লান্ত দুপুর"
    },
    "lethargic": {
      "meaning": "Sluggish, drowsy, and without energy. feeling lethargic after a heavy meal, unable to concentrate or move quickly",
      "bengali": "অলস, তন্দ্রাচ্ছন্ন ও শক্তিহীন. ভারী খাবারের পর মনোযোগ দিতে পারে না"
    },
    "listless": {
      "meaning": "Lacking energy or enthusiasm for anything. a listless student who stares out the window with no interest in the lesson",
      "bengali": "কোনো কিছুতে শক্তি বা উৎসাহ নেই. জানালার বাইরে তাকিয়ে থাকে"
    },
    "quiescent": {
      "meaning": "In a state of quiet inactivity. a quiescent period between two storms, or a quiescent disease that shows no symptoms temporarily",
      "bengali": "শান্ত নিষ্ক্রিয়তায়. দুই ঝড়ের মাঝে শান্ত সময়, বা লক্ষণহীন রোগ"
    },
    "stagnant": {
      "meaning": "Not flowing, growing, or developing. stagnant water breeds mosquitoes, a stagnant economy has no growth or improvement",
      "bengali": "প্রবাহিত, বৃদ্ধি বা বিকাশ হচ্ছে না. স্থবির পানিতে মশা জন্মায়"
    },
    "torpid": {
      "meaning": "Mentally or physically sluggish, almost inactive. like a hibernating animal, too lethargic to respond to anything",
      "bengali": "মানসিক বা শারীরিকভাবে অচল. শীতনিদ্রায় থাকা প্রাণীর মতো"
    }
  },
  "Secrecy & Concealment (গোপনীয়তা ও আড়াল)": {
    "clandestine": {
      "meaning": "Kept secret because it would be disapproved of or is illegal. a clandestine meeting between spies at midnight in a dark alley",
      "bengali": "অবৈধ বা অনুমোদনহীন বলে গোপন রাখা. গুপ্তচরদের মধ্যরাতের সাক্ষাৎ"
    },
    "covert": {
      "meaning": "Not openly shown or acknowledged. covert operations are secret military missions that the government doesn't admit to publicly",
      "bengali": "প্রকাশ্যে দেখানো বা স্বীকার করা হয় না. গোপন সামরিক অভিযান"
    },
    "furtive": {
      "meaning": "Sneaky, trying to avoid being noticed. a furtive glance over your shoulder to make sure no one is watching before you do something secret",
      "bengali": "লুকিয়ে, কেউ দেখছে কিনা পেছনে তাকিয়ে. গোপন কিছু করার আগে"
    },
    "latent": {
      "meaning": "Existing but hidden, not yet showing itself. latent talent that hasn't been discovered yet, or a latent disease with no symptoms so far",
      "bengali": "আছে কিন্তু লুকানো, এখনো প্রকাশ পায়নি. আবিষ্কৃত হয়নি এমন প্রতিভা"
    },
    "tacit": {
      "meaning": "Understood or agreed without being spoken. a tacit agreement is one where both parties know the deal without ever putting it into words",
      "bengali": "না বলেও বোঝা বা সম্মত. উভয় পক্ষ শব্দ ছাড়াই বোঝে"
    },
    "veiled": {
      "meaning": "Partially hidden or disguised. a veiled threat sounds polite on the surface but the danger is clearly implied underneath",
      "bengali": "আংশিকভাবে লুকানো. বাইরে ভদ্র শোনায় কিন্তু ভেতরে হুমকি স্পষ্ট"
    },
    "stealthy": {
      "meaning": "Moving or acting in a quiet, secretive way to avoid being noticed. Stealthy approaches rely on concealment and surprise.",
      "bengali": "চোরাগোপ্তা"
    },
    "coy": {
      "meaning": "Deliberately shy or evasive, especially about revealing information. A coy response teases by withholding what you want to know.",
      "bengali": "লাজুক ভান করা"
    }
  },
  "Flexibility & Rigidity (নমনীয়তা ও কঠোরতা)": {
    "dogmatic": {
      "meaning": "Forcing your beliefs on others as if they're absolute truth. a dogmatic leader who refuses to consider any viewpoint other than their own",
      "bengali": "নিজের বিশ্বাস পরম সত্য হিসেবে চাপিয়ে দেওয়া, অন্য দৃষ্টিভঙ্গি প্রত্যাখ্যান"
    },
    "doctrinaire": {
      "meaning": "Rigidly applying theoretical principles without considering practical reality. a doctrinaire approach that works on paper but fails in real life",
      "bengali": "বাস্তবতা বিবেচনা না করে কঠোরভাবে তত্ত্ব প্রয়োগ. কাগজে কাজ করে, বাস্তবে ব্যর্থ"
    },
    "hidebound": {
      "meaning": "Unwilling to change because of tradition. a hidebound institution that does things the old way simply because 'that's how it's always been done'",
      "bengali": "ঐতিহ্যের কারণে পরিবর্তনে অনিচ্ছুক. 'সবসময় এভাবেই হয়েছে'"
    },
    "malleable": {
      "meaning": "Easily shaped, influenced, or changed. malleable metal can be bent; a malleable person's opinions can be easily changed by others",
      "bengali": "সহজে আকার দেওয়া বা প্রভাবিত করা যায়. মত সহজে বদলায়"
    },
    "pragmatic": {
      "meaning": "Dealing with things in a practical, realistic way rather than following theory. a pragmatic leader finds solutions that work, even if they're not perfect",
      "bengali": "তত্ত্ব নয়, বাস্তব ও কার্যকর উপায়ে সমস্যা সমাধান. নিখুঁত না হলেও কাজ করে"
    },
    "pliable": {
      "meaning": "Easily bent or easily influenced. a pliable material bends without breaking; a pliable person goes along with whatever others want",
      "bengali": "সহজে বাঁকানো যায় বা প্রভাবিত হয়. অন্যরা যা চায় তাই করে"
    },
    "rigid": {
      "meaning": "Completely stiff and unable to bend. rigid rules that allow absolutely no exceptions, or a rigid personality that can't adapt to new situations",
      "bengali": "সম্পূর্ণ অনমনীয়. কোনো ব্যতিক্রম মানে না, নতুন পরিস্থিতিতে মানিয়ে নিতে পারে না"
    },
    "versatile": {
      "meaning": "Able to adapt to many different functions or activities. a versatile employee who can handle marketing, sales, and customer service equally well",
      "bengali": "বিভিন্ন কাজ বা কার্যকলাপে মানিয়ে নিতে সক্ষম"
    },
    "flexible": {
      "meaning": "Able to adapt and change according to circumstances. A flexible approach adjusts when conditions require it.",
      "bengali": "নমনীয়"
    },
    "pliant": {
      "meaning": "Easily bent or influenced. A pliant person yields to pressure and can be shaped by others' wishes.",
      "bengali": "নমনীয় ও প্রভাবিতযোগ্য"
    },
    "tractable": {
      "meaning": "Easy to control, manage, or deal with. A tractable problem can be solved without excessive difficulty.",
      "bengali": "সহজে নিয়ন্ত্রণযোগ্য"
    },
    "inflexible": {
      "meaning": "Rigid and unwilling to change or compromise. An inflexible position refuses to budge regardless of new information.",
      "bengali": "অনমনীয়"
    },
    "dogmatism": {
      "meaning": "The tendency to hold rigid beliefs without questioning them or considering alternatives. Dogmatic thinking rejects all challenge to its assumptions.",
      "bengali": "গোঁড়ামি"
    },
    "obstinacy": {
      "meaning": "Stubborn refusal to change one's opinion or course of action despite good reasons to do so. Obstinacy is stubbornness taken to an unreasonable extreme.",
      "bengali": "জিদ"
    },
    "bureaucratic": {
      "meaning": "Following rigid rules and procedures with excessive complexity. Bureaucratic systems prioritize process over results.",
      "bengali": "আমলাতান্ত্রিক"
    }
  },
  "Logic & Reasoning (যুক্তি ও তর্কশাস্ত্র)": {
    "analogous": {
      "meaning": "Similar in certain ways, allowing useful comparison. the heart is analogous to a pump: not identical, but similar enough to understand by comparing",
      "bengali": "নির্দিষ্ট দিক থেকে সাদৃশ্যপূর্ণ. হৃদয় পাম্পের সাথে তুলনাযোগ্য"
    },
    "axiomatic": {
      "meaning": "So obviously true that it doesn't need proof. it's axiomatic that 1+1=2, or that every effect has a cause",
      "bengali": "এত স্পষ্টভাবে সত্য যে প্রমাণের প্রয়োজন নেই. ১+১=২"
    },
    "conjecture": {
      "meaning": "A guess or theory based on incomplete information. at this point, the cause is pure conjecture because we have no solid evidence yet",
      "bengali": "অসম্পূর্ণ তথ্যের উপর ভিত্তি করে অনুমান. শক্ত প্রমাণ নেই"
    },
    "fallacious": {
      "meaning": "Based on a mistake in logic that makes the argument invalid. 'all cats have tails; my dog has a tail; therefore my dog is a cat' is fallacious",
      "bengali": "যুক্তির ভুলের উপর ভিত্তি করা যা যুক্তিকে অবৈধ করে"
    },
    "hypothetical": {
      "meaning": "Based on an imagined situation rather than reality. 'what would you do if you won the lottery?' is a hypothetical question",
      "bengali": "বাস্তব নয়, কাল্পনিক পরিস্থিতির উপর ভিত্তি করে"
    },
    "infer": {
      "meaning": "To reach a conclusion based on evidence and reasoning, even when it's not explicitly stated. I infer from your silence that you disagree",
      "bengali": "প্রমাণ ও যুক্তি থেকে সিদ্ধান্তে পৌঁছানো. স্পষ্টভাবে বলা না হলেও"
    },
    "postulate": {
      "meaning": "To suggest or assume something as a starting point for reasoning. scientists postulate theories and then test them with experiments",
      "bengali": "যুক্তির শুরুতে কিছু ধরে নেওয়া. বিজ্ঞানীরা তত্ত্ব ধরে নেয় তারপর পরীক্ষা করে"
    },
    "tenable": {
      "meaning": "An argument or position that can be defended with logic and evidence. 'the Earth is flat' is no longer a tenable position given modern evidence",
      "bengali": "যুক্তি ও প্রমাণ দিয়ে রক্ষা করা যায় এমন অবস্থান"
    },
    "tautological": {
      "meaning": "Saying the same thing twice in different words. 'a bachelor is an unmarried man' is tautological because bachelor already means unmarried",
      "bengali": "একই কথা ভিন্ন শব্দে দুবার বলা. অপ্রয়োজনীয় পুনরাবৃত্তি"
    }
  },
  "Wealth & Poverty (ধন ও দারিদ্র্য)": {
    "affluent": {
      "meaning": "Having a great deal of money and a high standard of living. an affluent neighborhood has big houses, nice cars, and expensive shops",
      "bengali": "প্রচুর অর্থ ও উচ্চ জীবনযাত্রার মান. বড় বাড়ি, দামি গাড়ি"
    },
    "destitute": {
      "meaning": "Completely without money, food, shelter, or basic necessities. destitute families who have literally nothing, not even a place to sleep",
      "bengali": "অর্থ, খাবার, আশ্রয়. একেবারে কিছুই নেই"
    },
    "impoverished": {
      "meaning": "Made poor, reduced to poverty. a once-wealthy family impoverished by war, or an impoverished nation drained of resources",
      "bengali": "দরিদ্র করা হয়েছে. একসময় ধনী পরিবার যুদ্ধে দরিদ্র হয়েছে"
    },
    "indigent": {
      "meaning": "Extremely poor, unable to afford basic needs. indigent defendants get free lawyers because they can't afford to pay for legal help",
      "bengali": "অত্যন্ত দরিদ্র, মৌলিক প্রয়োজন মেটাতে অক্ষম"
    },
    "lucrative": {
      "meaning": "Producing a lot of profit. a lucrative business makes excellent money; a lucrative deal brings in much more than expected",
      "bengali": "প্রচুর মুনাফা অর্জনকারী. প্রত্যাশার চেয়ে অনেক বেশি আয়"
    },
    "penurious": {
      "meaning": "Extremely poor, or extremely unwilling to spend money. can mean desperately poor OR stingy, depending on context",
      "bengali": "অত্যন্ত দরিদ্র, অথবা অত্যন্ত কৃপণ. প্রসঙ্গ অনুযায়ী অর্থ বদলায়"
    },
    "prosperous": {
      "meaning": "Successful and wealthy, doing well financially. a prosperous business is thriving, growing, and making good money",
      "bengali": "আর্থিকভাবে সফল ও সমৃদ্ধ. ব্যবসা ভালো চলছে ও বাড়ছে"
    }
  },
  "Art & Aesthetics (শিল্প ও নান্দনিকতা)": {
    "aesthetic": {
      "meaning": "Concerned with beauty and how things look. choosing a phone for aesthetic reasons means you care more about how it looks than its specs",
      "bengali": "সৌন্দর্য ও চেহারা সম্পর্কিত. স্পেকের চেয়ে দেখতে কেমন তা বেশি গুরুত্ব"
    },
    "embellish": {
      "meaning": "To add decorative details to make something more attractive. also means to exaggerate a story by adding untrue but entertaining details",
      "bengali": "সুন্দর করতে সাজসজ্জা যোগ করা. গল্পে মজার জন্য বাড়িয়ে বলাও বোঝায়"
    },
    "eclectic": {
      "meaning": "Drawing ideas, style, or taste from many different sources. an eclectic music taste means you enjoy jazz, hip-hop, classical, and K-pop equally",
      "bengali": "বিভিন্ন উৎস থেকে ধারণা ও রুচি সংগ্রহ. জ্যাজ, হিপহপ, ক্লাসিক্যাল সব পছন্দ"
    },
    "ornate": {
      "meaning": "Elaborately decorated with complex, detailed patterns. an ornate cathedral with golden ceilings, carved pillars, and stained glass everywhere",
      "bengali": "জটিল ও বিস্তারিত নকশায় অলংকৃত. সোনালি সিলিং ও রঙিন কাচের গির্জা"
    },
    "prosaic": {
      "meaning": "Dull, ordinary, and lacking imagination. a prosaic speech that puts everyone to sleep because it's so predictable and unoriginal",
      "bengali": "নিরস, সাধারণ ও কল্পনাশক্তিহীন. এত অনুমানযোগ্য যে সবাই ঘুমিয়ে পড়ে"
    },
    "sublime": {
      "meaning": "Of such outstanding quality that it inspires awe. a sublime sunset that stops you in your tracks, or sublime music that gives you chills",
      "bengali": "এত অসাধারণ মানের যে বিস্ময় জাগায়. শিহরণ জাগানো সঙ্গীত বা সূর্যাস্ত"
    }
  },
  "Praise & Admiration (প্রশংসা ও মুগ্ধতা)": {
    "adulation": {
      "meaning": "Excessive, over-the-top praise that goes beyond what someone truly deserves. When someone is showered with adulation, the flattery is so extreme it may be insincere or unhealthy.",
      "bengali": "অতিরিক্ত প্রশংসা"
    },
    "celebrate": {
      "meaning": "To publicly honor or praise someone or something for their achievements. In GRE contexts, it often means to acknowledge excellence with joy and recognition.",
      "bengali": "উদযাপন করা"
    },
    "encomium": {
      "meaning": "A formal, elevated speech or piece of writing that lavishly praises someone. Think of it as the kind of glowing tribute given at award ceremonies or in literary reviews.",
      "bengali": "আনুষ্ঠানিক প্রশংসা"
    },
    "eulogy": {
      "meaning": "A speech delivered at a funeral or memorial that praises the deceased person's life and character. It focuses on honoring someone who has passed away.",
      "bengali": "শ্রদ্ধাঞ্জলি বক্তৃতা"
    },
    "laudable": {
      "meaning": "Deserving praise and commendation. When something is laudable, it has genuine merit that people should recognize and appreciate.",
      "bengali": "প্রশংসনীয়"
    },
    "meritorious": {
      "meaning": "Deserving reward or praise because of genuine quality or achievement. It signals that the recognition was earned through real accomplishment.",
      "bengali": "যোগ্যতাসম্পন্ন"
    },
    "idolize": {
      "meaning": "To admire someone so excessively that you see them as perfect or godlike. It implies uncritical, blind worship that ignores flaws.",
      "bengali": "মূর্তিপূজা করা"
    },
    "approve": {
      "meaning": "To officially or personally agree with something or give it your support. It signals formal or informal endorsement of an idea, plan, or action.",
      "bengali": "অনুমোদন করা"
    },
    "endorse": {
      "meaning": "To publicly declare your support for something or someone. It carries more weight than simple approval because it involves putting your reputation behind something.",
      "bengali": "সমর্থন করা"
    },
    "remarkable": {
      "meaning": "So extraordinary or noteworthy that it deserves special attention. Something remarkable stands out from the ordinary and makes people take notice.",
      "bengali": "উল্লেখযোগ্য"
    },
    "notable": {
      "meaning": "Worthy of attention or recognition because of some distinguishing quality. It signals that something or someone stands above the rest.",
      "bengali": "উল্লেখযোগ্য"
    },
    "venerable": {
      "meaning": "Commanding deep respect because of age, wisdom, or long-established dignity. Often used for institutions, traditions, or elderly people who have earned reverence over time.",
      "bengali": "শ্রদ্ধেয়"
    },
    "reverent": {
      "meaning": "Showing deep, sincere respect and admiration. A reverent tone is solemn and careful, treating the subject with the seriousness it deserves.",
      "bengali": "শ্রদ্ধাশীল"
    },
    "dignified": {
      "meaning": "Behaving in a calm, composed, and respectable manner that earns others' respect. A dignified person maintains their poise even under pressure.",
      "bengali": "মর্যাদাপূর্ণ"
    }
  },
  "Disagreement & Opposition (মতভেদ ও বিরোধিতা)": {
    "antagonistic": {
      "meaning": "Actively hostile and opposed to someone or something. An antagonistic person is not just disagreeing. they are working against you.",
      "bengali": "বিরোধী"
    },
    "hostile": {
      "meaning": "Unfriendly and aggressive, showing clear opposition or dislike. Hostile behavior creates an atmosphere of threat and conflict.",
      "bengali": "শত্রুভাবাপন্ন"
    },
    "hostility": {
      "meaning": "Strong, active unfriendliness or opposition. Hostility is the sustained feeling behind hostile actions, a deep current of antagonism.",
      "bengali": "শত্রুতা"
    },
    "contradict": {
      "meaning": "To state the exact opposite of what someone else has said. Contradicting means directly denying or opposing a claim.",
      "bengali": "বিরোধিতা করা"
    },
    "controvert": {
      "meaning": "To argue against or dispute a claim. Controverting involves presenting evidence or reasoning to challenge an assertion.",
      "bengali": "খণ্ডন করা"
    },
    "rebut": {
      "meaning": "To formally argue against something, especially by presenting counter-evidence. A rebuttal is a structured, reasoned response to an opponent's argument.",
      "bengali": "খণ্ডন করা"
    },
    "contend": {
      "meaning": "To argue or assert something strongly. When someone contends a point, they are fighting for their position with conviction.",
      "bengali": "দাবি করা"
    },
    "divisive": {
      "meaning": "Causing strong disagreement that splits people into opposing camps. A divisive issue creates bitter, often irreconcilable divisions.",
      "bengali": "বিভেদমূলক"
    },
    "polarized": {
      "meaning": "Split into two sharply opposing extremes with nothing in the middle. A polarized debate has no middle ground, only fierce opposition.",
      "bengali": "মেরুকৃত"
    },
    "factional": {
      "meaning": "Divided into competing internal groups that fight each other. Factional conflict weakens organizations from within.",
      "bengali": "দলাদলিমূলক"
    },
    "fractious": {
      "meaning": "Irritable, unruly, and tending toward internal conflict. A fractious group is hard to manage because members constantly argue.",
      "bengali": "বিবাদপ্রিয়"
    },
    "polemical": {
      "meaning": "Strongly argumentative and aggressively one-sided in debate. Polemical writing attacks an opposing view with forceful rhetoric.",
      "bengali": "তর্কমূলক"
    },
    "eristic": {
      "meaning": "Argumentative purely for the sake of winning, not for finding truth. Eristic debate values victory over understanding.",
      "bengali": "তর্কপ্রিয়"
    },
    "deny": {
      "meaning": "To refuse to admit or accept something as true. Denial is the active rejection of a claim or accusation.",
      "bengali": "অস্বীকার করা"
    },
    "dismiss": {
      "meaning": "To reject something as unworthy of consideration. Dismissing shows you find something too unimportant to even argue against.",
      "bengali": "উড়িয়ে দেওয়া"
    },
    "discordant": {
      "meaning": "Conflicting and lacking harmony. Discordant elements clash with each other, creating tension and disunity.",
      "bengali": "অসামঞ্জস্যপূর্ণ"
    }
  },
  "Obstruction & Prevention (বাধা ও প্রতিরোধ)": {
    "hamper": {
      "meaning": "To slow down or make progress difficult by creating obstacles. Hampering does not stop something completely but makes it much harder.",
      "bengali": "বাধা দেওয়া"
    },
    "hinder": {
      "meaning": "To make it difficult for something to happen or progress. Hindering creates obstacles that impede without fully blocking.",
      "bengali": "বাধা সৃষ্টি করা"
    },
    "impede": {
      "meaning": "To slow down or block progress by placing obstacles in the way. Impeding creates barriers that must be overcome.",
      "bengali": "বাধা দেওয়া"
    },
    "inhibit": {
      "meaning": "To hold back or restrain a process or action from happening naturally. Inhibiting suppresses what would otherwise occur.",
      "bengali": "প্রতিরোধ করা"
    },
    "obstruct": {
      "meaning": "To actively block or prevent passage or progress. Obstructing is a deliberate act of creating barriers.",
      "bengali": "বাধা দেওয়া"
    },
    "thwart": {
      "meaning": "To successfully prevent someone from achieving their goal. Thwarting means you actively stopped their plan from working.",
      "bengali": "ব্যর্থ করা"
    },
    "forestall": {
      "meaning": "To prevent something from happening by taking action early. Forestalling is proactive. you act before the problem arrives.",
      "bengali": "আগেই প্রতিরোধ করা"
    },
    "preclude": {
      "meaning": "To make something impossible or prevent it from happening entirely. Precluding eliminates a possibility before it can even arise.",
      "bengali": "বারিত করা"
    },
    "avert": {
      "meaning": "To prevent a bad thing from happening. Also means to turn away. Averting disaster means successfully avoiding catastrophe.",
      "bengali": "প্রতিরোধ করা"
    },
    "stagnate": {
      "meaning": "To stop developing, growing, or making progress. Stagnation is the harmful absence of movement or improvement.",
      "bengali": "স্থবির হওয়া"
    },
    "impasse": {
      "meaning": "A situation where no progress is possible because opposing sides cannot agree. An impasse is a complete deadlock.",
      "bengali": "অচলাবস্থা"
    }
  },
  "Speech & Communication (বাক্ ও যোগাযোগ)": {
    "circumlocutory": {
      "meaning": "Using too many words and going around the point instead of stating it directly. Circumlocutory speech avoids getting to the point.",
      "bengali": "ঘুরিয়ে বলা"
    },
    "grandiloquent": {
      "meaning": "Using pompous, overly fancy language to impress people. Grandiloquent speech sounds impressive but is often empty of real substance.",
      "bengali": "আড়ম্বরপূর্ণ ভাষা"
    },
    "logorrhea": {
      "meaning": "Pathological, uncontrollable talkativeness. It describes speech that flows in an unstoppable torrent, far beyond what is necessary.",
      "bengali": "অতিরিক্ত বাচালতা"
    },
    "prolix": {
      "meaning": "Tediously wordy and long-winded. A prolix writer takes far too many words to say something that could be stated simply.",
      "bengali": "বাগাড়ম্বরপূর্ণ"
    },
    "voluble": {
      "meaning": "Speaking with easy, flowing abundance. A voluble person talks freely and at length, with words pouring out effortlessly.",
      "bengali": "বাকপটু"
    },
    "turgid": {
      "meaning": "Language that is overly complicated, bloated, and pretentious. Turgid prose is swollen with unnecessary complexity and pomposity.",
      "bengali": "স্ফীত ও আড়ম্বরপূর্ণ"
    },
    "florid": {
      "meaning": "Excessively elaborate and ornate in style. Florid writing is decorated with so many flourishes that the actual meaning gets lost.",
      "bengali": "অলঙ্কারবহুল"
    },
    "blunt": {
      "meaning": "Saying what you think without any attempt at tact or diplomacy. Blunt speech is honest but can be offensive because it lacks softening.",
      "bengali": "স্পষ্টভাষী"
    },
    "brusque": {
      "meaning": "Abrupt and unfriendly in manner, using few words and showing little patience. A brusque response makes you feel dismissed.",
      "bengali": "রূঢ় ও সংক্ষিপ্ত"
    },
    "curt": {
      "meaning": "Rudely brief and abrupt. A curt reply uses the fewest possible words and carries an edge of impatience or dismissiveness.",
      "bengali": "রূঢ়ভাবে সংক্ষিপ্ত"
    },
    "outspoken": {
      "meaning": "Willing to say what you think boldly and publicly, even if it is controversial. Outspoken people do not hold back their opinions.",
      "bengali": "স্পষ্টবক্তা"
    },
    "evasive": {
      "meaning": "Deliberately avoiding giving direct or clear answers. An evasive response dodges the question without technically lying.",
      "bengali": "এড়িয়ে যাওয়া"
    },
    "guarded": {
      "meaning": "Careful and cautious in speech, deliberately not revealing too much. A guarded response holds information back strategically.",
      "bengali": "সতর্ক"
    },
    "sonorous": {
      "meaning": "Having a deep, rich, resonant sound that is pleasing to hear. A sonorous voice fills a room with its commanding quality.",
      "bengali": "গম্ভীর ও সুরেলা"
    },
    "stentorian": {
      "meaning": "Extremely loud and powerful in sound, like a booming voice that can be heard across great distances.",
      "bengali": "অত্যন্ত উচ্চকণ্ঠ"
    },
    "mellifluous": {
      "meaning": "Sweet and smooth-sounding, like honey flowing. A mellifluous voice is so pleasant that it is a joy to listen to.",
      "bengali": "মধুর ও সুরেলা"
    },
    "pontificate": {
      "meaning": "To speak in a pompous, self-important way as if lecturing others from a position of unearned authority.",
      "bengali": "জ্ঞান দেওয়া"
    },
    "underscore": {
      "meaning": "To emphasize or draw special attention to something important. Underscoring highlights what the speaker considers most significant.",
      "bengali": "জোর দেওয়া"
    },
    "posit": {
      "meaning": "To put forward a statement or idea as a basis for discussion or argument. Positing is asserting something for the sake of reasoning.",
      "bengali": "স্থাপন করা"
    }
  },
  "Emotions - Positive (ইতিবাচক আবেগ)": {
    "ardent": {
      "meaning": "Intensely passionate and enthusiastic about something. An ardent supporter burns with conviction and emotional commitment.",
      "bengali": "উত্সাহী ও আবেগপূর্ণ"
    },
    "fervent": {
      "meaning": "Having intense, deeply felt passion or belief. Fervent devotion comes from the core of your being and cannot be faked.",
      "bengali": "তীব্রভাবে আবেগী"
    },
    "vehement": {
      "meaning": "Showing extremely strong feelings or forceful conviction. Vehement opposition is passionate, loud, and impossible to ignore.",
      "bengali": "প্রবল ও তীব্র"
    },
    "captivating": {
      "meaning": "So attractive and interesting that it holds your attention completely. Something captivating is impossible to look away from.",
      "bengali": "মুগ্ধকর"
    },
    "engaging": {
      "meaning": "Interesting and charming in a way that holds your attention and makes you want to keep participating.",
      "bengali": "আকর্ষণীয়"
    },
    "vivid": {
      "meaning": "Producing powerful, bright, and clear images in the mind. Vivid descriptions make you feel like you are there experiencing it yourself.",
      "bengali": "জীবন্ত ও উজ্জ্বল"
    },
    "auspicious": {
      "meaning": "Showing signs that something will be successful. An auspicious beginning gives you confidence that good things are ahead.",
      "bengali": "শুভ"
    },
    "propitious": {
      "meaning": "Indicating favorable conditions for success. When circumstances are propitious, the timing and environment support a positive outcome.",
      "bengali": "অনুকূল"
    },
    "awe": {
      "meaning": "A feeling of wonder and reverence, often mixed with a touch of fear, inspired by something grand or powerful.",
      "bengali": "বিস্ময়"
    },
    "nostalgic": {
      "meaning": "Feeling a bittersweet longing for the past. Nostalgia mixes warm memories with sadness that those times are gone.",
      "bengali": "স্মৃতিকাতর"
    }
  },
  "Emotions - Negative (নেতিবাচক আবেগ)": {
    "acrid": {
      "meaning": "Sharp, bitter, and irritating, often describing smells, tastes, or tones. An acrid remark burns with harsh unpleasantness.",
      "bengali": "তীক্ষ্ণ ও কটু"
    },
    "acrimony": {
      "meaning": "Deep bitterness and hostility between people. Acrimonious disputes are poisoned by personal resentment and anger.",
      "bengali": "তীব্র বিদ্বেষ"
    },
    "animus": {
      "meaning": "Strong hostility or ill will directed at someone. Animus is a deep-seated personal grudge, not a fleeting irritation.",
      "bengali": "বিদ্বেষ"
    },
    "antipathy": {
      "meaning": "A deep, instinctive dislike for something or someone. Antipathy comes from within. you cannot help feeling it.",
      "bengali": "বিরাগ"
    },
    "enmity": {
      "meaning": "The state of being a deep, active enemy. Enmity is mutual hostility that persists over time and defines relationships.",
      "bengali": "শত্রুতা"
    },
    "malice": {
      "meaning": "The desire to cause harm to another person. Malice is intentional cruelty. the person wants to see others suffer.",
      "bengali": "বিদ্বেষ ও ক্ষতির ইচ্ছা"
    },
    "foreboding": {
      "meaning": "A strong feeling that something bad is about to happen. Foreboding is an ominous sense of approaching trouble.",
      "bengali": "অশুভ পূর্বাভাস"
    },
    "ominous": {
      "meaning": "Giving signs that something bad or dangerous is coming. An ominous sky or an ominous warning fills you with dread.",
      "bengali": "অশুভ"
    },
    "overwrought": {
      "meaning": "Excessively emotional, to the point of being unable to think clearly. An overwrought reaction is disproportionate and strained.",
      "bengali": "অতিরিক্ত আবেগপ্রবণ"
    },
    "peevish": {
      "meaning": "Easily irritated and constantly complaining about small things. Peevish people are annoying because of their petty, habitual grumpiness.",
      "bengali": "খিটখিটে"
    },
    "querulous": {
      "meaning": "Constantly whining and complaining in a thin, unpleasant voice. Querulous people find fault with everything around them.",
      "bengali": "অভিযোগপ্রবণ"
    },
    "bristle": {
      "meaning": "To react with sudden anger or defensiveness, like an animal raising its bristles. The visible, immediate reaction shows you have been provoked.",
      "bengali": "রুষ্ট হওয়া"
    },
    "simmering": {
      "meaning": "Quietly building in intensity beneath the surface, like water about to boil. Simmering anger has not yet erupted but could at any moment.",
      "bengali": "ধীরে ধীরে বাড়ছে"
    },
    "elegiac": {
      "meaning": "Full of sadness and mourning, like a poem lamenting loss. An elegiac tone expresses poetic grief over something that is gone forever.",
      "bengali": "শোকসঙ্গীতের মতো"
    },
    "lugubrious": {
      "meaning": "Looking or sounding excessively sad or gloomy, often in an exaggerated or almost comical way.",
      "bengali": "অতিশয় বিষণ্ণ"
    },
    "mawkish": {
      "meaning": "Sentimental in a sickly, exaggerated way that provokes disgust rather than sympathy. Mawkish emotion is so overdone it becomes nauseating.",
      "bengali": "অতিভাবুক"
    }
  },
  "Generosity & Kindness (উদারতা ও দয়া)": {
    "beneficent": {
      "meaning": "Actively kind and charitable, doing good for others. A beneficent person goes out of their way to help and support.",
      "bengali": "পরোপকারী"
    },
    "beneficial": {
      "meaning": "Producing good results or helping to improve a situation. Something beneficial has a positive, helpful effect.",
      "bengali": "উপকারী"
    },
    "benign": {
      "meaning": "Gentle, kind, and causing no harm. A benign influence is harmless and possibly even positive. Also used medically for non-cancerous growths.",
      "bengali": "সৌম্য ও নিরীহ"
    },
    "largesse": {
      "meaning": "Notable, conspicuous generosity in giving money or gifts. Largesse implies grand, public acts of giving.",
      "bengali": "বদান্যতা"
    },
    "salubrious": {
      "meaning": "Good for your health and well-being. A salubrious climate or environment promotes physical and mental wellness.",
      "bengali": "স্বাস্থ্যকর"
    },
    "salutary": {
      "meaning": "Producing a beneficial, corrective effect, especially after something bad. A salutary lesson is painful but ultimately helpful.",
      "bengali": "হিতকর"
    }
  },
  "Greed & Selfishness (লোভ ও স্বার্থপরতা)": {
    "avarice": {
      "meaning": "Extreme, insatiable greed for wealth. Avarice goes beyond normal desire for money. it is an obsessive hunger that can never be satisfied.",
      "bengali": "চরম লোভ"
    },
    "avaricious": {
      "meaning": "Habitually greedy and constantly wanting more wealth. An avaricious person never has enough, no matter how much they accumulate.",
      "bengali": "লোভী"
    },
    "cupidity": {
      "meaning": "Intense greed for money or possessions. Cupidity drives people to prioritize wealth above all else, including morality.",
      "bengali": "ধনলোভ"
    },
    "mercenary": {
      "meaning": "Motivated purely by money, with no concern for principles or loyalty. A mercenary person will do anything if the price is right.",
      "bengali": "অর্থলোভী"
    },
    "miserliness": {
      "meaning": "Extreme, pathological unwillingness to spend money, even when you have plenty. A miser hoards wealth and suffers rather than part with a single coin.",
      "bengali": "চরম কৃপণতা"
    },
    "parsimony": {
      "meaning": "Excessive unwillingness to spend money. Parsimony goes beyond healthy frugality into stinginess that causes problems.",
      "bengali": "অত্যধিক মিতব্যয়িতা"
    },
    "stingy": {
      "meaning": "Habitually unwilling to give or spend money. A stingy person holds onto every penny and rarely shares willingly.",
      "bengali": "কৃপণ"
    },
    "impecunious": {
      "meaning": "Having very little money, poor. An impecunious student cannot afford basic expenses.",
      "bengali": "নিঃস্ব"
    }
  },
  "Old & Traditional (পুরাতন ও ঐতিহ্যবাহী)": {
    "atavistic": {
      "meaning": "Reverting to earlier, more primitive traits or behaviors. Atavistic impulses come from deep evolutionary past, bypassing civilized development.",
      "bengali": "আদিম প্রবৃত্তির"
    },
    "archetype": {
      "meaning": "The original model or standard example that others are based on. An archetype is the foundational template for a category.",
      "bengali": "আদিরূপ"
    }
  },
  "Moderation & Restraint (সংযম ও পরিমিতি)": {
    "equable": {
      "meaning": "Calm, even-tempered, and not easily disturbed. An equable personality stays steady through both good times and bad.",
      "bengali": "সমতাপূর্ণ"
    },
    "equanimity": {
      "meaning": "Mental calmness and composure, especially during stress. Equanimity is the inner steadiness that keeps you balanced when everything around you is chaotic.",
      "bengali": "সমচিত্ততা"
    },
    "placid": {
      "meaning": "Calm, peaceful, and undisturbed. A placid lake has no waves. A placid person shows no anxiety or agitation.",
      "bengali": "শান্ত ও প্রশান্ত"
    },
    "cautious": {
      "meaning": "Careful to avoid potential problems or dangers. A cautious approach takes time to assess risks before acting.",
      "bengali": "সতর্ক"
    },
    "deliberate": {
      "meaning": "Done carefully and intentionally after thorough consideration. A deliberate decision is the opposite of impulsive. every aspect has been thought through.",
      "bengali": "ইচ্ছাকৃত ও সুচিন্তিত"
    },
    "spare": {
      "meaning": "Simple and minimal, using only what is necessary with elegant economy. Spare writing says much with few words.",
      "bengali": "সংক্ষিপ্ত ও মিতব্যয়ী"
    },
    "qualified": {
      "meaning": "Limited or modified with conditions rather than being absolute. A qualified statement hedges its claims with reservations.",
      "bengali": "শর্তসাপেক্ষ"
    },
    "placatory": {
      "meaning": "Intended to calm someone's anger or make peace. A placatory gesture tries to smooth over conflict.",
      "bengali": "তোষণমূলক"
    },
    "anodyne": {
      "meaning": "Deliberately inoffensive and unlikely to upset anyone. Something anodyne is so safe and soothing that it avoids all controversy.",
      "bengali": "প্রশান্তিদায়ক"
    }
  },
  "Excess & Extravagance (অতিরিক্ত ও বাহুল্য)": {
    "fawning": {
      "meaning": "Showing excessive, insincere flattery to gain favor. A fawning person is servile and obsequious, praising shamelessly to win approval.",
      "bengali": "তোষামোদকারী"
    },
    "impetuous": {
      "meaning": "Acting quickly without thinking about consequences. An impetuous decision is rash and driven by emotion rather than reason.",
      "bengali": "আবেগপ্রবণ"
    },
    "incendiary": {
      "meaning": "Deliberately designed to provoke anger, outrage, or violence. Incendiary rhetoric is like throwing a match on gasoline.",
      "bengali": "উত্তেজনাসৃষ্টিকারী"
    },
    "strident": {
      "meaning": "Loud, harsh, and aggressively forceful. Strident demands grate on the ears and push others away rather than persuading them.",
      "bengali": "তীক্ষ্ণ ও কর্কশ"
    }
  },
  "Unoriginality & Dullness (অমৌলিকতা ও নীরসতা)": {
    "banal": {
      "meaning": "So overused and unoriginal that it is boring. A banal remark has been said so many times it no longer carries any meaning.",
      "bengali": "সাধারণ ও নীরস"
    },
    "clichéd": {
      "meaning": "Using expressions or ideas that have been used so many times they have lost all impact. Cliched writing feels lazy and uninspired.",
      "bengali": "জীর্ণ ও পুনরাবৃত্ত"
    },
    "hackneyed": {
      "meaning": "Made unoriginal through excessive repetition. A hackneyed phrase was once clever but has been used so much it means nothing anymore.",
      "bengali": "বহু ব্যবহারে জীর্ণ"
    },
    "trite": {
      "meaning": "Unoriginal and dull from overuse. Trite observations lack freshness because they have been made countless times before.",
      "bengali": "পুরানো ও বিরক্তিকর"
    },
    "platitudinous": {
      "meaning": "Full of empty, unoriginal moral statements that sound wise but say nothing new. Platitudinous advice is hollow and unhelpful.",
      "bengali": "গতানুগতিক উপদেশপূর্ণ"
    },
    "pedestrian": {
      "meaning": "Dull, ordinary, and uninspired. Pedestrian writing lacks any spark of creativity or insight. It is mediocre in every way.",
      "bengali": "সাধারণ ও নিরুত্তেজ"
    },
    "mundane": {
      "meaning": "Ordinary, everyday, and lacking excitement. Mundane tasks are the boring routines of daily life.",
      "bengali": "জাগতিক ও সাধারণ"
    },
    "derivative": {
      "meaning": "Copied or adapted from someone else's work without originality. Derivative art imitates rather than innovates.",
      "bengali": "অনুকরণজাত"
    },
    "imitative": {
      "meaning": "Copying the style or work of others rather than creating something new. Imitative work shows no independent creative vision.",
      "bengali": "অনুকরণমূলক"
    },
    "stereotypical": {
      "meaning": "Following a fixed, oversimplified pattern without individual character. Stereotypical portrayals lack depth and complexity.",
      "bengali": "গতানুগতিক"
    },
    "formulaic": {
      "meaning": "Following a predictable formula or pattern without creative variation. Formulaic work feels mechanical and uninspired.",
      "bengali": "ছকবাঁধা"
    },
    "insipid": {
      "meaning": "Completely lacking in flavor, interest, or excitement. Insipid food has no taste. Insipid conversation has no spark.",
      "bengali": "নীরস ও স্বাদহীন"
    },
    "vapid": {
      "meaning": "Offering nothing stimulating or challenging. Vapid conversation is empty of any intellectual content or emotional depth.",
      "bengali": "নির্জীব ও খালি"
    },
    "lackluster": {
      "meaning": "Lacking energy, enthusiasm, or brightness. A lackluster performance disappoints because it fails to shine.",
      "bengali": "নিষ্প্রভ"
    },
    "jejune": {
      "meaning": "Dull, simplistic, and showing intellectual immaturity. Jejune thinking has not developed beyond a basic, shallow level.",
      "bengali": "অপরিণত ও নীরস"
    },
    "soporific": {
      "meaning": "So boring or monotonous that it puts you to sleep. A soporific lecture makes everyone's eyelids droop.",
      "bengali": "ঘুম-উদ্রেককারী"
    },
    "contrived": {
      "meaning": "Artificial and forced, lacking natural quality. A contrived plot feels obviously manufactured rather than organic.",
      "bengali": "কৃত্রিম"
    },
    "stilted": {
      "meaning": "Stiff, unnatural, and awkwardly formal. Stilted dialogue sounds like no real person would ever actually speak that way.",
      "bengali": "কৃত্রিম ও জড়"
    },
    "fatuous": {
      "meaning": "Silly, pointless, and showing a complete lack of intelligence. A fatuous remark is so foolish it barely deserves a response.",
      "bengali": "নির্বোধ"
    }
  },
  "Humor & Wit (রসবোধ ও বুদ্ধিদীপ্ততা)": {
    "bantering": {
      "meaning": "Engaging in playful, lighthearted teasing and joking. Banter is friendly verbal sparring that entertains both sides.",
      "bengali": "রঙ্গরসিকতা"
    },
    "facetious": {
      "meaning": "Trying to be funny at an inappropriate time or about a serious topic. Facetious comments show poor judgment about when humor is welcome.",
      "bengali": "অসময়ে রসিকতা"
    },
    "ironic": {
      "meaning": "Involving an unexpected contrast between what appears to be and what actually is. Irony highlights the gap between expectation and reality.",
      "bengali": "বিদ্রূপাত্মক"
    },
    "satirical": {
      "meaning": "Using humor, irony, and exaggeration to criticize and expose the flaws of people, institutions, or society.",
      "bengali": "ব্যঙ্গাত্মক"
    },
    "wry": {
      "meaning": "Having a dry, understated, slightly twisted sense of humor. Wry wit is quiet and subtle, with an ironic edge.",
      "bengali": "বাঁকা রসবোধ"
    },
    "droll": {
      "meaning": "Oddly funny in a quiet, unexpected way. Droll humor catches you off guard with its quirky, deadpan quality.",
      "bengali": "বিচিত্র রসবোধ"
    },
    "flippant": {
      "meaning": "Not showing proper respect or seriousness about something that deserves it. Flippant comments trivialize important matters.",
      "bengali": "অসম্মানজনকভাবে হালকা"
    },
    "quirky": {
      "meaning": "Unusual in an interesting, endearing way. Something quirky is charmingly odd and unconventional.",
      "bengali": "অদ্ভুত ও মজার"
    }
  },
  "Evaluation & Judgment (মূল্যায়ন ও বিচার)": {
    "appraise": {
      "meaning": "To carefully evaluate the worth, quality, or significance of something. Appraising involves systematic, professional assessment.",
      "bengali": "মূল্যায়ন করা"
    },
    "assess": {
      "meaning": "To evaluate or judge the quality, importance, or condition of something through careful analysis.",
      "bengali": "নিরূপণ করা"
    },
    "evaluate": {
      "meaning": "To systematically judge the merit, value, or significance of something based on criteria or evidence.",
      "bengali": "মূল্যায়ন করা"
    },
    "critical": {
      "meaning": "Involving careful, analytical evaluation. Also means extremely important. A critical analysis examines something with rigorous scrutiny.",
      "bengali": "সমালোচনামূলক / গুরুত্বপূর্ণ"
    },
    "rigorous": {
      "meaning": "Extremely thorough, exact, and demanding in standards. Rigorous analysis leaves nothing unexamined and accepts no shortcuts.",
      "bengali": "কঠোর ও নিখুঁত"
    },
    "thorough": {
      "meaning": "Complete in every respect, leaving nothing overlooked. A thorough investigation examines every possible detail.",
      "bengali": "সম্পূর্ণ ও পুঙ্খানুপুঙ্খ"
    },
    "methodical": {
      "meaning": "Done in a systematic, organized, step-by-step way. A methodical approach ensures nothing is missed through careful planning.",
      "bengali": "পদ্ধতিগত"
    },
    "systematic": {
      "meaning": "Following an organized, structured approach with clear steps and procedures. Systematic work reduces chaos and ensures completeness.",
      "bengali": "সুশৃঙ্খল"
    },
    "cursory": {
      "meaning": "Done quickly with insufficient attention to detail. A cursory glance misses important things because it does not look closely enough.",
      "bengali": "ভাসা ভাসা"
    },
    "perfunctory": {
      "meaning": "Done with minimal effort, just going through the motions. A perfunctory handshake or inspection shows no real interest or care.",
      "bengali": "যান্ত্রিক ও অমনোযোগী"
    },
    "slapdash": {
      "meaning": "Done carelessly and in a rush, with no attention to quality. Slapdash work is visibly sloppy and unfinished.",
      "bengali": "তাড়াহুড়ো ও অযত্নে করা"
    },
    "careless": {
      "meaning": "Not giving sufficient attention or care to what you are doing, leading to mistakes or poor results.",
      "bengali": "অসাবধান"
    },
    "negligent": {
      "meaning": "Failing to give proper care or attention to responsibilities. Negligence implies a duty of care that was not met.",
      "bengali": "অবহেলাকারী"
    },
    "lax": {
      "meaning": "Not strict or careful enough in enforcing rules or standards. Lax oversight allows problems to develop unchecked.",
      "bengali": "শিথিল"
    },
    "decisive": {
      "meaning": "Firm, clear, and conclusive in making decisions. A decisive leader acts quickly and confidently without wavering.",
      "bengali": "সুনিশ্চিত"
    },
    "categorical": {
      "meaning": "Absolute and without any qualification, exception, or doubt. A categorical statement leaves no room for ambiguity.",
      "bengali": "নিঃশর্ত"
    },
    "unequivocal": {
      "meaning": "Completely clear with absolutely no possibility of misunderstanding. An unequivocal answer is definitive and leaves no doubt.",
      "bengali": "দ্ব্যর্থহীন"
    },
    "apodictic": {
      "meaning": "Unquestionably true and certain, established by logical necessity. Apodictic claims have the force of absolute logical proof.",
      "bengali": "অকাট্য"
    },
    "incontrovertible": {
      "meaning": "Impossible to deny or dispute because the evidence is so overwhelming. Incontrovertible proof silences all opposition.",
      "bengali": "অকাট্য"
    },
    "probative": {
      "meaning": "Having the quality of providing proof or evidence. Probative value indicates how useful something is in establishing truth.",
      "bengali": "প্রমাণমূলক"
    },
    "biased": {
      "meaning": "Unfairly favoring one side over another. A biased judgment is distorted by personal prejudice rather than based on facts.",
      "bengali": "পক্ষপাতদুষ্ট"
    },
    "partisan": {
      "meaning": "Strongly loyal to one side or party, often at the expense of fairness. A partisan analysis favors its side and ignores opposing evidence.",
      "bengali": "পক্ষপাতী"
    },
    "tendentious": {
      "meaning": "Promoting a particular viewpoint or agenda, often in a way that is not fair or balanced.",
      "bengali": "একপেশে"
    },
    "unfair": {
      "meaning": "Not based on or acting on principles of equality and justice. Unfair treatment violates the basic expectation of equal consideration.",
      "bengali": "অন্যায়"
    }
  },
  "Strength & Weakness (শক্তি ও দুর্বলতা)": {
    "compelling": {
      "meaning": "So convincing or interesting that it is impossible to resist. A compelling argument overwhelms objections with its persuasive force.",
      "bengali": "অনস্বীকার্য"
    },
    "impeccable": {
      "meaning": "Absolutely flawless, without any mistakes or defects. Impeccable manners or impeccable logic cannot be faulted in any way.",
      "bengali": "নিখুঁত"
    },
    "sound": {
      "meaning": "Based on valid reasoning, in good condition, and reliable. A sound argument is logically correct. A sound structure is solid.",
      "bengali": "দৃঢ় ও নির্ভরযোগ্য"
    },
    "viable": {
      "meaning": "Capable of working successfully and being put into practice. A viable plan has realistic chances of succeeding.",
      "bengali": "কার্যকর"
    },
    "feasible": {
      "meaning": "Possible and practical to accomplish. Something feasible can actually be done with the available resources and constraints.",
      "bengali": "সম্ভব"
    },
    "defective": {
      "meaning": "Having a flaw or fault that prevents it from working correctly. Something defective is broken or inadequate.",
      "bengali": "ত্রুটিপূর্ণ"
    },
    "flawed": {
      "meaning": "Having significant imperfections or errors. A flawed argument has weaknesses that undermine its conclusion.",
      "bengali": "ত্রুটিযুক্ত"
    },
    "fragile": {
      "meaning": "Easily broken or damaged, requiring careful handling. A fragile peace could shatter at any moment.",
      "bengali": "ভঙ্গুর"
    },
    "vulnerable": {
      "meaning": "Open to attack, harm, or damage. Being vulnerable means lacking the protection needed to stay safe.",
      "bengali": "অরক্ষিত"
    },
    "precarious": {
      "meaning": "Dangerously unstable and likely to collapse. A precarious situation could go wrong at any moment.",
      "bengali": "অনিশ্চিত ও বিপদজনক"
    },
    "weak": {
      "meaning": "Lacking strength, force, or conviction. A weak argument has insufficient evidence. A weak response fails to address the issue.",
      "bengali": "দুর্বল"
    },
    "insubstantial": {
      "meaning": "Lacking real strength, solidity, or substance. An insubstantial claim has no firm basis to stand on.",
      "bengali": "অসারবস্তু"
    },
    "relentless": {
      "meaning": "Continuing with intense, unyielding pressure that never lets up. Relentless pursuit or criticism wears down all opposition.",
      "bengali": "নিরলস"
    },
    "inexorable": {
      "meaning": "Impossible to stop or prevent. An inexorable force moves forward regardless of any attempt to block it.",
      "bengali": "অপ্রতিরোধ্য"
    },
    "implacable": {
      "meaning": "Impossible to appease or satisfy. An implacable enemy will never forgive, never forget, and never stop opposing you.",
      "bengali": "অপ্রশমনীয়"
    },
    "intrepid": {
      "meaning": "Fearlessly brave in the face of danger. An intrepid explorer faces unknown risks with unwavering courage.",
      "bengali": "নির্ভীক"
    },
    "efficacious": {
      "meaning": "Effective at producing the desired result. Something efficacious actually works and delivers the intended outcome.",
      "bengali": "কার্যকর"
    },
    "ineffective": {
      "meaning": "Not producing the desired results, failing to achieve what was intended. An ineffective strategy wastes time and resources.",
      "bengali": "অকার্যকর"
    }
  },
  "Time & Duration (সময় ও কাল)": {
    "abrupt": {
      "meaning": "Happening suddenly without warning, or being blunt and terse in manner. An abrupt change catches everyone off guard.",
      "bengali": "আকস্মিক"
    },
    "dilatory": {
      "meaning": "Intentionally slow and causing delay. Dilatory tactics are used to buy time or stall progress on purpose.",
      "bengali": "বিলম্বকারী"
    },
    "expedite": {
      "meaning": "To speed up a process and make it happen faster. Expediting removes obstacles to accelerate completion.",
      "bengali": "ত্বরান্বিত করা"
    },
    "hasten": {
      "meaning": "To move or cause something to happen more quickly. Hastening pushes things toward their conclusion faster.",
      "bengali": "তাড়াতাড়ি করা"
    },
    "protract": {
      "meaning": "To prolong or extend something unnecessarily. A protracted conflict drags on far longer than it should.",
      "bengali": "দীর্ঘায়িত করা"
    },
    "intermittent": {
      "meaning": "Starting and stopping at irregular intervals, not continuous. Intermittent rain comes and goes unpredictably.",
      "bengali": "বিরতিপূর্ণ"
    },
    "exigent": {
      "meaning": "Demanding immediate attention and action because of urgency. An exigent situation cannot wait.",
      "bengali": "জরুরি"
    },
    "imperative": {
      "meaning": "Absolutely necessary and non-negotiable. When something is imperative, it must be done without delay or question.",
      "bengali": "অত্যাবশ্যক"
    },
    "pivotal": {
      "meaning": "Critically important because everything else depends on it. A pivotal moment is the turning point that determines what follows.",
      "bengali": "মুখ্য ও নির্ণায়ক"
    },
    "consequential": {
      "meaning": "Having significant importance and far-reaching impact. A consequential decision affects many people and situations beyond its immediate scope.",
      "bengali": "গুরুত্বপূর্ণ"
    },
    "inconsequential": {
      "meaning": "Too small or unimportant to matter. Something inconsequential has negligible impact and can be safely ignored.",
      "bengali": "গুরুত্বহীন"
    },
    "negligible": {
      "meaning": "So small or unimportant that it is not worth considering. A negligible difference makes no practical impact.",
      "bengali": "নগণ্য"
    },
    "peripheral": {
      "meaning": "Not central or important to the main issue. Peripheral matters are secondary concerns that exist at the edges.",
      "bengali": "প্রান্তিক"
    },
    "ancillary": {
      "meaning": "Supporting and supplementary, not the main thing. Ancillary services help the primary function but are subordinate to it.",
      "bengali": "সহায়ক"
    },
    "token": {
      "meaning": "Symbolic rather than substantial, done for appearance rather than real effect. A token gesture looks nice but does not actually change anything.",
      "bengali": "নামমাত্র"
    }
  },
  "Logic & Reasoning (যুক্তি ও তর্ক)": {
    "illogical": {
      "meaning": "Not following the rules of logical reasoning. An illogical argument makes leaps that do not follow from the evidence.",
      "bengali": "অযৌক্তিক"
    },
    "correlative": {
      "meaning": "Having a mutual or reciprocal relationship where two things vary together. Correlative does not mean causal. it means associated.",
      "bengali": "পারস্পরিক সম্পর্কযুক্ত"
    },
    "contingent": {
      "meaning": "Dependent on certain conditions being met. A contingent outcome only happens if specific requirements are fulfilled first.",
      "bengali": "শর্তসাপেক্ষ"
    },
    "extrapolate": {
      "meaning": "To extend known data or facts to draw conclusions about unknown situations. Extrapolating projects from what is known to what might be.",
      "bengali": "অনুমান করা"
    },
    "presuppose": {
      "meaning": "To assume something is true before proving it, often as a hidden foundation for an argument. Every argument presupposes certain things it does not state.",
      "bengali": "পূর্বধারণা করা"
    },
    "dichotomy": {
      "meaning": "A sharp division into two mutually exclusive categories. A false dichotomy forces a choice between only two options when more exist.",
      "bengali": "দ্বিবিভাজন"
    },
    "dialectical": {
      "meaning": "Involving the productive tension between opposing ideas, where thesis and antithesis combine to form synthesis.",
      "bengali": "দ্বান্দ্বিক"
    },
    "reductionist": {
      "meaning": "Oversimplifying complex phenomena by breaking them down to their simplest components. Reductionism can miss the bigger picture.",
      "bengali": "সরলীকরণবাদী"
    },
    "reify": {
      "meaning": "To treat an abstract concept as if it were a concrete, real thing. Reifying an idea gives it false material existence.",
      "bengali": "বাস্তব বস্তু হিসেবে দেখা"
    },
    "epiphenomenal": {
      "meaning": "Being a secondary byproduct rather than a fundamental cause. An epiphenomenal effect happens alongside but does not drive the real process.",
      "bengali": "উপঘটনাগত"
    }
  },
  "Political & Governance Systems (রাজনৈতিক ও শাসন ব্যবস্থা)": {
    "democratic": {
      "meaning": "Based on principles of equality and majority rule, where citizens participate in governance decisions.",
      "bengali": "গণতান্ত্রিক"
    },
    "oligarchic": {
      "meaning": "Ruled by a small, powerful elite group. In an oligarchic system, a handful of people control everything.",
      "bengali": "অভিজাততান্ত্রিক"
    },
    "hegemonic": {
      "meaning": "Exercising dominant control or influence over others, especially one country or group dominating others culturally or politically.",
      "bengali": "আধিপত্যবাদী"
    },
    "feudal": {
      "meaning": "Based on the medieval system where land-owning lords had authority over peasants. Feudal structures are rigidly hierarchical.",
      "bengali": "সামন্ততান্ত্রিক"
    },
    "hierarchical": {
      "meaning": "Arranged in a system of ranks with clear levels of authority from top to bottom.",
      "bengali": "শ্রেণিবদ্ধ"
    },
    "patrimonial": {
      "meaning": "Based on inherited or personalized power rather than institutional rules. Patrimonial rule treats the state as personal property.",
      "bengali": "পৈতৃক শাসনের"
    },
    "kleptocratic": {
      "meaning": "A government where rulers steal from the country for personal gain. Kleptocracy is rule by thieves at the highest level.",
      "bengali": "চোরতন্ত্র"
    },
    "dirigiste": {
      "meaning": "Describing a state that exercises strong control over the economy. Dirigiste policies involve heavy government direction of economic activity.",
      "bengali": "রাষ্ট্র-নিয়ন্ত্রিত অর্থনীতি"
    },
    "mercantilist": {
      "meaning": "Favoring government control of trade to accumulate national wealth. Mercantilist policies restrict imports and promote exports.",
      "bengali": "বণিকবাদী"
    },
    "autarkic": {
      "meaning": "Economically self-sufficient, not depending on trade with other nations. An autarkic state produces everything it needs domestically.",
      "bengali": "স্বনির্ভর"
    },
    "clientelist": {
      "meaning": "Based on a political system where support is exchanged for personal favors. Clientelism is patronage-driven politics.",
      "bengali": "পৃষ্ঠপোষকতা-ভিত্তিক"
    },
    "pluralistic": {
      "meaning": "A system where multiple groups, opinions, and interests coexist and share power. Pluralism celebrates diversity of perspectives.",
      "bengali": "বহুত্ববাদী"
    },
    "sectarian": {
      "meaning": "Narrowly devoted to a particular religious or political group, often creating division. Sectarian conflict pits factions against each other.",
      "bengali": "সাম্প্রদায়িক"
    },
    "seditious": {
      "meaning": "Encouraging rebellion or resistance against established authority. Seditious speech tries to incite people to overthrow their government.",
      "bengali": "রাষ্ট্রদ্রোহমূলক"
    },
    "subversive": {
      "meaning": "Seeking to undermine or overthrow an established system from within. Subversive activity works covertly to weaken authority.",
      "bengali": "বিপর্যয়কারী"
    },
    "subvert": {
      "meaning": "To actively undermine or overthrow an established system, authority, or institution. Subverting is the act of dismantling from within.",
      "bengali": "উৎখাত করা"
    },
    "enfranchise": {
      "meaning": "To give someone the right to vote or other political rights. Enfranchising expands who gets to participate in democracy.",
      "bengali": "ভোটাধিকার দেওয়া"
    },
    "disenfranchise": {
      "meaning": "To take away someone's right to vote or other fundamental rights. Disenfranchising silences people's political voice.",
      "bengali": "ভোটাধিকার হরণ করা"
    },
    "irredentist": {
      "meaning": "Advocating for the return of territory that was once part of your nation. Irredentist movements claim lands based on historical ownership.",
      "bengali": "হারানো ভূমি পুনরুদ্ধারবাদী"
    },
    "détente": {
      "meaning": "The easing of hostility and tension between countries, especially during the Cold War. Detente is a diplomatic thaw.",
      "bengali": "উত্তেজনা প্রশমন"
    },
    "rapprochement": {
      "meaning": "The restoration or establishment of friendly relations between countries or groups after a period of hostility.",
      "bengali": "সম্পর্ক পুনঃস্থাপন"
    },
    "interregnum": {
      "meaning": "A gap or pause between two periods of rule or governance. During an interregnum, there is a power vacuum with no clear leader.",
      "bengali": "শাসনের অন্তর্বর্তী সময়"
    },
    "capitulate": {
      "meaning": "To surrender completely after a period of resistance. Capitulating means giving up entirely and accepting the other side's terms.",
      "bengali": "আত্মসমর্পণ করা"
    },
    "sanction": {
      "meaning": "Has two opposite meanings depending on context: to officially approve something, OR to impose penalties. Context determines which meaning applies.",
      "bengali": "অনুমোদন / নিষেধাজ্ঞা"
    },
    "condone": {
      "meaning": "To accept or allow behavior that is generally considered wrong. Condoning sends a message that wrongdoing is tolerable.",
      "bengali": "উপেক্ষা করে মেনে নেওয়া"
    }
  },
  "Academic & Intellectual Concepts (একাডেমিক ও বুদ্ধিবৃত্তিক ধারণা)": {
    "epistemology": {
      "meaning": "The branch of philosophy that studies knowledge itself. how we know what we know, what counts as knowledge, and what its limits are.",
      "bengali": "জ্ঞানতত্ত্ব"
    },
    "ontology": {
      "meaning": "The branch of philosophy that studies the nature of existence and being. Ontology asks what things truly exist and how they relate.",
      "bengali": "অস্তিত্ববিদ্যা"
    },
    "teleological": {
      "meaning": "Explaining things by their purpose or end goal rather than their cause. Teleological thinking asks 'what is this for?' rather than 'what caused this?'",
      "bengali": "উদ্দেশ্যবাদী"
    },
    "hermeneutic": {
      "meaning": "Related to the theory and method of interpreting texts, especially religious or literary ones. Hermeneutics is the science of understanding meaning.",
      "bengali": "ব্যাখ্যাতত্ত্ব সম্পর্কিত"
    },
    "exegetical": {
      "meaning": "Involving the scholarly interpretation and explanation of a text, especially sacred writings. Exegesis carefully unpacks what the author intended.",
      "bengali": "গ্রন্থ ব্যাখ্যামূলক"
    },
    "taxonomy": {
      "meaning": "A system for classifying and organizing things into categories based on shared characteristics. Taxonomy brings order to complexity.",
      "bengali": "শ্রেণিবিন্যাস"
    },
    "stochastic": {
      "meaning": "Involving randomness and probability rather than fixed, predictable outcomes. Stochastic models account for uncertainty and chance.",
      "bengali": "সম্ভাব্যতামূলক"
    },
    "syncretic": {
      "meaning": "Combining different religious, cultural, or philosophical traditions into a unified whole. Syncretism blends elements from multiple sources.",
      "bengali": "সমন্বয়বাদী"
    },
    "heterodox": {
      "meaning": "Going against established, accepted beliefs or doctrines. Heterodox views challenge the orthodox mainstream.",
      "bengali": "বিধর্মী"
    },
    "iconoclastic": {
      "meaning": "Deliberately attacking and breaking down cherished traditional beliefs or institutions. An iconoclast enjoys smashing sacred cows.",
      "bengali": "প্রতিমা-ভঙ্গকারী"
    },
    "unorthodox": {
      "meaning": "Not following conventional or traditional methods. Unorthodox approaches break from standard practice, sometimes effectively.",
      "bengali": "অপ্রচলিত"
    },
    "allusions": {
      "meaning": "Indirect references to other works, events, or ideas without explicitly naming them. Allusions enrich text by connecting to shared knowledge.",
      "bengali": "পরোক্ষ উল্লেখ"
    },
    "digression": {
      "meaning": "A temporary departure from the main topic of discussion. A digression takes you off on a tangent before returning to the main point.",
      "bengali": "বিষয়ান্তর"
    },
    "tangential": {
      "meaning": "Only slightly relevant to the main subject, touching it briefly before going in a different direction.",
      "bengali": "প্রান্তিক ও অপ্রাসঙ্গিক"
    },
    "embellishment": {
      "meaning": "Extra details added to make something more decorative or interesting. Embellishments are additions beyond the core content.",
      "bengali": "অলঙ্করণ"
    },
    "doggerel": {
      "meaning": "Poorly written poetry that is clumsy and technically bad. Doggerel might rhyme, but it lacks artistry and skill.",
      "bengali": "নিম্নমানের কবিতা"
    },
    "applied": {
      "meaning": "Practical and concerned with real-world use rather than pure theory. Applied science solves actual problems.",
      "bengali": "ব্যবহারিক"
    },
    "rudimentary": {
      "meaning": "At the most basic, primitive level of development. Rudimentary knowledge covers only the fundamentals, nothing advanced.",
      "bengali": "প্রাথমিক"
    },
    "sophisticated": {
      "meaning": "Highly developed, complex, and showing refined understanding. Sophisticated thinking handles nuance and complexity with ease.",
      "bengali": "পরিশীলিত"
    }
  },
  "Indifference & Apathy (উদাসীনতা ও নিরাসক্তি)": {
    "tepid": {
      "meaning": "Showing little enthusiasm or warmth. A tepid response is lukewarm and underwhelming, neither hot nor cold.",
      "bengali": "কুসুম গরম / উদাসীন"
    },
    "frivolous": {
      "meaning": "Not serious or sensible, treating important things as if they do not matter. Frivolous behavior wastes time on trivialities.",
      "bengali": "ফালতু"
    },
    "futile": {
      "meaning": "Completely useless, incapable of producing any result. A futile effort is doomed to failure no matter how hard you try.",
      "bengali": "নিষ্ফল"
    },
    "inadvertent": {
      "meaning": "Happening by accident or without intention. An inadvertent mistake was not planned. it simply slipped through due to inattention.",
      "bengali": "অনিচ্ছাকৃত"
    },
    "irreverent": {
      "meaning": "Showing a lack of respect for things that are usually treated seriously. Irreverent humor pokes fun at sacred or official matters.",
      "bengali": "অসম্মানকারী"
    }
  },
  "Useful Action Words (কার্যকরী ক্রিয়াপদ)": {
    "defend": {
      "meaning": "To protect from attack or harm, or to argue in support of something. Defending can be physical protection or intellectual advocacy.",
      "bengali": "রক্ষা করা"
    },
    "incite": {
      "meaning": "To deliberately stir people up to take action, usually violent or hostile. Inciting is intentional provocation.",
      "bengali": "উস্কানি দেওয়া"
    },
    "instigate": {
      "meaning": "To start or initiate something, usually trouble or conflict. Instigating sets events in motion, often with negative consequences.",
      "bengali": "প্ররোচিত করা"
    },
    "provoke": {
      "meaning": "To deliberately cause a reaction, especially anger. Provoking pushes someone's buttons intentionally.",
      "bengali": "উত্তেজিত করা"
    },
    "tarnished": {
      "meaning": "Damaged in reputation or quality, losing the shine and respect it once had. A tarnished legacy has been stained.",
      "bengali": "কলঙ্কিত"
    }
  },
  "Characteristics & Qualities (বৈশিষ্ট্য ও গুণাবলী)": {
    "burdensome": {
      "meaning": "Difficult to carry or deal with, placing heavy demands on someone. A burdensome task drains energy and resources.",
      "bengali": "ভারসাধ্য"
    },
    "onerous": {
      "meaning": "Involving an oppressive amount of effort or difficulty. Onerous responsibilities weigh heavily and make life harder.",
      "bengali": "কষ্টকর"
    },
    "exacting": {
      "meaning": "Demanding extremely high standards of accuracy, skill, or effort. An exacting teacher accepts nothing less than perfection.",
      "bengali": "কঠোর মানদণ্ডের"
    },
    "felicitous": {
      "meaning": "Perfectly suited to the occasion, pleasingly apt and well-chosen. A felicitous phrase hits exactly the right note at the right time.",
      "bengali": "যথোপযুক্ত"
    },
    "incongruous": {
      "meaning": "Strikingly out of place, not fitting with the surroundings or context. An incongruous element jars because it does not belong.",
      "bengali": "বেমানান"
    },
    "disparate": {
      "meaning": "Fundamentally different and impossible to compare. Disparate things are so unlike each other that bringing them together seems odd.",
      "bengali": "সম্পূর্ণ ভিন্ন"
    },
    "intricate": {
      "meaning": "Complex and detailed with many interconnected parts. An intricate design rewards close examination by revealing new layers.",
      "bengali": "জটিল ও বিস্তারিত"
    },
    "portentous": {
      "meaning": "Signaling that something serious or ominous is about to happen. A portentous event carries heavy significance for what follows.",
      "bengali": "অশুভ লক্ষণপূর্ণ"
    },
    "chimerical": {
      "meaning": "Wildly unrealistic and existing only in fantasy or imagination. A chimerical plan is as impossible as the mythical chimera.",
      "bengali": "অলীক ও কাল্পনিক"
    },
    "quixotic": {
      "meaning": "Pursuing noble but hopelessly unrealistic ideals, like Don Quixote tilting at windmills. Quixotic efforts are admirable but impractical.",
      "bengali": "অবাস্তব আদর্শবাদী"
    },
    "utopian": {
      "meaning": "Describing an idealistic vision of perfection that is impossibly unrealistic. Utopian plans sound wonderful but cannot work in practice.",
      "bengali": "আদর্শলোকের"
    },
    "unexceptionable": {
      "meaning": "Not open to any objection, perfectly acceptable to everyone. Something unexceptionable is so inoffensive that nobody can complain about it.",
      "bengali": "আপত্তিহীন"
    },
    "meandering": {
      "meaning": "Wandering without clear direction or purpose, taking a winding, indirect path. Meandering prose lacks focus and direction.",
      "bengali": "বিচরণশীল"
    },
    "groove": {
      "meaning": "A natural, comfortable rhythm or pattern of work. Being in a groove means flowing smoothly without friction.",
      "bengali": "সুচারু ছন্দ"
    }
  }
}